{"id": "de7d2e43-1e9c-3b5f-8802-0b28390a8fc8", "ticker": "V", "title": "Prediction: Stablecoins Are About to Soar. Here's Why.", "summary": "New legislation may mark a tipping point for stablecoins.", "url": "https://www.fool.com/investing/2025/08/10/prediction-stablecoins-are-about-to-soar-heres-why/", "published_at": "2025-08-10T10:30:00Z", "source": "Motley Fool", "text": "New legislation may mark a tipping point for stablecoins.\n\nThe stablecoin market has grown dramatically in recent years. According to data compiled by Visa, stablecoin supply increased from about $12 billion in 2020 to $220 billion in 2025. Some insiders think that's only the start, with Galaxy Digital Holdings predicting stablecoin supply will exceed $400 billion this year. Treasury Secretary Scott Bessent thinks it could reach $2 trillion by 2028.\n\nStablecoins are cryptocurrencies that are pegged to real-world assets such as the U.S. dollar. They offer users the benefits of the blockchain -- such as speedy, low-cost transactions -- without the volatility of other cryptocurrencies like Bitcoin or Ethereum (ETH 0.97%).\n\nLet's look at why stablecoins are set to soar, what might hold them back, and how investors can take advantage of this emerging trend.\n\nWhy stablecoins are about to soar\n\nStablecoins have been gaining traction for several years. Various companies, including cryptocurrency exchanges, payment processors, and banks, have made big strides in integrating stablecoins into their operations.\n\nTwo promising stablecoin use cases are international money transfers and payments. The World Bank says the average cost of remittances is about 6.4% of the transfer amount right now. Coinbase estimates that stablecoins could cut this to between 0.5% and 3%.\n\nBut the reason stablecoins could take off now is that lawmakers have given them a launchpad. In June, the U.S. government passed the Genius Act, legislation that gives a clear framework for stablecoins. It contains guidelines for stablecoin issuers about reserve requirements, audits, and anti-money laundering practices. It paves the way for both banks and non-banks to issue stablecoins.\n\nNot only does the new legislation remove roadblocks that had made companies hesitant about pursuing this emerging technology, but it also goes a long way toward building consumer confidence. Investors lost billions of dollars after the collapse of the TerraUSD stablecoin in 2022. Now, people want to be sure that stablecoins will retain their value and that issuers have enough reserves to support their tokens.\n\nHow investors can ride the stablecoin wave\n\nRight now, stablecoins only account for 1% of global money flows, according to consulting firm McKinsey. Recent regulatory changes could well unlock further growth, but to do so, there will also need to be further technical development and a shift in consumer habits. It isn't yet clear how the market will evolve. For example, we may see big companies issuing their own stablecoins or existing players dominating the stablecoin spectrum.\n\nHere are two approaches investors might take:\n\n1. Invest in listed companies that may profit from a stablecoin explosion\n\nMany of the businesses in the crypto industry remain privately held, which somewhat limits the stablecoin plays available to investors. However, there are opportunities in crypto exchanges, stablecoin issuers, and payment infrastructure.\n\nThese include:\n\nCircle CRCL 3.92% ) : Circle, which issues the popular stablecoin USD Coin USDC -0.00% ) initially rose by 700%. It has fallen since then, and some see it as still overvalued.\n\nCircle, which issues the popular stablecoin initially rose by 700%. It has fallen since then, and some see it as still overvalued. Coinbase: The first crypto exchange listed in the U.S. joined the S&P 500 earlier this year. However, its stock fell recently on the back of disappointing Q2 earnings and mounting concerns that competitors will take market share.\n\nThe first crypto exchange listed in the U.S. joined the earlier this year. However, its stock fell recently on the back of disappointing Q2 earnings and mounting concerns that competitors will take market share. Robinhood HOOD 3.09% ) : The pioneer of low-cost investing has also been at the forefront of making digital assets more accessible. In terms of stablecoins, Robinhood is part of the consortium that is behind the Global Dollar USDG -0.01% )\n\nThe pioneer of low-cost investing has also been at the forefront of making digital assets more accessible. In terms of stablecoins, Robinhood is part of the consortium that is behind the PayPal PYPL -0.84% ) : The payment giant launched its own stablecoin, PayPal USD PYUSD 0.02% )\n\nBear in mind that some think speculation around cryptocurrency and stablecoin growth has already pushed the prices of several of these companies to unsustainable highs. Go beyond short-term trends and research the long-term outlook before investing.\n\n2. Invest in the cryptocurrency ecosystems where stablecoins are being built\n\nStablecoins run on smart-contract blockchains, which can host self-executing pieces of code and act as ecosystems for other projects. If stablecoins take off, that could mean an increase in transactions for programmable blockchains like Ethereum, Tron (TRX 0.16%), and Solana (SOL 1.51%). That would mean more transaction fees, more assets on those networks, and -- ultimately -- a more secure future.\n\nLeading the pack right now is Ethereum. CoinGecko research shows that almost 50% of stablecoins are built on Ethereum. And a Galaxy report reveals that 50 non-crypto companies, including Louis Vuitton, Adidas, and Deutsche Bank, are using Ethereum to build products. It says the total value of stablecoins on Ethereum has increased by 70% during the past year.\n\nThere is one caveat: Some companies may build their own blockchains rather than rely on existing networks. That could give them more control and potentially be a more profitable way to enter the stablecoin sector, but it would mean today's cryptocurrencies don't benefit as much from stablecoin development.\n\nIt is still early days for stablecoins\n\nThe recent legislative changes come after years of stablecoin development work, meaning some projects may be able to storm ahead now that the regulatory road is clear. A soaring stablecoin market could transform our financial infrastructure, but there are still significant risks worth understanding.\n\nFor example, there are security, consumer protections, and privacy concerns that have yet to fully play out. Plus, while the Genius Act reduces the danger that a stablecoin will lose its peg or collapse completely, it is not impossible. It's important to ensure crypto investments make up only a small part of a diversified portfolio.\n\nNonetheless, mainstream adoption of stablecoins may be the biggest real-world use of crypto so far. If even a small percentage of that usage takes place on existing blockchains, that could be another major step toward mainstream adoption.", "fulltext_ok": true, "error": null, "fetched_at": "2025-08-11T10:34:56.913342+00:00"}
{"id": "4a1a831d-44c4-3b3f-982a-088b85160ef7", "ticker": "V", "title": "Better Growth Stock: Costco vs. Visa", "summary": "A great business can still be a bad investment if you pay too much for it.", "url": "https://www.fool.com/investing/2025/08/10/better-growth-stock-costco-vs-visa/", "published_at": "2025-08-10T09:10:00Z", "source": "Motley Fool", "text": "A great business can still be a bad investment if you pay too much for it.\n\nVisa (V 1.44%) and Costco Wholesale (COST 0.39%) both are attractive and well-run businesses. A key highlight for each is growth. Before you go and buy either one, however, you need to consider the value of what you are buying. If you do that, you will likely want to keep one of these growth stocks on your wish list while you buy the other.\n\nGrowth is the name of the game\n\nIn the third quarter of fiscal 2025, ended June 30, Visa's revenue rose 14% with adjusted earnings up 23%. Those are impressive growth statistics. The big story here, however, isn't one quarter. Visa's payment processing services connect buyers and sellers, with the big trend being the ever-increasing use of digital and card payments over cash. That's not likely to end anytime soon, so the long string of strong financial results Visa has put up is likely to keep going.\n\nCostco's third-quarter fiscal 2025 financial results, for the period ended May 11, were strong, too. This club store retailer saw its top line expand by 8%, with same-store sales up a solid 5.7%. Earnings rose 13%. The retailer's club store model, which requires customers to pay a yearly membership fee, creates an annuity-like income stream and gives Costco the wherewithal to accept lower margins. It has been a winning model for decades and there's no reason to believe that's going to change.\n\nTwo good businesses, but one is a better value\n\nWall Street isn't oblivious to the growth stories here. So neither Costco nor Visa are cheap stocks, from a valuation perspective. Which is where Benjamin Graham, the man who helped to train Warren Buffett, comes into the story. To paraphrase Buffett's mentor, even a great company can be a bad investment if you pay too much for it.\n\nRight now, investors are paying a rich premium for Costco's stock. The price-to-sales ratio is currently about 1.6 versus a five-year average of roughly 1.1. The price-to-earnings ratio is about 55 today, versus a long-term average of 43. And the retailer's price-to-book value ratio is about 16 compared to a five-year average that's just under 12. As if that weren't bad enough, the lofty P/E ratio is currently near the highest levels in the company's history. This is a very expensive stock.\n\nIn contrast, Visa's valuation looks much more reasonable. The financial giant's P/S ratio is 16.3 versus a five-year average of 17.7. Its P/E ratio is 32 versus a longer-term average of 34. But the P/B ratio is about 17 versus a five-year average of closer to 13. That said, the dividend yield, while only 0.7% or so, is actually toward the higher side for Visa, historically speaking. (By comparison, Costco's yield is about 0.6%, and it's near the lowest levels in the retailer's history.)\n\nAlthough it wouldn't be fair to suggest that Visa is cheap today, it looks fairly priced -- and much less expensive than Costco. All in, if you are a growth investor, you will probably want to look at Visa as a potential buy. Costco should stay on the wish list.\n\nThere's nothing wrong with growth, but you still need to consider valuation\n\nJust buying willy nilly into a growing business is a risky move. Sure, that growth could pan out and lead to material stock price gains. But Wall Street often prices lots of good news into the stocks of fast-growing companies, extrapolating growth trends far into the future. That's why most growth investors should really be growth at a reasonable price, or GARP, investors. And if you follow the GARP model, Visa is likely to win out over Costco today.", "fulltext_ok": true, "error": null, "fetched_at": "2025-08-11T10:34:58.474698+00:00"}
{"id": "d5db06c5-e4e6-3e73-a392-67b83c704408", "ticker": "V", "title": "WEX or V: Which Is the Better Value Stock Right Now?", "summary": "WEX vs. V: Which Stock Is the Better Value Option?", "url": "https://finance.yahoo.com/news/wex-v-better-value-stock-154002726.html", "published_at": "2025-08-08T15:40:02Z", "source": "Zacks", "text": "Investors with an interest in Financial Transaction Services stocks have likely encountered both Wex (WEX) and Visa (V). But which of these two stocks is more attractive to value investors? We'll need to take a closer look to find out.\n\nThe best way to find great value stocks is to pair a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system. The proven Zacks Rank emphasizes companies with positive estimate revision trends, and our Style Scores highlight stocks with specific traits.\n\nWex and Visa are sporting Zacks Ranks of #1 (Strong Buy) and #3 (Hold), respectively, right now. This means that WEX's earnings estimate revision activity has been more impressive, so investors should feel comfortable with its improving analyst outlook. But this is just one piece of the puzzle for value investors.\n\nValue investors also try to analyze a wide range of traditional figures and metrics to help determine whether a company is undervalued at its current share price levels.\n\nOur Value category grades stocks based on a number of key metrics, including the tried-and-true P/E ratio, the P/S ratio, earnings yield, and cash flow per share, as well as a variety of other fundamentals that value investors frequently use.\n\nWEX currently has a forward P/E ratio of 10.91, while V has a forward P/E of 29.08. We also note that WEX has a PEG ratio of 1.38. This figure is similar to the commonly-used P/E ratio, with the PEG ratio also factoring in a company's expected earnings growth rate. V currently has a PEG ratio of 2.21.\n\nAnother notable valuation metric for WEX is its P/B ratio of 5.95. Investors use the P/B ratio to look at a stock's market value versus its book value, which is defined as total assets minus total liabilities. By comparison, V has a P/B of 16.21.\n\nThese metrics, and several others, help WEX earn a Value grade of B, while V has been given a Value grade of D.\n\nWEX stands above V thanks to its solid earnings outlook, and based on these valuation figures, we also feel that WEX is the superior value option right now.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nWEX Inc. (WEX) : Free Stock Analysis Report\n\nVisa Inc. (V) : Free Stock Analysis Report\n\nThis article originally published on Zacks Investment Research (zacks.com).\n\nZacks Investment Research", "fulltext_ok": true, "error": null, "fetched_at": "2025-08-11T10:35:00.091429+00:00"}
{"id": "f408c981-3977-341c-8e6a-0e32312ce499", "ticker": "V", "title": "George Kamel: Visa Wants AI To Spend Your Money — 4 Reasons It’s Bad for Your Finances", "summary": "In a YouTube video Kamel goes over how AI is changing the way we spend money and four potential risks of letting a machine shop for you.", "url": "https://finance.yahoo.com/news/george-kamel-visa-wants-ai-153921571.html", "published_at": "2025-08-08T15:39:21Z", "source": "GOBankingRates", "text": "Artificial intelligence (AI) has infiltrated nearly every aspect of our lives, from our emails to the ads we see on TV. AI is constantly using data to control what we see, when we see it and how we use the information. It should come as no surprise that major financial institutions like Visa are harnessing the power of AI to make more money by spending ours.\n\nFor You: I Made $10,000 Using One of Dave Ramsey’s Best Passive Income Ideas\n\nSee Next: 7 Tax Loopholes the Rich Use To Pay Less and Build More Wealth\n\nPersonal finance expert and national bestselling author George Kamel recently weighed in on his YouTube channel about the controversy. In a YouTube video Kamel goes over how AI is changing the way we spend money and four potential risks of letting a machine shop for you.\n\nAI-Powered Shopping Assistance\n\nMajor credit card companies like Visa and Mastercard have embraced the idea that AI is the future, but it comes at a cost to consumers. Earlier this year, the financial giants announced initiatives within days of each other that would allow AI agents to not only assist with researching and comparing products, but also providing them with purchasing power.\n\nAccording to an April 30, 2025 press release, Visa will be collaborating with major AI players including OpenAI and Anthropic to bring consumers “Visa Intelligent Commerce.” The product allows AI agents to find and buy items based on preferences pre-selected by consumers.\n\nCheck Out: 4 Secrets of the Truly Wealthy, According To Dave Ramsey\n\nThe announcement comes on the heels of a similar initiative launched by Mastercard the day before. Referred to as “Agent Pay,” the concept hopes to “scale agentic commerce.” As with Visa’s Intelligent Commerce program, Agent Pay allows AI to not only suggest products and services but also to purchase them.\n\nRisks Associated With AI Personal Shoppers\n\nWhile agentic commerce may be the future, it doesn’t come without risks. As George Kamel pointed out, having artificial intelligence select and make purchases on your behalf can lead to less control over your money. On his YouTube channel, Kamel cautioned consumers about four main reasons these new initiatives may be bad in the long run.\n\nFrictionless Spending\n\nOne of the potential downsides of AI powered spending is that it removes any friction from the purchasing process. As Kamel pointed out, spending becomes fast and easy. It is harder to keep track of when there aren’t any checkpoints, like having to enter a credit card number to buy something. He explained that “as friction goes down, the danger of overspending goes up.”", "fulltext_ok": true, "error": null, "fetched_at": "2025-08-11T10:35:01.608532+00:00"}
{"id": "704a0489-131d-3687-bac2-15063ce827af", "ticker": "V", "title": "Visa's Solid Q3 Momentum Meets a Puzzling Pullback: Right Time to Buy?", "summary": "Visa posts double-digit Q3 gains in cross-border volumes and earnings, but shares slide 5.5% amid rising costs and regulatory risks.", "url": "https://finance.yahoo.com/news/visas-solid-q3-momentum-meets-144800655.html", "published_at": "2025-08-08T14:48:00Z", "source": "Zacks", "text": "Visa Inc. V, the global payments technology leader, posted another robust quarterly performance in the third quarter of fiscal 2025, fueled by resilient consumer spending and strong growth in cross-border transactions. The company saw healthy gains in processed transactions, value-added services, and total payment volumes, underscoring the strength of its vast global network and the accelerating adoption of digital payments.\n\nHowever, since reporting results on July 29, the stock has fallen 5.5%, pulling it away from its 52-week high of $375.51. This raises a key question for investors: Is the stock’s recent dip a sign of weakness or simply a pause in an otherwise strong growth story?\n\nKey Highlights From Visa’s Q3 Earnings\n\nEarnings & Sales Beat: Visa’s EPS of $2.98 beat the Zacks Consensus Estimate by 4.2% and grew 23.1% year over year. Also, the top line of $10.2 billion beat the consensus mark by 3.1% and improved 14.3% from a year ago.\n\nMajor Metrics Remain Solid: Processed transactions grew 10% year over year to 65.4 billion and beat our model estimate. On a constant-dollar basis, cross-border volumes surged 12% year over year, as travel activity continued to gain momentum. Also, its payment volumes grew 8% year over year on a constant-dollar basis.\n\nVisa Stays Resilient: Despite macro headwinds, such as inflation, lower household savings, recession concerns and tariff-related volatility, Visa’s transaction-based business model, less dependent on specific spending categories, has kept its performance resilient.\n\nFor more insights, read our blog: Visa Q3 Earnings Beat Estimates on Strong Cross-Border Volumes.\n\nVisa’s Network Strength\n\nVisa’s competitive advantage stems from powerful network effects, where increased adoption by consumers and businesses strengthens both scale and profitability. Backed by robust cash flows, the company continues to invest in infrastructure, marketing and innovation, reinforcing its long-term edge. With global digital payment adoption accelerating, Visa’s $626.9 billion market cap and dominant international presence leave it well-positioned for sustained growth.\n\nVisa Continues to Reward Shareholders\n\nShareholder returns remain a priority. During the quarter, Visa returned $6 billion to investors, including $4.8 billion in share repurchases and $1.2 billion in dividends. As of June 30, 2025, $29.8 billion remained under its buyback authorization. The dividend yield stands at 0.71%, above the industry average of 0.65%, and the company has a consistent record of dividend increases.", "fulltext_ok": true, "error": null, "fetched_at": "2025-08-11T10:35:03.188331+00:00"}
{"id": "807417c0-8767-329f-b926-1a6fccac6366", "ticker": "V", "title": "AmEx Gets a Taste of Toast: And a Bigger Bite of Hospitality?", "summary": "AXP partners with Toast to blend dining data and payments, aiming to redefine hospitality from reservation to checkout.", "url": "https://finance.yahoo.com/news/amex-gets-taste-toast-bigger-145300079.html", "published_at": "2025-08-07T14:53:00Z", "source": "Zacks", "text": "American Express Company AXP has formed a multi-year strategic partnership with Toast, Inc. TOST, a restaurant technology platform, to elevate hospitality experiences. As part of this move, AmEx is integrating guest data from its restaurant reservation platforms, Resy and Tock, into Toast’s hardware and software systems. This means servers using Toast Go handhelds or POS terminals will now be able to access real-time guest preferences, enabling more personalized service.\n\nIn addition, Resy and Tock listings will become visible on Toast’s platforms, like Local by Toast and Toast Tables. This partnership is important because it strengthens AmEx’s position in the restaurant and hospitality ecosystem. By merging its dining network with Toast’s operational tools, AXP creates a more seamless guest experience while expanding its influence over the customer journey, from reservation to payment.\n\nIt also helps differentiate AXP from competitors by linking card membership to exclusive, data-enhanced hospitality services. Financially, AmEx stands to benefit through increased cardmember engagement and spending. More personalized experiences can drive higher loyalty and usage of AmEx cards at participating venues.\n\nRestaurants using Toast may prefer AmEx partnerships due to the enhanced marketing, visibility and data access, potentially improving retention and attracting more restaurants to its platform. Overall, the collaboration positions AXP to deepen customer relationships and expand merchant acceptance, while Toast gains access to new traffic sources and tools to boost hospitality outcomes. Moves like this signal AmEx’s growing focus on tech-savvy Millennials and Gen-Z consumers, who tend to spend more than their older counterparts.\n\nAmEx’s Full-Course Advantage Over Visa & Mastercard\n\nAmEx sets itself apart from peers like Visa Inc. V and Mastercard Incorporated MA by integrating deeply into the hospitality journey, not just at payment, but from reservation to service. Through partnerships and acquisitions, AXP offers personalized dining experiences, like servers accessing guest preferences in real time. This end-to-end control allows AmEx to create value beyond transactions, reinforcing its premium image. Visa and Mastercard, as payments-focused networks, lack similar consumer-facing platforms. By owning key touchpoints and enhancing loyalty through exclusive services, AXP positions itself as more than a payment processor; it's a hospitality partner, offering benefits that peers cannot easily replicate.\n\nAmEx’sPrice Performance, Valuation and Estimates\n\nShares of AXP have declined 0.5% in the year-to-date period against the industry’s growth of 2.3%.", "fulltext_ok": true, "error": null, "fetched_at": "2025-08-11T10:35:04.789909+00:00"}
{"id": "2e163611-b29a-3963-9183-3fb4c6cb4923", "ticker": "V", "title": "Visa Stock: Analyst Estimates & Ratings", "summary": "Due to Visa's strong performance relative to the broader market over the past year, Wall Street analysts remain strongly optimistic about the stock’s prospects.", "url": "https://www.barchart.com/story/news/33963428/visa-stock-analyst-estimates-ratings", "published_at": "2025-08-07T13:54:36Z", "source": "Barchart", "text": "Switch the Market flag\n\nOpen the menu and switch the\n\nMarket flag for targeted data from your country of choice.\n\nfor targeted data from your country of choice.", "fulltext_ok": true, "error": null, "fetched_at": "2025-08-11T10:35:06.269038+00:00"}
{"id": "edd9a85e-c3db-33ff-a73e-16d839bb7984", "ticker": "V", "title": "2 Warren Buffett Stocks to Buy Hand Over Fist in August", "summary": "These stocks are benefiting from improvements in consumer spending.", "url": "https://www.fool.com/investing/2025/08/06/3-warren-buffett-stocks-to-buy-hand-over-fist-in-a/", "published_at": "2025-08-06T12:30:00Z", "source": "Motley Fool", "text": "These stocks are benefiting from improvements in consumer spending.\n\nWarren Buffett is stepping down soon as the CEO of Berkshire Hathaway, but he still has some time left to make decisions in his role. It will be intriguing to see whether or not incoming CEO Greg Abel makes any major changes to the company's equity portfolio when he takes over.\n\nWhatever happens, Buffett will remain an investing legend for Berkshire Hathaway's incredible performance during his tenure. Many of his stocks are still solid buys today, and Visa (V 1.44%) and American Express (AXP 0.89%) look like good ones right now.\n\n1. Visa: Growing with the economy\n\nVisa is the largest credit card network in the world. It has more than $16 trillion in trailing-12-month payment volume and works with 14,500 partnering institutions. It's accepted by more than 150 million merchants.\n\nIn general, Visa's performance is a good indication of what's happening in the economy, since it depends on consumer spending. In its fiscal 2025's third quarter (ended March 31), the company demonstrated momentum, and it expects that to persist.\n\nRevenue increased 14% year over year to $10.2 billion, beating analyst expectations of $9.85 billion. Earnings per share (EPS) based on adjusted generally accepted accounting principles were up 23% to $2.98, higher than Wall Street expectations of $2.85. Management said there was resilience in both discretionary and nondiscretionary categories.\n\nAlthough Visa is an established financial giant, it's very much in tune with new technology and other trends. It pioneered the chip-enabled credit cards that make contactless payments possible and are still a relatively new phenomenon, and it's bringing artificial intelligence (AI) and stablecoins into new product development.\n\nFor example, it's testing Visa Intelligent Commerce, which allows customers to make purchases through AI agents. The company has moved beyond being a simple credit card network, and its other categories are driving higher growth. Visa Direct, for example, is the largest global money-movement program in the world, and transactions increased 25% year over year in the second quarter.\n\nThe stock dropped after the company announced third-quarter earnings this week. The market seemed disappointed that it didn't raise its full-year outlook, even though it maintained that tariffs wouldn't have a strong negative effect. The stock is still outpacing the S&P 500 this year, but it's a great time to buy shares before they start climbing again.\n\n2. American Express: The closed-loop model\n\nAmerican Express is also a credit card network, but it's a lot more than that, too. It has features that make it stand out from other financial stocks and that make it one of Buffett's favorite stocks.\n\nBeyond its credit cards, Amex also has a full banking segment. It has a closed-loop model, which means it funds its own credit cards, rather than partnering with other financial institutions, like Visa does.\n\nThere are several benefits to this model. One is that as a bank, it has a lot of cash from deposits, with which it makes net interest income. That's a great feature for when interest rates are high and spending is low, which hurts the credit card segment. In the second quarter, net interest income increased 14% over last year and represented about 23% of total revenue.\n\nIt also has a fee-based model, and although it does offer some no-fee options, most of its cards have an annual fee. That creates a cycle of recurring revenue and generates loyalty; customers love the rewards program that they get by paying the annual fee. Revenue increased 9% year over year in the 2025 second quarter, and fees increased 20%, accounting for 14% of the total.\n\nThe company targets an affluent clientele that's generally more resilient than the mass market and tends to spend more. It's resonating with younger shoppers, who continue to drive growth. Millennials' spending increased 10% year over year in the second quarter, and Gen-Z spending was up 40%. As they use Amex products throughout their financial journeys, they're likely to fuel growth for a long time.\n\nThe company added 3.1 million new cards in the second quarter, which is a typical addition for AmEx. 1.5 million were U.S. consumer cards (the remainder were business or international consumer cards), which is low for the industry.\n\nThe beauty of this is that AmEx doesn't need to add millions of customers to get the same revenue as other credit card companies do because its customers spend much more than the mass consumer. Adding fewer customers but higher-spending ones each quarter leaves open a long growth runway. For comparison, its trailing-12-month revenue is almost double Visa's.\n\nWall Street wasn't thrilled with the company's second-quarter results, as was the case with Visa, indicating that the market is expecting more in light of the improving economy. American Express stock is up just slightly year to date, but it offers years of continued potential gains for long-term investors.", "fulltext_ok": true, "error": null, "fetched_at": "2025-08-11T10:35:07.760567+00:00"}
{"id": "f64b9602-ae0f-3408-93b4-947c2a3ef71e", "ticker": "V", "title": "Exclusive: Visa announces new cybersecurity protections in the wake of rising scams", "summary": "Visa is unveiling tailored tools, expert support, and proactive defenses for businesses.", "url": "https://www.fastcompany.com/91379232/visa-announces-new-cybersecurity-protections-in-the-wake-of-rising-scams", "published_at": "2025-08-06T12:00:00Z", "source": "FastCompany", "fulltext_ok": false, "error": "Article `download()` failed with 403 Client Error: Forbidden for url: https://www.fastcompany.com/91379232/visa-announces-new-cybersecurity-protections-in-the-wake-of-rising-scams on URL https://www.fastcompany.com/91379232/visa-announces-new-cybersecurity-protections-in-the-wake-of-rising-scams", "fetched_at": "2025-08-11T10:35:08.678876+00:00"}
{"id": "7cacecf4-9223-3671-b7a0-1120cf7b5b6b", "ticker": "V", "title": "Coffee, Chips, and Credit Cards", "summary": "Reports from Starbucks, Visa, and Spotify give us a read on the consumer, and Samsung takes a big chip order from Tesla.", "url": "https://www.fool.com/investing/2025/08/06/coffee-chips-and-credit-cards/", "published_at": "2025-08-06T11:49:00Z", "source": "Motley Fool", "text": "Reports from Starbucks, Visa, and Spotify give us a read on the consumer, and Samsung takes a big chip order from Tesla.\n\nIn this podcast, Motley Fool contributors Travis Hoium, Lou Whiteman, and Rachel Warren discuss:\n\nTesla 's chip deal with Samsung .\n\n's chip deal with . Earnings reports from Spotify , Visa, Starbucks , and Booking Holdings .\n\n, , and . Are you bull or bear?\n\nTo catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. When you're ready to invest, check out this top 10 list of stocks to buy.\n\nA full transcript is below.\n\nThis podcast was recorded on July 30, 2025.\n\nTravis Hoium: Is earning season selling us a Bill of Goods. Motley Fool Money starts now. I'm Travis Hoium joined by longtime fools, Lou the Legend Whiteman, and from a vacation that never ends. Rachel Warren. Today we're going to get to earnings from Spotify and get a pulse on the consumer. Let's start with Tesla. We learned this week that Samsung's new fab in Texas is going to be making Tesla's AI six Chip. This follows AI 5, which is being fabbed by TSMC. AI 6 is going to be used for humanoid robots, cars, and even AI data centers. Tesla could spend over 16.5 billion dollar on these chips, and Elon Musk is going to get to walk the line, making sure it's efficient, something Samsung apparently can't do itself. Rachel, what does this say about Tesla and Samsung's chip ambitions?\n\nRachel Warren: Well, what's interesting about this is that Samsung didn't name the counterparty in its filing. They cited a request from that second party to protect trade secrets. But they said the effective start date of the contract was July of this year. Its end date is in 2033, and then Elon Musk later confirmed in a reply to a post on X that Tesla was, in fact, the counterparty. But I think this deal is great news for both companies for different reasons. Samsung definitely needs this deal, in my view. The partnership provides a much needed anchor client for Samsung's new semiconductor fabrication facility in Taylor, Texas. That could also validate their investment in US based chip manufacturing and potentially attract other clients. Samsung has been facing serious challenges due to increased competition, particularly in the memory chip market, and they've really been struggling to keep up with the demand for advanced AI chips.\n\nTheir logic chip business has also faced challenges and in foundry services, which is manufacturing chips for other companies, they are behind TSMC. Now, for Tesla's part, it's gaining greater control over a crucial element of its AI infrastructure. It's diversifying its supply chain, and it's reducing reliance on a single manufacturer. That could mitigate a range of potential future risks and ensure a more stable supply of critical components. And finally, it positions Tesla to maintain a competitive advantage in a rapidly evolving AI and automotive landscape. It suggests that they're planning for future generations of AI chips that could ensure a pipeline of advanced technology for years to come.\n\nTravis Hoium: Lou, I have lots of questions about how many chips Tesla is going to need going forward for vehicles, robots, and those AI data centers because a lot of those products just frankly, don't exist yet. But US chip manufacturing does seem to be booming. The TSMC plant in Arizona, going through another addition, their costs actually seem to be sort of under control there. It's not as expensive as they feared. Has the US chip tide shifted over the past couple of years?\n\nLou Whiteman: Fun fact, lost in a narrative, but the US has more semiconductor plants than Taiwan. The US is second only to Japan in terms of semi production and that's been true for a while. Context matters, though? Taiwan, thanks to its national champion, Taiwan Semi, and their deals with Nvidia, all of these AI players, they have a strong share of the cutting edge chips used in AI. Obviously, that's the focus, so that's what we're looking at. I don't think we can say the tide has shifted. It's way too early to raise the mission accomplished banner. The US is making steady progress, and this deal is definitely part of that progress. But, look, we are still very reliant on Taiwan for those high powered AI chips, and that hasn't shifted. That's still true.\n\nTravis Hoium: If these chips do their job, hopefully one of these humanoid robots can do my laundry or mow the lawn for me sometime in the near future. Let's move on to earnings. You may be listening to this podcast on Spotify, so we should probably check in on their earnings. Revenue for the second quarter of 2025 was up 10% to 4.2 billion euros. Free cash flow was 700 million euros. That's a huge improvement from a few years ago, but the stock was down as much as 12% on Tuesday. Lou, was this really a disappointing quarter?\n\nLou Whiteman: Relative to expectations, yes, but I think it is important to look at the big picture here. Yes, revenue missed estimates, and, yes, the company posted an unexpected loss. But if you look at it, the revenue miss was mostly due to about 100 million euros worth of currency fluctuation losses. Back that out, back out just the currency conversion noise and revenue is basically in line, which is much better. On the earning side, there were some higher personnel costs. There is some cost creep, but much of the loss was tied to what they call social charges, which is basically stock based compensation. Back all this out. It's worth noting that the underlying numbers how the business is doing looked a lot better. Free cash flow is up 43% to 700 million euros. The all important number of premium subscribers continues to grow up 12% to 276 million. There are no signs of distress here. There are no signs of worry. This is still a very, very good operating business. They just got caught up in some accounting things.\n\nRachel Warren: Yeah. These results warrant the stock dropping and having its worst trading day in two years? I think that might be a bit of a market overreaction. But it does also fit in with the types of market movements we've seen in recent earning seasons. When a company misses on maybe a couple key metrics. Even if the overall picture remains positive, as it does, in my view, for Spotify. CEO Daniel Eche acknowledged that the company's ad supported revenue growth. It's been slower than anticipated. And he attributed that to execution challenges rather than actual strategic issues. It's worth noting that their ad supported revenue declined by about 1% year over year in the quarter. But revenue from premium subscribers actually rose 12% from one year ago. It's also worth noting monthly active users grew 11% year over year to 696 million.\n\nThat means that Spotify added 18 million monthly active users in Q2 versus the guidance they had previously given for 11 million. And they also achieved premium subscriber net additions of 8 million, which far exceeded their guidance of 3 million. You also saw gross margin rise to 31.5%, and a lot of that was attributable to premium revenue growth outpacing music costs, as well as improved contributions from areas like podcasts and music. Spotify is expecting continued strong user and subscriber growth. Going into Q3, they're looking to achieve as many as 710 million monthly active users and 281 million premium subscribers. They had about 8.4 billion euros of liquidity on hand, as well, at the end of the quarter. I still think this is a solid business.\n\nTravis Hoium: Yeah, they talked a lot about improving that ad business on the conference call. We'll see if they can do that in the future. For some context, Spotify stock is up 385% in the past three years, even after yesterday's drop. But the price of sales multiple is up 240%. A lot of multiple expansion there. When stocks go up, expectations rise, and sometimes even a good report isn't enough to impress investors. I think that's the big story. Next up, we're going to talk coffee and credit cards, get a glimpse of how the consumers doing. You're listening to Motley Fool Money.\n\nThe biggest question this time of year is what is the consumer feeling? How healthy are they? Last week, banks said that consumers were doing fine. Late on Tuesday, we heard from visa Starbucks and booking.com. Lou, let's start with visa because they have the widest view of the economy overall. What did we learn?\n\nLou Whiteman: Visa topped expectations, grew adjusted earnings by 23%. But as you say, the big news, CEO Ryan McNern's comments about the consumer, that's what really stood out. He called the consumer spending resilient, even non discretionary, which I found interesting. He also said it has remained so past the end of the quarter into July. So, all as well, great news. But it is worth noting, Travis, that even with this perceived strength, Visa held guidance steady for the rest of the year. No beaten race here. It appears they're at least hedging their bets a bit or at least a little worried. Definitely not sounding the alarm, but I'm still curious about what's going on and what will go on in the months to come.\n\nTravis Hoium: Rachel, this one shocked me. Starbucks stock is down over the past six years. That's really a turnaround story right now. Brian Nichol has been brought in to change the direction of the business. Are we seeing progress from their recent results?\n\nRachel Warren: This is definitely a period of transition for the business for Starbucks, and the turnaround is taking time. This is really evidenced by the fact that Starbucks reported that same store sales fell for a sixth straight quarter in their recent report. GAAP earnings per share of $0.49 actually declined 47% year over year. That's a couple of those facts, but we are seeing progress. For example, their net revenue of 9.5 billion dollar in their fiscal third quarter. That exceeded analyst expectations of 9.3 billion in the recent quarter. It was also up 4% year over year. Notably, Starbucks saw its first sales gain in China since 2023 with a 2% increase in comparable store sales, and that was driven by a 6% increase in transactions. Now, we've heard reports that Starbucks is weighing a sale of its China business. That remains to be seen. But this was also the third consecutive quarter of improvements in US transaction comp, although we're still seeing negative growth there. Now Barista turnover is at its lowest since the pandemic. Starbucks is investing an additional $500 million in labor hours for US stores over the next year. It's looking to really improve its customer service and store operations. Finally, Starbucks just announced that they're going to be introducing a new stand-alone store prototype in 2026 with a drive through and more seating. That could be interesting to watch, as well.\n\nTravis Hoium: Yeah. These numbers coming out from restaurants and fast food chains or coffee chains are all over the place. I'm really having a hard time. Chipotle's quarter was a little bit weak. The same store sales comps were down. It just seems very company specific right now. Let's go to our final one of the day. That's booking.com. Fun fact, over the last 20 years, booking stock is up 22,407%. Just a phenomenal run. They reported last night after the market closed, results were solid, but outlook was weak. What's going on, Lou?\n\nLou Whiteman: Yeah. Just an amazing company and a big winner over the years for Motley fool members, so really, really fun to watch. As you say, a really solid quarter came in ahead of estimates, but they did set profit guidance slightly below expectations. I'm going to emphasize slightly here because at the midpoint, they see revenue of 8.63 billion in the current quarter, which is maybe $60,000,000 short of consensus, which is funny that that could cause a sell off. But Travis, you mentioned it before with Spotify, I think the same is true of booking. Great company, great quarter holding up very well in what we thought maybe could be a tricky environment, but there were so much expectations baked into the stock it just had to let off a little steam post earnings. As a long term holder, I don't see much reason to worry about this quarter, even if the stock did sell off.\n\nRachel Warren: Yeah. The company exceeded analyst estimates for Q2 revenue and earnings per share. But it's Q3 guidance for revenue as well as room night growth was lower than anticipated. The market probably also didn't love that double digit decline in earnings, but a lot of this goes back to near term investments the company's making in its platform that are putting pressure on the bottom line. This deceleration of growth, even from strong absolute levels, seems to be scaring some investors. Some might believe the travel boom following the pandemic could be reaching a plateau or perhaps are concerned about a weakening macro environment. This is still a fundamentally well financially bolstered business. Room nights in this recent quarter grew 8% compared to one year ago. Gross bookings were up 13% year over year. Revenue rose 16%.\n\nThey also reached a major milestone with their connected trip transactions on the flagship booking.com platform. This is where customers choose to book more than one travel vertical, and that connected trip transactions cohort represented a low double digit share of booking.com's total transactions. That was up 30% year over year. They also saw growth across other verticals, including flight tickets up 44%. Travel is a cyclical space, but booking does have a very solid and well run business, and I think they have the financial fortitude to withstand any near term shakiness in the overall sector.\n\nTravis Hoium: Yeah. It doesn't seem like any of these companies are reporting bad results. It's just a matter of what those expectations are. Now that we're far enough into earning seasons to get a feel for what the economy looks like or at least what we think it's going to look like over the next three months or so, and what the market is looking for. That's maybe even more important.\n\nI want to give you both a chance to put yourselves on a scale, 100% bull, 100% bear. Where are you on the economy and the market?\n\nRachel Warren: I'd say it probably falls somewhere in the middle. I want to say that roughly 80% of S&P 500 companies that have reported Q2 earnings so far have exceeded earnings per share estimates. That's outperforming both the five year and the ten year averages of about 78% and 75% respectively. In the near term, you've got the impact of policy shifts like tariffs. You've got macro pressures that could stem from them, that could pose realistic challenges both for the economy and the market and I think it's important to recognize that. Could we see another bear market? Absolutely. As a long term investor, though, I do remain incredibly bullish about prospects for great businesses to generate excellent returns for faithful shareholders and for the market's ability to rise with the passage of time. That's what I'm focusing on.\n\nLou Whiteman: For the market, I'm probably 55, 45 in favor of bullishness. Stocks, generally speaking, yeah, they're on the pricey side, if you look at the indexes, and I think that might limit upside for the second half of the year. But I don't see the elements of a crash building. I think the market can grind at these levels, maybe slowly raise. I don't think it's going to be a dramatic up or a dramatic down. The economy, Travis, that side worries me a bit more. I still think that the tariffs are just beginning to hit Main Street, and they're going to hit it a lot worse in the months to come. I don't think that deflates the markets, though, because I think, A, investors are aware of it and, B, if you look back to Sam Adams last week, I think in some cases, we have now estimated such an effect that the tariffs, if they net out at 15% or whatever, I think we might have actually overstated some of the impact in the quarters to com in our estimates. I do think the market can grind higher from here, even if it gets worse on Main Street, but it does feel like it's just going to be a bit of a trudge from here. It's not going to be a rocket ship market or just crisis on the street market. It's just going to be onward.\n\nTravis Hoium: Lou, you brought up tariffs, and I want to get an idea for as we're ending the Q2 earnings season going into Q3, are you expecting more impact from tariffs, whether that's costs that impact company's margins or consumers just behaving differently? If something is more expensive, maybe you don't reduce the amount of money you're spending overall, but the volume goes down because that average sale price is going up for the items that you're buying. What sort of trends are you looking for there as we go to the second half of the year?\n\nLou Whiteman: Here's my best guess. I do think that on both of those, it's a headwind, both for the companies and just the consumer habits. I think it might be manageable enough that we're talking about maybe estimates are in trouble or estimates have to come down a bit, but it's not going to derail a growth story. I think it's going to just be more than noise. It's going to be a headache, but it's not going to be to the extent that it really drives down the economy or drives down the market.\n\nTravis Hoium: A lot to watch in the second half of the year, and we'll be covering it all on Motley Fool Money. As always, people on the program may have interest in the stocks they talk about in the Motley Fool may have formal recommendations for or against, so don't buy or sell stocks based solely on what you hear. All personal finance content follows Motley Pool editorial standards and is not approved by advertisers. Advertisements are sponsored content and provided for informational purposes only. To see our full advertising disclosure, please check our show notes. For Lou Whitman, Rachel Warren and our production magician Bart Shannon and the entire Motley Fool team, I'm Travis Hoium. We'll see you tomorrow.", "fulltext_ok": true, "error": null, "fetched_at": "2025-08-11T10:35:10.412734+00:00"}
{"id": "13ece99f-13f6-3171-ba2b-f0b4744a33cf", "ticker": "V", "title": "2 No-Brainer Warren Buffett Stocks to Buy Right Now", "summary": "There are some good values in Berkshire Hathaway's stock portfolio, but these two are standouts.", "url": "https://www.fool.com/investing/2025/08/06/2-no-brainer-warren-buffett-stocks-to-buy-right-no/", "published_at": "2025-08-06T09:23:00Z", "source": "Motley Fool", "text": "There are some good values in Berkshire Hathaway's stock portfolio, but these two are standouts.\n\nBerkshire Hathaway (BRK.A -0.40%) (BRK.B 0.83%) owns about 40 stocks in its closely watched stock portfolio, many of which were hand-selected by legendary investor Warren Buffett himself. Some of them, such as Visa (V 1.44%) and Mastercard (MA 2.35%), are within striking distance of their all-time highs, while others, such as SiriusXM (SIRI 1.85%), have struggled.\n\nTo be fair, there's a solid buy case to be made for most of Berkshire's stocks. After all, Buffett typically buys stocks because of an attractive valuation, durable competitive advantage, leading market position, or some combination of appealing features. However, there are some that look like complete no-brainers for long-term investors right now, and these are the two I'd be most confident in buying.\n\nAn incredible financial powerhouse\n\nAmerican Express (AXP 0.89%) has perhaps the best combination of growth and asset quality in the financial industry. Its 2% net charge-off rate is about one third of what Capital One (COF 0.45%) and other peers report, and the 30-day delinquency rate is less than half of the industry average.\n\nRecent momentum has been strong, with revenue up by 9% year over year in the most recent quarter and adjusted EPS up by 17%. International growth was impressive, as was the fact that nearly two-thirds of new accounts are from the extremely important millennial and Gen-Z generations. Card fee income (annual fees, mostly) was up by 20% year over year, thanks to the success of some of the company's higher-end card products. The company continues to grow its ecosystem, and the recently announced Coinbase (COIN -0.11%) (COIN -0.11%) One Card is just one example of a big co-branding win.\n\nEven though American Express has been a strong performer with shares up nearly 30% over the past year, the stock still looks attractive at about 18.5 times forward earnings. If the pending refreshes of several key products -- including the flagship, highly lucrative Platinum Card -- are successful, AmEx's fee income growth could get even better.\n\nThe best \"Buffett stock\" of all\n\nYou might not need to dig into Berkshire's portfolio to find the best \"Buffett stock\" to buy. I'd argue that perhaps the best Buffett stock of all to buy right now is Berkshire Hathaway itself.\n\nHere's why. Since Warren Buffett announced his planned retirement from the CEO position at the company's May annual meeting, Berkshire's stock price has fallen by about 14%. And this is despite strong operating earnings, a massive cash stockpile, and generally strong performance in the stock portfolio. Just to name a few of the largest positions, during the same period where Berkshire fell 14%, AmEx has risen by 11%, Bank of America (BAC 2.43%) is up by 14%, and Chevron (CVX 1.21%) is also up by double digits. In fact, every single one of Berkshire's 10 largest stock positions have outperformed the conglomerate's stock price since Buffett made his announcement.\n\nNow, the valuation case for investing in Berkshire has become even more compelling. Berkshire's market cap is about $985 billion, while the value of its stock portfolio is $283 billion and it has $344 billion in cash. This indicates that the market is valuing Berkshire's operating businesses at $358 billion. Excluding investment income, Berkshire has generated $31.4 billion in operating earnings over the past four quarters, indicating a low P/E valuation of just 11.4 for its businesses.\n\nBuy for the long term\n\nI own both stocks in my portfolio and have owned then for more than a decade. And I think they look attractive now because of how I feel they could perform over the next decade, not over the coming weeks or months. There's a lot that could cause short-term volatility in both stocks, but I'm confident that investors who buy today and hold for the long term will be glad they did.", "fulltext_ok": true, "error": null, "fetched_at": "2025-08-11T10:35:12.206612+00:00"}
{"id": "7932d658-dcf8-35aa-b754-6473c1aca73d", "ticker": "V", "title": "The Best Warren Buffett Stock to Buy With $1,000 Right Now", "summary": "This company is an industry leader and isn't showing any signs of slowing down anytime soon.", "url": "https://www.fool.com/investing/2025/08/06/the-best-warren-buffett-stocks-to-buy-with-1000-ri/", "published_at": "2025-08-06T09:00:00Z", "source": "Motley Fool", "text": "This company is an industry leader and isn't showing any signs of slowing down anytime soon.\n\nWarren Buffett has a strong case for being the most well-known name in the investing world. He has spent six decades leading Berkshire Hathaway to become one of the world's premier companies and has made many investors rich along the way.\n\nBuffett and Berkshire's success is largely why investors tend to lean on his investing wisdom and follow many of Berkshire's investing moves. A trillion-dollar corporation and your average investor don't have much in common, but Berkshire's portfolio has become a go-to for inspiration.\n\nIf you have $1,000 to invest, one Buffett and Berkshire stock to consider buying and holding on to for the long haul is Visa (V 1.44%). Visa isn't a large holding in Berkshire's stock portfolio (about 1%), but it's one of the most successful businesses in it.\n\nVisa has a business model built for long-term profitability\n\nVisa has a solid business model where it takes a percentage of every transaction over its network. This lets Visa make money without taking on the risks that come with issuing credit directly or lending money to consumers.\n\nIf someone doesn't pay their credit card bill, the credit card issuer -- usually a bank -- loses money, not Visa. Visa is simply the intermediary. And few intermediaries are in as lucrative a position. In its fiscal third quarter (ended June 30), Visa processed more than 83 billion transactions (up 10% year over year), contributing to the $10.2 billion in revenue it made -- a 14% increases year over year.\n\nVisa's earnings per share (EPS) beat analysts' expectations, coming in at $2.69. That was 12% higher than the same quarter last year and up 177% in the past five years.\n\nEPS can often be a more meaningful metric for investors than revenue because it reflects profitability and shows how much value is created for each share it has.\n\nVisa will be a huge beneficiary of the growth of digital payments\n\nThe world is slowly but surely embracing digital payments and shying away from cash transactions. Digital payments are common in places like the U.S., U.K., and Japan. However, many developing countries remain dependent on cash. This leaves a lot of room for Visa to expand its digital presence and increase its transaction volume.\n\nAccording to Grand View Research, the global digital payment market is expected to have a compound annual growth rate (CAGR) of 21% from 2025 to 2030. Visa won't be the only beneficiary of this growth, but it will undoubtedly be one of the biggest.\n\nOne thing working in Visa's favor is the network effect. Potential merchants are motivated to accept Visa because it's the most widely held card in the world, and potential cardholders are incentivized to get a Visa card because it's the most widely accepted card in the world. It's a virtuous cycle that drives growth.\n\nDividends and stock buybacks are an added bonus for investors\n\nVisa doesn't get talked about as a dividend stock, but it does, in fact, pay one out. Its current yield is a modest 0.7% ($6.70 per $1,000 invested), which is on par with its average during the past five years. It's not enough to consider going yacht shopping, but it's worth noting that it has increased its annual dividend for 17 consecutive years. And given the company's strong financial position, I don't expect this to change.\n\nAside from its dividend, Visa has been returning shareholder value by repurchasing shares. In Q3, it purchased 14 million shares for close to $4.8 billion, bringing the total spent on repurchases in 2025 to more than $13.2 billion. Visa has $29.8 billion more authorized to spend on share repurchases, which I trust management to use wisely as long-term value creator.\n\nIf you're in on Visa for the long haul (which you should be), the dividend and share buybacks are an added bonus to a stock that has shown it can routinely outperform the market.\n\nAs digital payments become more common, Visa's importance in the financial ecosystem will only increase. It's a stock I personally plan to keep in my portfolio for decades to come.", "fulltext_ok": true, "error": null, "fetched_at": "2025-08-11T10:35:13.386901+00:00"}
{"id": "ec6c6943-ae33-3d88-9c5a-b67941d0b83e", "ticker": "V", "title": "Sector Update: Financial Stocks Mixed Late Afternoon", "summary": "Financial stocks were mixed late Tuesday afternoon, with the NYSE Financial Index up 0.1% and the Fi", "url": "https://finance.yahoo.com/news/sector-financial-stocks-mixed-afternoon-195245361.html", "published_at": "2025-08-05T19:52:45Z", "source": "MT Newswires", "text": "Financial stocks were mixed late Tuesday afternoon, with the NYSE Financial Index up 0.1% and the Fi\n\nUpgrade to read this MT Newswires article and get so much more.\n\nA Silver or Gold subscription plan is required to access premium news articles.", "fulltext_ok": true, "error": null, "fetched_at": "2025-08-11T10:35:14.843654+00:00"}
{"id": "7b87c89c-7c06-3736-ae2e-6ccdc3f6440a", "ticker": "V", "title": "Sector Update: Financial", "summary": "Financial stocks were mixed in late Tuesday afternoon trading with the NYSE Financial Index up 0.1%", "url": "https://finance.yahoo.com/news/sector-financial-194134136.html", "published_at": "2025-08-05T19:41:34Z", "source": "MT Newswires", "text": "Financial stocks were mixed in late Tuesday afternoon trading with the NYSE Financial Index up 0.1%\n\nUpgrade to read this MT Newswires article and get so much more.\n\nA Silver or Gold subscription plan is required to access premium news articles.", "fulltext_ok": true, "error": null, "fetched_at": "2025-08-11T10:35:16.453365+00:00"}
{"id": "8f5688a7-211c-34a6-9c55-8d720c37657e", "ticker": "V", "title": "Stablecoins, Assemble: Visa's Playbook Adds More Pages & Blockchains", "summary": "Visa expands its stablecoin reach with new support for PYUSD, USDG and EURC, and adds Stellar and Avalanche to its network.", "url": "https://finance.yahoo.com/news/stablecoins-assemble-visas-playbook-adds-141900014.html", "published_at": "2025-08-05T14:19:00Z", "source": "Zacks", "text": "Visa Inc. V expanded its stablecoin settlement capabilities by adding support for two more USD-backed stablecoins, Global Dollar (“USDG”) and PayPal Holdings, Inc.’s PYPL PayPal USD (“PYUSD”), through a new partnership with Paxos. It also integrated the euro-backed stablecoin EURC and added two additional blockchains, Stellar and Avalanche, to its platform, which already supports Ethereum and Solana.\n\nThis move allows Visa to handle settlements across four stablecoins and four blockchains, strengthening its multi-chain, multi-currency infrastructure. Visa’s focus on stablecoin technology is expected to play a major role in remittances in the coming days.\n\nThis expansion positions Visa as a key player in the evolving digital payments ecosystem. Stablecoins are becoming increasingly relevant for global money movement due to their speed, transparency and lower cost. By supporting multiple coins and blockchains, Visa can meet the needs of a wider range of partners, banks, fintechs, developers and merchants, while helping to simplify and accelerate cross-border and on-chain transactions.\n\nBy integrating more stablecoins and blockchains, Visa opens new revenue streams from settlement fees, cross-border transaction volumes and partnerships with crypto-native businesses. It also strengthens its value proposition to existing clients seeking flexible and modern treasury solutions. As stablecoin adoption grows, Visa's infrastructure will likely become a go-to solution for digital asset settlements, increasing transaction volume on its network and reinforcing its role as a critical payments intermediary in both fiat and digital currency ecosystems.\n\nHow Mastercard and PayPal Are Integrating Stablecoins\n\nVisa’s peers like Mastercard Incorporated MA and PayPal are actively integrating stablecoins to modernize payments. Mastercard also joined Paxos’s Global Dollar Network, enabling support for USDG, USDC, PYUSD and Fiserv’s FIUSD stablecoins. It is also integrating with wallets like MetaMask, OKX, Crypto.com and launching card-based spending via its Multi-Token Network and Mastercard Move settlement rails across 150 million merchants. PayPal’s own USD-backed stablecoin, PYUSD works across its PayPal and Venmo platforms. Both firms aim to provide fast, low-cost, interoperable payments, streamline settlement, expand utility and stay competitive in the evolving digital-currency ecosystem.\n\nVisa’s Price Performance, Valuation and Estimates\n\nShares of Visa have gained 8.3% year to date, outperforming the broader industry and the S&P 500 Index.", "fulltext_ok": true, "error": null, "fetched_at": "2025-08-11T10:35:18.048923+00:00"}
{"id": "98d6b714-6c99-3460-bfc9-241a5e5f7d77", "ticker": "V", "title": "When will you be able to buy a pizza with stablecoin?", "summary": "The Genius Act is law. Here’s how 5 professionals in the payments industry view prospects for the digital currency becoming a daily payment option.", "url": "https://www.paymentsdive.com/news/stablecoins-cryptocurrency-digital-assets-payments/756758/", "published_at": "2025-08-05T10:13:00Z", "source": "Payments Dive", "text": "Listen to the article 7 min This audio is auto-generated. Please let us know if you have feedback\n\nStablecoins have drawn headlines following President Donald Trump’s signing of the Genius Act last month.\n\nUse of digital assets, including stablecoins, have grown steadily for cross-border transactions due to lower costs, less friction and faster settlements, with transaction volume of nearly $28 trillion last year, more than the combined volume of Visa and Mastercard, according to a June 2025 digital payments report from industry consulting firm The Strawhecker Group.\n\nUnlike some other cryptocurrencies, such as bitcoin, stablecoins are typically tied to the value of a fiat currency, like the dollar, to reduce their price volatility.\n\nThey’ve evolved from “a niche digital currency” the Strawhecker report said, as “stablecoins power a growing share of global crypto trading, enable low-cost remittances, streamline merchant payouts, support underbanked countries, and offer a way for people in regions with volatile currencies to preserve value in dollars.”\n\nStablecoins’ acceleration into the mainstream is likely to quicken as U.S. regulators begin implementing the Genius law’s policy framework, counteracting stricter crypto policies during the Biden administration.\n\nFor example, PayPal Holdings touted a new “Pay with Crypto” tool on July 28 that allows “instant crypto to stablecoin or fiat conversion” and supports “100+ crypto currencies and wallets,” according to a press release. The company debuted its dollar-denominated stablecoin, PayPal USD, two years ago.\n\nThe earliest use cases for stablecoin have been to settle cross-border transactions, facilitate lower-cost remittances and to store value for people in nations afflicted with severe inflation.\n\nBut most of these stablecoin transactions occur far from the daily lives of ordinary consumers in America, many of whom are perhaps puzzled about digital currencies. That raises the question: Will stablecoins become a payment choice at local shops and gas stations for millions of smartphone-carrying U.S. consumers?\n\nPayments Dive asked payments and digital asset industry professionals for their thoughts on how, and when, stablecoins might filter down to consumer-level payments.\n\nComments have been edited for clarity and brevity.\n\nAlexandra ‘Lexy’ Prodromos\n\nNeochordia Consulting\n\nPayments, product and emerging technology consultant\n\n(Former Discover Financial Services innovation and strategic product manager)\n\nWhat the Genius Act does, especially with the permitted payment stablecoin issuer registration, it allows there to be a more level playing field for companies or banks and payment networks if they want to issue their own stable points. There's this standardization across the board, which I think will make them more easy to regulate, and I think allow greater access.\n\nIf you're able to use stablecoins and basically extend the value of the U.S. dollar to other markets in the world, and for consumers especially to be able to have this other option where they can basically use the same technology that makes cryptocurrencies interesting, but then have the price stability of the U.S. dollar, I think that opens up so many more avenues for smaller merchants and the ability for them to conduct their businesses with consumers overseas. So, I think that this is something that is really going to explode.\n\n\n\nKirill Gertman\n\nConduit Technology\n\nCEO, Founder\n\nFor stablecoins to be an actual daily payment method, you need a convergence from both sides. From the consumer side, where we’re not there yet, we’re getting there step by step by step. We’re getting payroll now, we're getting e-commerce. And then from the merchant side, the economics just make sense. So, we will probably see at least the largest ones issue their own coins.\n\nFor large merchants doing a lot of these cross-border (transactions), those are extremely expensive. And they can make money on this. If they’re issuing a stablecoin … they’re actually making money on (holding) the underlying Treasuries, the short-term stuff. And so now, on one hand, they can save money. On the other hand, if they’re big enough, they can actually make money. So, as a large enough merchant, why wouldn’t you? I think the merchants will want this.\n\nWhat I think is going to happen and maybe create a problem here is that, imagine a scenario where every freaking merchant has its own stablecoin. Amazon has a coin. Walmart has a coin and Starbucks has a coin. And now as a consumer you’re walking into Starbucks, and you’re like, ‘Oh sh–, I have Amazon coin in my mobile wallet, I don’t have Starbucks coin. What am I going to do with this?’ That’s going to create a problem, that’s going to create friction, essentially there will be a need for a clearing house. Like we have the clearing house on fiat transactions, we’re going to need to have something like that on stablecoins as well. And then if it works really well, and if it’s really seamless, the consumer doesn’t notice it. They pay with a Starbucks coin for Amazon or the Walmart coin for whatever, then it’ll work. If it’s not seamless enough, it's not going to work. So that’s the opportunity, but that’s also the challenge.”\n\nCorey Frayer\n\nConsumer Federation of America\n\nDirector of Investor Protection\n\n(Former Securities and Exchange Commission crypto policy advisor under Biden)\n\nYou’ll see mainstream adoption of stablecoins not because people want them but because companies want to give them to their customers. You’re seeing forced adoption and regulatory favoritism as the impetus for adoption of crypto, not some value in the underlying technology.\n\nWhen you deregulate something as large as the payments ecosystem, you can guarantee that the money will start flowing through it almost instantly. My prediction is that within 18 months it’s going to be relatively common for people to be moved into what is being described as stablecoin payment systems. Because the functional difference between a stablecoin and a current digital payment is minute. And the deregulatory benefit is enormous, and so we’ll see people move to that quickly.\n\nAmanda Fischer\n\nBetter Markets\n\nPolicy Director, Chief Operating Officer\n\n(Former SEC chief of staff under Biden administration)\n\nI think that [stablecoins] may become an emerging form of payments, but I don't think that that’s because they offer a superior payments experience. I think it's more because of the favorable provisions in legislation and the lobbying and the hype and the marketing, rather than their actual use case.\n\nIt’s incredibly risky and it’s bad for consumers and the financial system. But for [merchants, they] get out of interchange, they get people to keep their money in your ecosystem. The more money they keep in their ecosystem, the more interest that they can earn for basically free.\n\nBen Weiss\n\nCoinFlip\n\nCEO\n\nWe, as a company, already see a bunch of people in countries outside the U.S. buying stablecoins because they want access to the dollar. So stablecoins also basically dollarize the world.\n\nWe think stablecoins solve a lot of international payments issues, but could also solve payment issues in the U.S. I know many merchants aren't happy about the interchange fee they're paying [for acceptance of cards]. That being said, nothing happens overnight, right? There are people in the U.S. who still write checks.", "fulltext_ok": true, "error": null, "fetched_at": "2025-08-11T10:35:19.457209+00:00"}
{"id": "da5f094e-16f8-3214-acad-cb394c46c2cb", "ticker": "V", "title": "Joint Stock Company Kaspi.kz (KSPI): A Bull Case Theory", "summary": "We came across a bullish thesis on Joint Stock Company Kaspi.kz on Peter’s Substack by Peter Thomason. In this article, we will summarize the bulls’ thesis on KSPI. Joint Stock Company Kaspi.kz’s share was trading at $85.00 as of July 25th. KSPI’s trailing P/E was 8.21 according to Yahoo Finance. Kaspi (KSPI), the first Kazakh company to […]", "url": "https://finance.yahoo.com/news/joint-stock-company-kaspi-kz-173357592.html", "published_at": "2025-08-04T17:33:57Z", "source": "Insider Monkey", "text": "We came across a bullish thesis on Joint Stock Company Kaspi.kz on Peter’s Substack by Peter Thomason. In this article, we will summarize the bulls’ thesis on KSPI. Joint Stock Company Kaspi.kz's share was trading at $85.00 as of July 25th. KSPI’s trailing P/E was 8.21 according to Yahoo Finance.\n\nPhoto by Clay Banks on Unsplash\n\nKaspi (KSPI), the first Kazakh company to list on U.S. exchanges, is described as one of the most asymmetrical opportunities among large caps, offering a rare value play in a market priced for perfection. Originally a troubled Kazakh bank, Kaspi transformed under CEO Mikheil Lomtadze and Chairman Vyacheslav Kim into a dominant “super app,” combining services akin to Amazon, Visa, Venmo, Booking.com, and more. It now commands 95%+ monthly usage among Kazakhstan’s adults, with customer engagement and economic value per user compounding over time.\n\nThe business rests on a capital-light, highly profitable model, delivering 30%+ annual revenue growth, profit margins of 37–48%, and extraordinary returns on equity of 54–96%, while maintaining conservative leverage. Management, with 40% ownership, is deeply aligned with shareholders and has a long history of prioritizing customer trust — from staying open during the 2014 currency crisis to closing profitable services that didn’t meet customer satisfaction standards.\n\nKaspi’s radical customer obsession drives network effects and resilience, creating a durable moat and sticky user base. Expansion into Turkey provides upside optionality, but the investment case does not rely on it; the core Kazakhstan operations alone could grow earnings 2–4x through increased value per user and scaling of newer services like e-grocery and food delivery. Trading at just 7.7x trailing and 6.8x forward earnings with a PEG ratio of 0.5, Kaspi is priced for negative growth despite consistent execution and a culture of integrity, presenting an exceptional long-term opportunity with significant potential rerating for patient investors.\n\nPreviously, we covered a bullish thesis on Joint Stock Company Kaspi.kz (KSPI) by Antoni Nabzdyk in May 2025, highlighting its dominant super app ecosystem, sticky engagement, and asymmetric upside despite geopolitical risks. The stock has depreciated about 6% since then due to market weakness, but the thesis holds. Peter Thomason shares a similar view, emphasizing Kaspi’s exceptional returns, network effects, and Turkey expansion optionality.\n\nJoint Stock Company Kaspi.kz is not on our list of the 30 Most Popular Stocks Among Hedge Funds. As per our database, 35 hedge fund portfolios held KSPI at the end of the first quarter which was 27 in the previous quarter. While we acknowledge the potential of KSPI as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock.", "fulltext_ok": true, "error": null, "fetched_at": "2025-08-11T10:35:21.098545+00:00"}
{"id": "035bc5f2-c06e-3868-97bd-81d0cbd38332", "ticker": "V", "title": "Coinbase (COIN) vs. Visa (V): Which One of These Stocks Flashing Unusual Options Activity Wins Out?", "summary": "Rather than relying on vibes and presuppositional fallacies, we dig into probabilistic math and applied game theory to give you a clear answer.", "url": "https://www.barchart.com/story/news/33862579/coinbase-coin-vs-visa-v-which-one-of-these-stocks-flashing-unusual-options-activity-wins-out", "published_at": "2025-08-04T17:30:02Z", "source": "Barchart", "text": "Switch the Market flag\n\nOpen the menu and switch the\n\nMarket flag for targeted data from your country of choice.\n\nfor targeted data from your country of choice.", "fulltext_ok": true, "error": null, "fetched_at": "2025-08-11T10:35:22.334990+00:00"}
{"id": "6c7bf832-4269-3eda-88fb-165e85dd7f67", "ticker": "V", "title": "Global Payments to Report Q2 Earnings: Here Are the Estimates", "summary": "GPN is likely to report second-quarter earnings with 3.4% year-over-year growth expected, but rising costs may weigh on overall profit gains.", "url": "https://finance.yahoo.com/news/global-payments-report-q2-earnings-165000003.html", "published_at": "2025-08-04T16:50:00Z", "source": "Zacks", "text": "Global Payments Inc. GPN is set to report second-quarter 2025 results on Aug. 6, 2025, before the opening bell. The Zacks Consensus Estimate for the to-be-reported quarter’s earnings is currently pegged at $3.03 per share on revenues of $2.35 billion.\n\nThe second-quarter earnings estimate increased 1 cent over the past 60 days. The bottom-line projection indicates a year-over-year increase of 3.4%. The Zacks Consensus Estimate for quarterly revenues implies year-over-year growth of 1.3%.\n\nZacks Investment Research\n\nImage Source: Zacks Investment Research\n\nFor full-year 2025, the Zacks Consensus Estimate for Global Payments’ revenues is pegged at $9.3 billion, implying a rise of 1.6% year over year. Also, the consensus mark for the current-year EPS is pegged at $12.11, implying a jump of around 4.9% on a year-over-year basis.\n\nGlobal Payments’ earnings beat the consensus estimate in two of the last four quarters and missed twice. This is depicted in the figure below.\n\nGlobal Payments Inc. Price and EPS Surprise\n\nGlobal Payments Inc. Price and EPS Surprise\n\nGlobal Payments Inc. price-eps-surprise | Global Payments Inc. Quote\n\nQ2 Earnings Whispers for GPN\n\nOur proven model does not conclusively predict an earnings beat for the company this time around. The combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy), or 3 (Hold) increases the odds of an earnings beat, but that is not the case here.\n\nGPN has an Earnings ESP of -0.02% and a Zacks Rank #3. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.\n\nYou can see the complete list of today’s Zacks #1 Rank stocks here.\n\nWhat’s Shaping GPN’s Q2 Results?\n\nThe Zacks Consensus Estimate for adjusted revenues from Merchant Solutions indicates a 0.4% increase from the year-ago period’s reported number of $1.8 billion. The consensus mark for adjusted operating income indicates 2% growth from the year-ago level of $884.8 million, while our model estimate implies a 1.6% increase.\n\nBoth the consensus estimate and our model estimate for Issuer Solutions’ adjusted revenues signal an almost 3% increase from the year-ago figure of $541.5 million. A rise in traditional accounts and increasing transactions are likely to have aided the segment in the quarter under review. While the consensus estimate for adjusted operating income from the unit indicates a rise of 3.7% in the second quarter from $246.6 million a year ago, our model estimate implies a 3.5% increase.\n\nThe Zacks Consensus Estimate for Europe operations indicates a 2.1% year-over-year increase in the second quarter. The consensus mark for revenues from Americas operations indicates a 0.9% rise from a year ago. Also, the consensus estimate for revenuesfrom Asia Pacific indicates 1.5% year-over-year growth.", "fulltext_ok": true, "error": null, "fetched_at": "2025-08-11T10:35:23.905895+00:00"}
{"id": "c9f7fb82-09f6-391c-98d9-8515044f259f", "ticker": "V", "title": "Can Fidelity National Beat Q2 Earnings on Capital Market Strength?", "summary": "FIS is likely to beat second-quarter earnings forecasts, driven by strength in Capital Market and Banking Solutions operations.", "url": "https://finance.yahoo.com/news/fidelity-national-beat-q2-earnings-164300733.html", "published_at": "2025-08-04T16:43:00Z", "source": "Zacks", "text": "Financial services technology solutions provider Fidelity National Information Services, Inc. FIS is set to report second-quarter 2025 results on Aug. 5, 2025, before the opening bell. The Zacks Consensus Estimate for the to-be-reported quarter’s earnings is currently pegged at $1.36 per share and the same for revenues is pinned at $2.58 billion.\n\nThe second-quarter earnings estimate remained stable over the past 60 days. The bottom-line prediction is in line with the year-ago figure. The Zacks Consensus Estimate for quarterly revenues implies year-over-year growth of 3.5%.\n\nZacks Investment Research\n\nImage Source: Zacks Investment Research\n\nFor full-year 2025, the Zacks Consensus Estimate for Fidelity National’s revenues is pegged at $10.47 billion, implying a rise of 3.4% year over year. Meanwhile, the consensus mark for current year EPS is pegged at $5.75, implying growth of around 10.2% on a year-over-year basis.\n\nFidelity National’s earningsbeat the consensus estimate in each of the last four quarters, with the average surprise being negative 5.9%.\n\nFidelity National Information Services, Inc. Price and EPS Surprise\n\nFidelity National Information Services, Inc. Price and EPS Surprise\n\nFidelity National Information Services, Inc. price-eps-surprise | Fidelity National Information Services, Inc. Quote\n\nQ2 Earnings Whispers for Fidelity National\n\nOur proven model predicts a likely earnings beat for the company this time around as well. The combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) increases the odds of an earnings beat. That is precisely the case here.\n\nFIS has an Earnings ESP of +0.67% and a Zacks Rank #2 at present. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.\n\nYou can see the complete list of today’s Zacks #1 Rank stocks here.\n\nWhat Is Shaping Fidelity National’s Q2 Results?\n\nThe Zacks Consensus Estimate for Banking Solutions revenues indicates a 3.8% year-over-year increase. Similarly, both the consensus mark and our model estimate indicate around a 6% increase in revenues from Capital Market Solutions compared with the same quarter last year.\n\nBoth the consensus estimate and our model estimate for Total Recurring revenues indicate around a 3% increase in the to-be-reported quarter. Looking at the geographical breakdown, both the consensus mark and our model estimate signal 2.8% and 5.4% year-over-year growth in North America and All Other revenues, respectively.\n\nThe Zacks Consensus Estimate for Capital Market Solutions’ adjusted EBITDA indicates a 4.9% year-over-year increase, whereas our model estimate predicts 3.1% growth from the year-ago period. The consensus mark for Banking Solutions’ adjusted EBITDA indicates a 1.9% year-over-year growth.", "fulltext_ok": true, "error": null, "fetched_at": "2025-08-11T10:35:25.537462+00:00"}
{"id": "cfc870f3-415e-35ca-91d3-3ebc3276081c", "ticker": "V", "title": "Visa Inc. (V) Is a Trending Stock: Facts to Know Before Betting on It", "summary": "Zacks.com users have recently been watching Visa (V) quite a bit. Thus, it is worth knowing the facts that could determine the stock's prospects.", "url": "https://finance.yahoo.com/news/visa-inc-v-trending-stock-130005063.html", "published_at": "2025-08-04T13:00:05Z", "source": "Zacks", "text": "Visa (V) has been one of the most searched-for stocks on Zacks.com lately. So, you might want to look at some of the facts that could shape the stock's performance in the near term.\n\nOver the past month, shares of this global payments processor have returned -5.4%, compared to the Zacks S&P 500 composite's +0.6% change. During this period, the Zacks Financial Transaction Services industry, which Visa falls in, has lost 4.8%. The key question now is: What could be the stock's future direction?\n\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\n\nRevisions to Earnings Estimates\n\nRather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\n\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\n\nFor the current quarter, Visa is expected to post earnings of $2.96 per share, indicating a change of +9.2% from the year-ago quarter. The Zacks Consensus Estimate has changed -1.4% over the last 30 days.\n\nFor the current fiscal year, the consensus earnings estimate of $11.43 points to a change of +13.7% from the prior year. Over the last 30 days, this estimate has changed +0.7%.\n\nFor the next fiscal year, the consensus earnings estimate of $12.84 indicates a change of +12.4% from what Visa is expected to report a year ago. Over the past month, the estimate has changed +0.6%.\n\nHaving a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Visa is rated Zacks Rank #3 (Hold).", "fulltext_ok": true, "error": null, "fetched_at": "2025-08-11T10:35:27.398549+00:00"}
{"id": "f2386188-d036-3721-870d-27de47b63cdf", "ticker": "V", "title": "How to Spend Bitcoin (and Other Crypto) in Person Using a Debit Card in 2025", "summary": "Using Bitcoin at your local coffee shop might've sounded impossible a few years ago, but crypto debit cards are making that a reality. Instead of trying to convince a cashier to accept your wallet address, these cards automatically convert your ...", "url": "https://finance.yahoo.com/news/spend-bitcoin-other-crypto-person-122602376.html", "published_at": "2025-08-04T12:26:02Z", "source": "Benzinga", "text": "Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\n\nUsing Bitcoin at your local coffee shop might've sounded impossible a few years ago, but crypto debit cards are making that a reality. Instead of trying to convince a cashier to accept your wallet address, these cards automatically convert your cryptocurrency into fiat currency at the point of sale, letting you tap and pay just like you would with any other Visa or Mastercard. Whether you're a long-term investor looking to unlock the utility of your crypto, or you're simply trying to make digital assets a part of your everyday finances, crypto debit cards can help bridge the gap between the blockchain and the real world. And unlike the clunky prepaid solutions of the early days, today's cards come packed with perks—cashback in crypto, airport lounge access, even rewards on your streaming subscriptions. But before you swipe your Bitcoin for a sandwich, let's break down how these cards work, which ones are best, and what to know before you add one to your wallet.\n\nWhat Is a Crypto Debit Card and How Does It Work?\n\nA crypto debit card functions much like the plastic card in your wallet right now—but instead of pulling from your checking account, it draws from your digital assets. You typically start by topping up your crypto debit card through a wallet or exchange app linked to your card provider. When you go to make a purchase, the card provider converts just enough crypto into your local currency to cover the charge. So, even if the merchant never sees your Bitcoin or Ethereum, you're still effectively spending it. Most cards are backed by major networks like Visa or Mastercard, meaning you can use them anywhere those brands are accepted—whether online, in-store, or even at the ATM. Some cards are virtual-only and work great for ecommerce, while others also offer physical cards you can carry. Depending on the provider, the card may support a range of coins and stablecoins, and some even let you toggle which asset gets spent first. It's a sleek way to make crypto functional in daily life without waiting for widespread adoption at the checkout line.\n\nDon’t Miss:\n\nWhy You Might Want to Use a Crypto Debit Card\n\nCrypto debit cards aren't just about novelty—they can offer real utility, especially if you already hold digital assets and want more flexibility in how you use them. For starters, they eliminate the friction of converting crypto into fiat on your own before spending it. You don't need to make a sell order, wait for settlement, then transfer funds to your bank. Instead, the card handles that process in real time. For frequent travelers or remote workers earning in crypto, this can be a game-changer—no need to convert to USD or EUR ahead of time. On top of that, most crypto cards come with cashback or cryptoback programs, where you earn tokens back with every purchase. Some offer 1% to 8% back, depending on your staking level or card tier. And since you're already using crypto, it's nice to put those everyday expenses toward building more. Lastly, some cards include luxury perks like lounge access or partner discounts, which can turn a simple transaction into something more rewarding. If you already believe in crypto long-term, these cards are a natural extension of that lifestyle.", "fulltext_ok": true, "error": null, "fetched_at": "2025-08-11T10:35:29.080673+00:00"}
{"id": "25225dcf-426b-3b7c-83a8-8a63363f0e95", "ticker": "V", "title": "Visa enhances stablecoin settlement capabilities", "summary": "The company has partnered with Paxos to introduce two additional dollar-backed stablecoins, USDG and PYUSD, into its system.", "url": "https://www.electronicpaymentsinternational.com/news/visa-stablecoin-settlement-capabilities/", "published_at": "2025-08-04T12:18:16Z", "source": "Electronic Payments", "text": "Visa has expanded its blockchain compatibility by adding support for Stellar and Avalanche. Credit: XanderSt/ Shutterstock.com\n\nVisa has expanded its stablecoin support capabilities by integrating digital assets and blockchain technologies, facilitating transaction settlements for issuers and acquirers.\n\nThe company has partnered with Paxos to introduce two additional dollar-backed stablecoins, Global Dollar (USDG) and PayPal USD (PYUSD), into its system.\n\nFurthermore, Visa has expanded its blockchain compatibility by adding support for Stellar and Avalanche.\n\nThese networks join Ethereum and Solana, which were already part of Visa’s supported blockchain ecosystems.\n\nThe integration of Circle’s euro-backed stablecoin, EURC, into the Visa network allows for settlement services not only in USD-backed stablecoins but also in EUR-backed ones.\n\nVisa’s expansion into stablecoin-linked card partners earlier this year highlighted the necessity for a network that can interact with various blockchain wallets and offer a range of settlement options.\n\nGlobalData Strategic Intelligence US Tariffs are shifting - will you react or anticipate? Don’t let policy changes catch you off guard. Stay proactive with real-time data and expert analysis. By GlobalData Learn more about Strategic Intelligence\n\nThe network’s design facilitates transactions across different blockchains and directly accepts stablecoins for card-based settlements.\n\nVisa global growth products and strategic partnerships head Rubail Birwadker said: “Visa is building a multi-coin and multi-chain foundation to help meet the needs of our partners worldwide. We believe that when stablecoins are trusted, scalable and interoperable, they can fundamentally transform how money moves around the world.”\n\nIn June, Visa partnered with Yellow Card to extend the reach of its stablecoin settlement system to the CEMEA region.", "fulltext_ok": true, "error": null, "fetched_at": "2025-08-11T10:35:30.039255+00:00"}
{"id": "8ee92eb2-5afb-381d-8826-83ea1d29909d", "ticker": "V", "title": "The Zacks Analyst Blog Highlights PayPal, Visa and Mastercard", "summary": "PayPal tumbles post-earnings despite raised guidance, but fundamentals, innovation, and valuation suggest upside ahead.", "url": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-paypal-100400499.html", "published_at": "2025-08-04T10:04:00Z", "source": "Zacks", "text": "While the earnings beat was clear, the sustainability of the drivers was questioned. Transaction margin dollar (TM$) benefited from a roughly 1.5-point one-time contribution from the renewal and expansion of PayPal’s relationship with a key payment partner. Moreover, PYPL expects continued momentum in transaction revenues, but with lower growth in other value-added services revenues compared to the second quarter. This incorporates the effect of interest rate headwinds and a more difficult prior-year comparison for credit growth.\n\nThe company also raised its full-year guidance. It now expects non-GAAP EPS of $5.15-$5.30 (up from $4.95-$5.10) and transaction margin dollar growth of 5%-6%. Free cash flow guidance was reaffirmed at $6-$7 billion, and capital return remained strong with $1.5 billion in share buybacks during the second quarter, with management projecting share repurchases to be roughly $6 billion in 2025.\n\nOn paper, PayPal’s second quarter was solid. The company reported revenues of $8.3 billion, up 5.1% year over year and topped the consensus mark by 2.3%. Total Payment Volume (“TPV”) climbed 6% to $443.5 billion, and non-GAAP EPS came in at $1.40, denoting a 17.6% increase year over year and well ahead of the Zacks Consensus Estimate of $1.30. Non-GAAP operating income rose 13%, and operating margins expanded 132 basis points to 19.8%%.\n\nWith the company showing signs of operational progress while navigating competitive and macroeconomic challenges, investors are now weighing whether this dip reflects deeper concerns or a potential mispricing of a business in transition. Let’s delve deeper and find out.\n\nAfter delivering an earnings beat and raising full-year guidance, why did the stock tumble? The reaction highlights a growing disconnect between PayPal’s improving fundamentals and elevated market expectations.\n\nPayPal Holdings is no stranger to market volatility, but the more than 10% post-earnings selloff following its second-quarter 2025 results caught many investors off guard.\n\nChicago, IL – August 4, 2025 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: PayPal Holdings PYPL, Visa Inc. V and Mastercard Inc. MA.\n\nStory continues\n\nBranded checkout TPV, a closely watched KPI, grew just 5% year over year FX-neutral, down slightly from the first quarter of 2025. This, paired with management commentary about softening U.S. retail spending and tariff-related headwinds in Asia, stoked short-term doubts.\n\nHowever, these concerns appear more tactical than structural. The broader narrative around PayPal’s recovery and reinvention remains intact.\n\nVenmo and Branded Payments Are Gaining Steam\n\nDespite macro noise, PayPal’s Venmo business is showing solid traction. Venmo revenues jumped more than 20% in the second quarter, while TPV rose 12%, accelerating quarter over quarter to the highest growth rate in three years. Debit card TPV across PayPal and Venmo surged 60%, and Pay with Venmo TPV soared 45% in the quarter. The company achieved a roughly 25% increase in Pay with Venmo monthly active accounts, with its merchant network continuing expansion.\n\nBranded checkout still represents a vital growth driver. While growth slowed modestly, new checkout integrations are ramping up. More than 60% of U.S. branded volume is now on PayPal’s upgraded experience, and international rollouts in the U.K. and Germany are underway. These transitions take time but offer long-term payoff in higher conversion and loyalty.\n\nPayPal Building Next-Gen Payments Ecosystem\n\nBeyond the numbers, PayPal is investing in future-proofing its business. Its recently announced “PayPal World” initiative, with launch slated this fall, will initially unite PayPal, Venmo, Mercado Pago, NPCI’s UPI and Tenpay Global under a cloud native, API framework, enabling interoperability for nearly 2 billion global users. This could unlock significant TPV upside across borders.\n\nAdditionally, PayPal is exploring “agentic commerce” experiences powered by AI partners like Anthropic and Salesforce. On the crypto front, PayPal’s stablecoin PYUSD is now integrated across platforms, with “Pay with Crypto” expected soon. These innovations position PayPal not just as a payments company but as a broader commerce platform.\n\nEven if short-term branded volume growth remains mixed, the company has multiple levers for margin and earnings upside in 2026 and beyond.\n\nPYPL Stock Price Performance\n\nPYPL shares have dropped 18.3% year to date, largely due to intensifying competition in the fintech sector. Rivals like Visa Inc. and Mastercard Inc. continue to expand their offerings, challenging PayPal’s dominance in digital payments. Broader macroeconomic pressures and uncertainty surrounding the tariff policy have also dampened investor sentiment. While PYPL has struggled, Visa shares have climbed 11%, and Mastercard has risen 6.2% over the same timeframe.\n\nPayPal Shares Trading Cheap\n\nHowever, with the decline, PayPal shares are trading cheap, as suggested by the Value Score of A. In terms of forward 12-month P/E, PYPL stock is trading at 12.82X compared with the Zacks Financial Transaction Services industry’s 21.83X.\n\nThe stock is also cheaper than competitors, including Visa and Mastercard. Shares of Visa and Mastercard are currently trading at P/E of 27.93X and 31.78X, respectively.\n\nPYPL’s Estimate Revisions Exhibit Positive Trend\n\nPayPal’s estimate revisions reflect a positive trend for full-year 2025 and 2026. The Zacks Consensus Estimate for 2025 earnings is pegged at $5.18 per share, suggesting 11.4% growth over 2024. The consensus mark for 2026 earnings stands at $5.75 per share, calling for an 11.0% increase year over year.\n\nPayPal: Buy the Pullback, Not the Panic\n\nPayPal’s second quarter wasn’t perfect, but it was progress. The stock’s 10% post-earnings drop says more about market expectations than company fundamentals. With strong execution in Venmo, improving branded checkout capabilities, and solid innovation in global payments and AI, PayPal is setting the stage for a multi-year recovery.\n\nShort-term noise creates long-term opportunity. Therefore, it seems prudent for investors to look past the market’s knee-jerk reaction and buy PayPal stock on weakness. The combination of buybacks and solid cash generation gives the stock a solid foundation for upside, and the future of digital payments still runs through PYPL.\n\nPayPal currently has a Zacks Rank #2 (Buy) and a VGM Score of A. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nFree: Instant Access to Zacks' Market-Crushing Strategies\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.7% average gain per year. Amazingly, they soared with average gains of +48.4%, +50.2% and +56.7% per year.\n\nToday you can tap into those powerful strategies – and the high-potential stocks they uncover – free. No strings attached.\n\nGet all the details here >>\n\nZacks Investment Research\n\n800-767-3771 ext. 9339\n\nsupport@zacks.com\n\nhttps://www.zacks.com\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nMastercard Incorporated (MA) : Free Stock Analysis Report\n\nVisa Inc. (V) : Free Stock Analysis Report\n\nPayPal Holdings, Inc. (PYPL) : Free Stock Analysis Report\n\nThis article originally published on Zacks Investment Research (zacks.com).\n\nZacks Investment Research", "fulltext_ok": true, "error": null, "fetched_at": "2025-08-11T10:35:31.546594+00:00"}
{"id": "a2edf16b-a73c-3661-8bc0-092ea5cd54ea", "ticker": "V", "title": "The Zacks Analyst Blog Highlights Interactive Brokers, Visa, Robinhood Markets and PayPal Holdings", "summary": "Interactive Brokers, Visa, Robinhood, and PayPal gain spotlight as crypto exposure and earnings momentum draw investor interest.", "url": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-interactive-095700869.html", "published_at": "2025-08-04T09:57:00Z", "source": "Zacks", "text": "For Immediate Release\n\nChicago, IL – August 4, 2025 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Interactive Brokers Group IBKR, Visa Inc. V, Robinhood Markets, Inc. HOOD and PayPal Holdings PYPL.\n\nHere are highlights from Friday’s Analyst Blog:\n\n4 Crypto-Centric Stocks to Buy Before Bitcoin Resumes Its Rally\n\nThe cryptocurrency rally has slowed over the past couple of days, with Bitcoin (BTC) retreating from its all-time high. Several factors have been weighing on the crypto market, but the decline is temporary as the rally is expected to resume once these tensions ease.\n\nPresident Donald Trump’s tariffs, a delay in the interest rate cut by the Federal Reserve and multiple other factors are hurting Bitcoin. However, the cryptocurrency has still held its ground and is trying to make a rebound.\n\nThe temporary dip might be an ideal opportunity to invest in crypto-focused stocks. We have selected four stocks, namely Interactive Brokers Group, Visa Inc., Robinhood Markets, Inc. and PayPal Holdings. Each of these stocks has strong growth potential for 2025 and has seen positive earnings estimate revisions in the last 90 days.\n\nBitcoin Retreats From All-Time High\n\nBitcoin hit an all-time high of $123,153.22 earlier last month before paring some of its gains. The cryptocurrency remained rangebound, hovering around $119,000 for most of July. However, the final days of July saw Bitcoin falling below $116,000 to enter a short-term bearish zone.\n\nOn Thursday, Bitcoin was hovering around $115,100. The decline came after the Federal Reserve left interest rates steady in its current range of 4.25-4.5%. The decision was anticipated, but there was a bleak hope among investors that the Fed could go for a 25-basis-point rate cut. Higher interest rates negatively impact growth-oriented sectors, which include technology, consumer discretionary industries and cryptocurrencies.\n\nAlso, uncertainty over the impact of Trump’s tariffs on inflation has made investors jittery. Although the White House said that it has reached trade deals with several nations after negotiations, there is a lack of clarity over the new tariff structure.\n\nIn recent months, the effects of higher tariffs have become evident, as prices of goods have increased. Inflation saw an uptick in June, which analysts largely attribute to the elevated tariffs. The Federal Reserve is postponing any interest rate cuts as it monitors how these developments influence inflation and broader economic trends.", "fulltext_ok": true, "error": null, "fetched_at": "2025-08-11T10:35:33.144711+00:00"}
