{"id": "19866231-ee87-3ede-aedb-3a379ef90162", "ticker": "AAPL", "url": "https://finance.yahoo.com/video/apples-made-america-strategy-led-202608941.html", "title": "How Apple's 'made-in-America' strategy led to big market gains", "summary": "Apple (AAPL) stock gains after the iPhone maker announced an additional $100 billion investment in the US. Apple CEO Tim Cook joined President Trump at the White House to announce the details of the investment. Yahoo Finance Markets Reporter Josh Schafer examines the stock's roughly 13% rise this week, and Yahoo Finance Tech Editor Dan Howley explains why the multibillion-dollar investment is so significant for the company in the context of Trump's tariff policies. To watch more expert insights and analysis on the latest market action, check out more Market Domination.", "published_at": "2025-08-08T20:26:08Z", "sentiment": "neutral", "confidence": 0.9998}
{"id": "10184f47-4853-453e-af6e-35bfbc321cb6", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/shareholder-warns-apples-100-billion-investment-is-more-optics-than-impact-164045324.html", "title": "Shareholder warns Apple's $100 billion investment is more optics than impact", "summary": "Apple's latest US investment may win political points, but real operational gains could take years to materialize.", "published_at": "2025-08-07T16:40:45Z", "sentiment": "positive", "confidence": 0.9977}
{"id": "0d02b5d3-c0ef-3267-8852-770254c6eddc", "ticker": "AAPL", "url": "https://www.fool.com/investing/2025/08/09/forget-magnificent-seven-buy-growth-stocks/", "title": "Forget the \"Magnificent Seven.\" It's Time to Start Talking About the \"Ten Titans.\"", "summary": "The megacap all-star team is long overdue for an expansion.", "published_at": "2025-08-09T08:00:00Z", "sentiment": "neutral", "confidence": 0.9585}
{"id": "01877e10-31a5-3ab9-9c4b-c6e1d63597a6", "ticker": "AAPL", "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-nasdaq-high-google-apple-tesla-buy-signals/?src=A00220&yptr=yahoo", "title": "Dow Jones Futures: Apple Drives Nasdaq To High; Google, Tesla Flash Buy Signals", "summary": "The stock market rallied last week, with the Nasdaq hitting a high, but note this budding divergence. Google, Tesla, Apple flashed buy signals.", "published_at": "2025-08-09T02:36:17Z", "sentiment": "neutral", "confidence": 0.9983}
{"id": "0b01b7e2-5bb8-3b05-939a-b833a4cfa2e8", "ticker": "AAPL", "url": "https://www.barrons.com/articles/spending-for-executive-protection-is-on-the-rise-359c4fa7?siteid=yhoof2&yptr=yahoo", "title": "Spending for Executive Protection Is on the Rise", "summary": "The median security expenditure for executives climbed to $106,500 in 2024 from $48,500 in 2020. The biggest risks are seen in the tech, communication services, healthcare, and energy sectors.", "published_at": "2025-08-09T00:02:00Z", "sentiment": "positive", "confidence": 0.9917}
{"id": "b312de05-7a85-3815-aeb9-d9dbd5968b6a", "ticker": "AAPL", "url": "https://finance.yahoo.com/video/nasdaq-posts-record-closing-high-223253473.html", "title": "Nasdaq posts record closing high with tech gains, rate cut optimism", "summary": "STORY: U.S. stocks ended higher on Friday, with the Dow adding nearly half a percent, the S&P 500 climbing more than three-quarters of a percent, and the Nasdaq gaining one percent to notch&nbsp;a record closing high for the second straight day.The three major indexes registered solid gains for the week, notes Steven Schoenfeld, CEO of MarketVector Indexes.\"It's a combination of some geopolitical hopes - the fact that the President is going to meet with [Russian President Vladimir] Putin very near term is giving some hope of relaxation of geopolitical tensions - earnings continue to be strong, and the hope for lower interest rates.\"Stocks on the move included Apple, which rose more than 4% Friday and was up over 13% for the week, it's&nbsp;biggest weekly percentage gain since 2020.Also helping the S&P 500 were shares of Gilead Sciences, which jumped more than 8% after the biopharmaceutical company raised its full-year financial outlook.And shares of Expedia rose more than 4% after the&nbsp;online travel agent raised its annual forecast for gross bookings and revenue growth.Inflation will be in focus next week,&nbsp;which could serve as a test for the stock market rally.The monthly U.S. consumer price index report is due on Tuesday,&nbsp;and some investors say equities could be set for a pullback depending on what it reveals.", "published_at": "2025-08-08T22:32:53Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "9751b799-3df3-3df2-8da9-a24f8305bbef", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/want-bribe-trump-bring-gold-222918518.html", "title": "'If You Want To Bribe Trump, Bring Gold—Not Bitcoin'. An Economist Claims Apple Got Tariff Relief On Semiconductors For Cheap", "summary": "Economist and gold enthusiast Peter Schiff is stirring some controversy after claiming that Apple may have secured tariff exemptions from President Donald Trump's new semiconductor tariff policy—and that it only cost them a gold-plated gift. “If the ...", "published_at": "2025-08-08T22:29:18Z", "sentiment": "negative", "confidence": 0.9229}
{"id": "1bd34776-590c-4a13-8cca-f8b4515e65a4", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-rise-with-wall-street-looking-for-more-records-071149238.html", "title": "Stock market today: Dow, S&P 500, Nasdaq futures rise with Wall Street looking for more records", "summary": "Stocks are searching for their latest records amid Wall Street's furious bull run.", "published_at": "2025-08-11T07:11:49Z", "sentiment": "negative", "confidence": 0.9999}
{"id": "b80e2d62-f9c5-478c-ad33-c73bc90255a4", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/mega-cap-tech-companies-lead-the-markets-higher-155532476.html", "title": "Mega-cap tech companies lead the markets higher", "summary": "It is nearly impossible to find a household or business that isn’t regularly using multiple goods or services offered by at least a few of the Mag 7", "published_at": "2025-08-10T15:55:32Z", "sentiment": "negative", "confidence": 0.8708}
{"id": "f290b246-96eb-36b7-ac31-19f404728792", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/nvidia-amd-pay-us-15-014239248.html", "title": "Nvidia, AMD to Pay US 15% of China AI Chip Sales in Unusual Move", "summary": "(Bloomberg) -- Nvidia Corp. and Advanced Micro Devices Inc. agreed to pay 15% of their revenues from Chinese AI chip sales to the US government in a deal to secure export licenses, an unusual arrangement that may unnerve both US companies and Beijing.Most Read from BloombergSunseeking Germans Face Swiss Backlash Over Alpine Holiday CongestionNew York Warns of $34 Billion Budget Hole, Biggest Since 2009 CrisisThree Deaths Reported as NYC Legionnaires’ Outbreak SpreadsA New Stage for the Theater T", "published_at": "2025-08-11T01:42:39Z", "sentiment": "negative", "confidence": 0.9878}
{"id": "3b6acca3-e7eb-32e8-9276-f5a2aa4056d1", "ticker": "AAPL", "url": "https://www.fool.com/investing/2025/08/10/3-growth-stocks-to-invest-1000-in-right-now/", "title": "3 Growth Stocks to Invest $1,000 in Right Now", "summary": "Three tremendous growth stocks are all discounted for reasons that no longer apply. Opportunity is knocking.", "published_at": "2025-08-11T01:15:00Z", "sentiment": "positive", "confidence": 0.4364}
{"id": "36cf0f90-ab72-387d-ac98-c1e1b5f91dfe", "ticker": "AAPL", "url": "https://www.wsj.com/finance/stocks/stock-buybacks-2025-3b0ddedd?siteid=yhoof2&yptr=yahoo", "title": "American Companies Are Buying Their Own Stocks at a Record Pace", "summary": "American companies are repurchasing their shares at a record pace, boosting their balance sheets and fueling the U.S. stock rally.  U.S. companies have announced $983.6 billion worth of stock buybacks so far this year, the best start to a year on record, according to Birinyi Associates data going back to 1982.  The biggest repurchasers include tech giants  Apple  and Google parent  Alphabet  Big banks such as  JPMorgan Chase  Bank of America  and  Morgan Stanley  also are leading the charge.", "published_at": "2025-08-11T01:00:00Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "2a7ffd2d-e9db-345b-a53d-3148d4eba392", "ticker": "AAPL", "url": "https://www.fool.com/investing/2025/08/10/here-are-my-top-magnificent-seven-stocks-to-buy-no/", "title": "Here Are My Top \"Magnificent Seven\" Stocks to Buy Now", "summary": "The \"Magnificent Seven\" stocks are still some of the best buys in the market.", "published_at": "2025-08-10T23:30:00Z", "sentiment": "neutral", "confidence": 0.9684}
{"id": "c09ec8fc-23fe-3d6b-a5ae-420a51f839b3", "ticker": "AAPL", "url": "https://www.fool.com/investing/2025/08/11/apples-silence-on-ai-glasses-and-deals-strategic-g/", "title": "Apple's Silence on AI Glasses and Deals: Strategic Genius or Warning Sign for Investors?", "summary": "Apple's management isn't saying much about two areas of intense interest to its investors.", "published_at": "2025-08-11T08:44:00Z", "sentiment": "positive", "confidence": 0.9997}
{"id": "ce39c78a-3e43-3650-88bc-8ea83ee17a52", "ticker": "AAPL", "url": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp-500-nasdaq-08-11-2025/card/podcast-recap-apple-s-investment-fannie-and-freddie-s-ipo-crocs-misstep-lk4SRbYvF8g2WXNbK8xi?siteid=yhoof2&yptr=yahoo", "title": "Podcast Recap: Apple’s Investment, Fannie and Freddie’s IPO, Crocs’ Misstep", "summary": "How did Apple avoid tariffs on its chips? And are mortgage lenders Fannie and Freddie set to go public? Plus, what caused Crocs' shares to plunge? Host Jack Pitcher discusses the biggest stock moves of last week and the news that drove them.", "published_at": "2025-08-11T06:48:56Z", "sentiment": "positive", "confidence": 0.9999}
{"id": "896e8ae0-9ebc-37d9-bdc6-dd7cd8e904f8", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/exclusive-former-intel-ceo-craig-230624736.html", "title": "Exclusive: Former Intel CEO Craig Barrett outlines plan to save Intel and America’s advanced chip manufacturing", "summary": "Intel needs a cash infusion of roughly $40 billion to remain at the leading edge of chip manufacturing, according to former CEO Craig Barrett. The U.S. government is unlikely to be the main savior—instead cash rich chip customers like Nvidia, Apple, and Google need to step up.", "published_at": "2025-08-10T23:06:24Z", "sentiment": "negative", "confidence": 0.9957}
{"id": "53bb06a8-ff72-336e-a863-9ee57db120d6", "ticker": "AAPL", "url": "https://www.fool.com/investing/2025/08/10/after-sitting-on-the-sidelines-for-14-months-warre/", "title": "After Sitting on the Sidelines For 14 Months, Warren Buffett Could Be Buying One of His Favorite Stocks Again", "summary": "Buffett bought shares of this stock for 23 straight quarters, but suddenly stopped last year.", "published_at": "2025-08-10T22:23:00Z", "sentiment": "neutral", "confidence": 0.9706}
{"id": "5a791c0b-b9b6-33d2-a957-f1673e2e4b92", "ticker": "AAPL", "url": "https://www.wsj.com/tech/intel-ceo-singled-out-by-trump-to-visit-white-house-on-monday-10e482af?siteid=yhoof2&yptr=yahoo", "title": "Intel CEO Singled Out by Trump to Visit White House on Monday", "summary": "Intel  CEO  Lip-Bu Tan  is set to visit the White House Monday after President  Trump  called for his removal last week over ties to Chinese businesses, according to people familiar with the matter.  Tan is expected to have a wide-ranging conversation with Trump, with the intent of explaining his personal and professional background, the people said.  Tan hopes to win Trump’s approval by showing his commitment to the country and pledging the importance of keeping Intel’s manufacturing capabilities as a national security issue, one of the people said.", "published_at": "2025-08-10T20:57:00Z", "sentiment": "negative", "confidence": 0.9999}
{"id": "f57e9180-1880-333c-9eb6-eaf3bfa06361", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/australia-set-cut-rates-governor-190000621.html", "title": "Australia Set to Cut Rates, Stay Cautious on Policy Outlook", "summary": "(Bloomberg) -- Australia’s central bank is poised to deliver its third interest-rate cut this year as inflationary pressures ebb, while Governor Michele Bullock is expected to stick with her cautious stance on the monetary policy outlook.Most Read from BloombergSunseeking Germans Face Swiss Backlash Over Alpine Holiday CongestionNew York Warns of $34 Billion Budget Hole, Biggest Since 2009 CrisisThree Deaths Reported as NYC Legionnaires’ Outbreak SpreadsA New Stage for the Theater That Gave Amer", "published_at": "2025-08-10T19:00:00Z", "sentiment": "positive", "confidence": 0.99}
{"id": "724ed24a-8921-3151-8aa6-18c15996afe1", "ticker": "AAPL", "url": "https://www.thestreet.com/investing/stocks/apple-is-a-star-again-as-investors-hope-tariffs-dont-squeeze-markets", "title": "Apple is a star (again) as investors hope tariffs don't squeeze markets", "summary": "Here's what happened to markets last week and what to watch for.", "published_at": "2025-08-10T14:39:29Z", "sentiment": "neutral", "confidence": 0.9971}
{"id": "ba39ade0-2302-3c0d-b993-0fff10e639ac", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/shark-tank-star-kevin-o-130000167.html", "title": "‘Shark Tank’ star Kevin O’Leary says being liked has nothing to do with success—Steve Jobs taught him: ‘You can’t worry about whose feelings you bruise’", "summary": "The multimillionaire investor told Fortune that he learned from working with the late Apple CEO that embracing a “founder’s mindset” involves tough love. “You're going to fail for sure” if you worry about being liked.", "published_at": "2025-08-10T13:00:00Z", "sentiment": "positive", "confidence": 0.6275}
{"id": "78ba95d8-02bc-3e52-a1e2-794f5208b2eb", "ticker": "AAPL", "url": "https://www.wsj.com/tech/trumps-tariffs-wont-solve-u-s-chip-making-dilemma-c5aec29b?siteid=yhoof2&yptr=yahoo", "title": "Trump’s Tariffs Won’t Solve U.S. Chip-Making Dilemma", "summary": "President Trump’s chip-tariff regime could disrupt the global electronics trade and send prices of all kinds of goods higher.  If the point of the tariffs is to cajole companies into doing more of their work in the U.S., they ought to get a reprieve when they do that.  One issue is that all of the world’s big chip companies are already investing in U.S. production, encouraged in part by subsidies doled out by the prior administration.", "published_at": "2025-08-10T10:30:00Z", "sentiment": "positive", "confidence": 0.8989}
{"id": "738a1e56-b031-3706-8362-e91306727539", "ticker": "AAPL", "url": "https://www.fool.com/investing/2025/08/10/is-apple-stock-a-buy-now/", "title": "Is Apple Stock a Buy Now?", "summary": "Apple has finally returned to double-digit growth.", "published_at": "2025-08-10T09:30:00Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "e8fcc50a-853d-3d10-8064-c015ce7a722d", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/apple-still-smart-investment-surge-091551258.html", "title": "Is Apple Still a Smart Investment After Its Surge?", "summary": "Apple has announced plans to boost its U.S. investment over the next four years—a move that could shield it from looming chip tariffs of up to 100% on all semiconductors entering the country.", "published_at": "2025-08-10T09:15:51Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "a4fd4c66-a9bf-369a-9dda-cb171d9ad99e", "ticker": "AAPL", "url": "https://www.fool.com/investing/2025/08/10/apples-600-billion-us-investment-could-reshape-its/", "title": "Apple's $600 Billion U.S. Investment Could Reshape Its Future", "summary": "Investors are hoping that Wednesday's announcement, coupled with a recent strong earnings report, provides a shot of momentum for Apple stock.", "published_at": "2025-08-10T07:45:00Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "d570be0d-86aa-3e1b-bed7-b38fc6610df2", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/wells-fargo-stays-bullish-apple-194439036.html", "title": "Wells Fargo Stays Bullish on Apple (AAPL) Amid $100B U.S. Expansion Plan", "summary": "Apple Inc. (NASDAQ:AAPL) is one of the Hot AI Stocks on Wall Street’s Radar. On August 7, Wells Fargo analyst Aaron Rakers reiterated an Overweight rating on the stock with a $245.00 price target. The rating affirmation follows Apple’s recent announcement that it is increasing its investment in the United States by $100B to $600B over […]", "published_at": "2025-08-09T19:44:39Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "8cd4a577-8723-3508-81a1-7ba06584f874", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/finvolution-group-finv-sees-12-172906886.html", "title": "FinVolution Group (FINV) Sees 12% Price Increase Over Last Week", "summary": "FinVolution Group (FINV) experienced a 12% price increase last week, coinciding with record highs in the Nasdaq Composite, as major tech stocks like Apple surged. While there were no specific latest events directly tied to this price move for FinVolution, the overall positive market sentiment, reflected by gains in significant indexes such as the S&P 500 and Dow Jones, may have supported the increase. Additionally, the market's broad recovery from previous tariff worries and economic concerns...", "published_at": "2025-08-09T17:29:06Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "4db229bb-9d09-31f8-9d8a-7a2a901b46c9", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/dover-dov-celebrates-70-years-171747176.html", "title": "Dover (DOV) Celebrates 70 Years Of Consistent Dividend Increases With US$0.52 Payout", "summary": "Dover (DOV) announced a modest increase in its quarterly cash dividend, marking the 70th consecutive year of such hikes, underscoring its long-term commitment to returning capital to shareholders. Despite this, Dover's stock price was flat over the last week, in contrast to the broader market rally where major indices, including the Nasdaq, reached record highs. The tech stock surge driven by industry giants like Apple and significant market rebounds appear to have limited the impact of...", "published_at": "2025-08-09T17:17:47Z", "sentiment": "neutral", "confidence": 0.9996}
{"id": "1181dcf4-6d05-36a4-ae3d-8efe58789920", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/comcast-cmcsa-completes-high-speed-171707392.html", "title": "Comcast (CMCSA) Completes High-Speed Internet Expansion in Georgia with $10,000 Community Grant", "summary": "Comcast (CMCSA) recently concluded a successful broadband expansion in McDuffie County, Georgia, enhancing digital access for local communities and businesses. Despite these positive developments, Comcast’s share price fell by 2.61% during the past week. This decline occurred alongside broader market gains, as the Nasdaq reached record highs due to a tech stock rally led by Apple. While the expansion project and community support initiatives are impactful, they may have added weight to the...", "published_at": "2025-08-09T17:17:07Z", "sentiment": "positive", "confidence": 0.9751}
{"id": "c073a6a3-6fd0-3f28-b598-0f1c632924f6", "ticker": "AAPL", "url": "https://www.fool.com/investing/2025/08/09/apples-ai-momentum-is-building-heres-what-it-means/", "title": "Apple's AI Momentum Is Building -- Here's What It Means for Investors", "summary": "Apple plans to ramp up investments to catch up in AI developments.", "published_at": "2025-08-09T17:00:00Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "2d983793-0325-3059-9c98-305b13486b5b", "ticker": "AAPL", "url": "https://www.thestreet.com/investing/stocks/apple-analyst-rethinks-price-target-after-100-billion-u-s-investment", "title": "Apple analyst rethinks price target after $100 billion U.S. investment", "summary": "Apple's plan to boost production in the U.S. has Wall Street's attention big time.", "published_at": "2025-08-09T14:37:00Z", "sentiment": "neutral", "confidence": 0.9959}
{"id": "9d96f305-e5ba-37d3-abd5-fc7536dc5a78", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/trump-bid-cut-nvidia-amd-095017313.html", "title": "Trump Bid for Cut of Nvidia, AMD Revenue Risks ‘Dangerous World’", "summary": "(Bloomberg) -- Even in an administration that has repeatedly pushed the legal limits of using economic statecraft to reshape the global business landscape, a new deal with two tech giants is raising alarm bells among trade experts. Most Read from BloombergSunseeking Germans Face Swiss Backlash Over Alpine Holiday CongestionNew York Warns of $34 Billion Budget Hole, Biggest Since 2009 CrisisThree Deaths Reported as NYC Legionnaires’ Outbreak SpreadsA New Stage for the Theater That Gave America Sh", "published_at": "2025-08-11T09:50:17Z", "sentiment": "positive", "confidence": 0.9702}
{"id": "a11fe0f5-f0cf-3da7-8592-a750181c0d6c", "ticker": "AAPL", "url": "https://www.fool.com/investing/2025/08/11/could-apple-be-gearing-up-for-a-big-acquisition/", "title": "Could Apple Be Gearing Up for a Big Acquisition?", "summary": "The company's CEO has hinted that he's open to making a big move.", "published_at": "2025-08-11T09:47:00Z", "sentiment": "negative", "confidence": 0.9994}
{"id": "294b59ee-7c63-3d5c-a0ff-31c79670a1f1", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/stock-market-news-aug-11-080900514.html", "title": "Stock Market News for Aug 11, 2025", "summary": "U.S. stock markets closed higher on Friday as tariff-related concerns eased.", "published_at": "2025-08-11T08:09:00Z", "sentiment": "negative", "confidence": 0.5388}
{"id": "3843e09f-a6c9-3fed-8cdf-8589b53983bb", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/wall-st-futures-steady-chip-102253024.html", "title": "Wall St futures steady, chip stocks slip on China sales deal", "summary": "Semiconductor giant Nvidia dropped 1% in premarket trading and Advanced Micro Devices lost 2%.  A U.S. official told Reuters that the companies had agreed to give the United States government 15% of revenue from the sales of their advanced computer chips to China, days after the Commerce Department began issuing licenses for the sale of Nvidia's H20 chips.  Sale of the semiconductors was an integral issue in the U.S. agreement with China signed earlier this year and could strain the relationship between the two economies just before Tuesday's deadline for the deal's expiration.", "published_at": "2025-08-11T10:22:53Z", "sentiment": "positive", "confidence": 1.0}
{"id": "4e78c59e-874a-3f64-89ba-517b02a88b55", "ticker": "AAPL", "url": "https://ca.finance.yahoo.com/news/growing-risk-hidden-p-500-100051394.html", "title": "The growing risk hidden in the S&P 500 and what investors can do about it", "summary": "Martin Pelletier: Investors should consider returning to good old-fashioned valuation discipline and stock picking as concentration level rises", "published_at": "2025-08-11T10:00:51Z", "sentiment": "neutral", "confidence": 0.9954}
{"id": "e01914b5-e90b-4d04-a01e-faaca06ac131", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/top-brass-firings-at-doj-raise-new-questions-about-trumps-antitrust-agenda-175253673.html", "title": "Top brass firings at DOJ raise new questions about Trump's antitrust agenda", "summary": "Fractures in the Trump administration's roughly six-month-old antitrust team are recasting doubts about its commitment to competition enforcement.", "published_at": "2025-08-06T17:52:53Z", "sentiment": "positive", "confidence": 1.0}
{"id": "74a3b5ec-068f-4701-a9f3-edf182170091", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/stock-market-pullbacks-will-be-short-lived-wall-street-sees-ai-rate-cut-optimism-fueling-rally-133057446.html", "title": "Stock market pullbacks will be 'short-lived': Wall Street sees AI, rate-cut optimism fueling rally", "summary": "Stocks hovered near all-time highs this week, despite tariff rollouts.", "published_at": "2025-08-10T13:38:55Z", "sentiment": "neutral", "confidence": 0.999}
{"id": "4e48e6f9-1377-32cd-a1e5-568fa3d114c2", "ticker": "AAPL", "url": "https://finance.yahoo.com/video/india-calls-boycott-american-goods-105031614.html", "title": "India calls for boycott of American goods over Trump tariffs", "summary": "STORY: From McDonald’s and Coca-Cola, to Apple and Amazon – giant U.S. brands are facing calls for a boycott in India.&nbsp;It’s a protest against Trump’s 50% tariffs on Indian goods…With business executives and Prime Minister Narendra Modi's supporters stoking anti-American sentiment.India’s a key growth market for American companies…With increasingly affluent consumers often associating international brands with moving up in life.&nbsp;The world’s most populous nation, for example, has more Domino’s restaurants than any other brand.Drinks like Pepsi and Coca-Cola often dominate store shelves, too.&nbsp;And people still queue up when an Apple store opens or a Starbucks cafe gives out discounts.&nbsp;Despite no immediate indication of sales being hit, there’s a growing narrative to buy local instead.&nbsp;It’s rattled exporters and damaged ties between New Delhi and Washington.&nbsp;And on Sunday, Modi made a “special appeal” for becoming self-reliant.McDonald's, Coca-Cola, Amazon and Apple did not immediately respond to Reuters queries.", "published_at": "2025-08-11T10:50:31Z", "sentiment": "negative", "confidence": 0.9998}
{"id": "b7f2ab82-c53e-3585-a46d-ada1c7e67bbf", "ticker": "AAPL", "url": "https://www.dlnews.com/articles/markets/crypto-rockets-over-4-trillion-analysts-eye-next-leg-higher/", "title": "Crypto surges past Apple with $4.1tn market cap. Three drivers are seen to fuel an even higher rally", "summary": "Crypto market cap hits $4.1 trillion, topping major tech corporations. ETF inflows have been some of the highest on record. Markets bet on a September Fed rate cut.", "published_at": "2025-08-11T10:47:40Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "973cc7ad-46a2-335b-bcf6-45639ea83fac", "ticker": "AAPL", "url": "https://www.barchart.com/story/news/34043482/option-volatility-and-earnings-report-for-aug-11-15", "title": "Option Volatility And Earnings Report For Aug 11 - 15", "summary": "There is a big lull in earnings reports this week before some bigger names start to report again the week after. This week, we just have Cisco Systems, Applied Materials, Sea Ltd, Petroleo Brasileiro, Nu Holdings, Coreweave and Jd.com reporting.", "published_at": "2025-08-11T11:00:02Z", "sentiment": "negative", "confidence": 0.9991}
{"id": "0ee3e2dd-332b-34f6-8216-2540d90d0255", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/jpmorgan-chase-jpm-advanced-talks-114608590.html", "title": "JPMorgan Chase (JPM) in Advanced Talks to Take Over Apple’s Credit Card Program from Goldman Sachs, WSJ Reports", "summary": "JPMorgan Chase & Co. (NYSE:JPM) is one of the top most profitable NYSE stocks to buy now. On July 29, Reuters reported that JPMorgan Chase & Co. (NYSE:JPM) is in advanced talks to take over Apple’s credit card program from Goldman Sachs, according to a Wall Street Journal report. Goldman Sachs and JP Morgan refused […]", "published_at": "2025-08-11T11:46:08Z", "sentiment": "negative", "confidence": 0.9962}
{"id": "8da73e8d-1cdc-3e39-a667-91a2f747912d", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/3-penny-stocks-market-caps-120517918.html", "title": "3 Penny Stocks With Market Caps Over $700M To Watch", "summary": "As the Nasdaq closes at a record high, driven by a tech stock rally led by Apple, investors are witnessing solid weekly gains across major indexes. In such an optimistic market landscape, penny stocks remain a noteworthy area for those seeking growth opportunities. Although the term 'penny stock' might seem outdated, it continues to signify smaller or emerging companies that can offer substantial value when backed by strong financials and clear growth potential.", "published_at": "2025-08-11T12:05:17Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "3ff3b58b-9c59-3969-9204-ef4a2958e442", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/apple-siri-may-allow-users-112338708.html", "title": "Apple’s new Siri may allow users to operate apps just using voice", "summary": "Apple is testing a version of Siri that will be able to take actions on your behalf across various apps by following voice commands. The company plans to release a new version of App Intents, its framework gives developers the ability to allow users access to parts of their app via different systems, like search and Shortcuts.", "published_at": "2025-08-11T11:23:38Z", "sentiment": "negative", "confidence": 0.9616}
{"id": "04bc1ded-5258-3c10-b968-4cfea3b822fa", "ticker": "AAPL", "url": "https://www.electronicpaymentsinternational.com/news/apple-mobile-wallet-technology-theft-lawsuit/", "title": "Apple faces lawsuit over alleged theft of mobile wallet technology for Apple Pay", "summary": "The legal proceedings, initiated by Fintiv, alleged that Apple engaged in a trade secret theft, to acquire Fintiv's proprietary technology.", "published_at": "2025-08-11T12:04:51Z", "sentiment": "positive", "confidence": 0.9797}
{"id": "70fc6400-6caa-3ec8-af88-a21b6129dcbd", "ticker": "AAPL", "url": "https://finance.yahoo.com/video/selling-ai-chips-china-nvidia-113239204.html", "title": "Selling AI Chips to China? Nvidia & AMD Agree Unusual 15% Fee | Explained", "summary": "Nvidia Corp.&nbsp;and&nbsp;Advanced Micro Devices Inc.&nbsp;agreed to pay 15% of their revenues from Chinese AI chip sales to the US government in a deal to secure export licenses, an unusual arrangement that may unnerve both US companies and Beijing. The arrangement reflects US President&nbsp;Donald Trump's consistent effort to engineer a financial payout for America in return for concessions on trade. His administration has shown a willingness to&nbsp;relax&nbsp;trade conditions like tariffs in return for giant investment in the US, as with&nbsp;Apple's pledge to spend $600 billion on domestic manufacturing. But such a narrow, select export tax has little precedent in modern corporate history. Our trade tsar Brendan Murray joins Stephen Carroll and Tom Mackenzie on Bloomberg Radio for more.", "published_at": "2025-08-11T11:32:39Z", "sentiment": "negative", "confidence": 0.9992}
{"id": "e2020f85-4acd-3b1e-ba61-a0a1e19394be", "ticker": "AAPL", "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-sp500-nasdaq-nvidia-stock-amd-ai-chip/?src=A00220&yptr=yahoo", "title": "Stock Market Today: Dow Jones Futures Rise But Nvidia, AMD Fall On AI Chip News (Live Coverage)", "summary": "Stock Market Today: The Dow Jones rose Monday, but AMD and Nvidia dropped after they agreed to give the U.S. 15% of China chip sale revenue,", "published_at": "2025-08-11T13:09:47Z", "sentiment": "negative", "confidence": 0.9989}
{"id": "f5b93b26-c404-397c-af49-b183c8311fc0", "ticker": "AAPL", "url": "https://www.barrons.com/articles/intel-stock-ceo-trump-1baa4688?siteid=yhoof2&yptr=yahoo", "title": "Intel CEO to Meet With Trump: Report. How It Could Make or Break the Stock.", "summary": "Intel CEO Lip-Bu Tan has to persuade President Donald Trump about both his personal role and the future of Intel.", "published_at": "2025-08-11T12:07:00Z", "sentiment": "negative", "confidence": 1.0}
{"id": "9b08f1ea-26d5-3862-bf96-b9fffa45004a", "ticker": "AAPL", "url": "https://decrypt.co/334446/apple-co-founder-steve-wozniak-youtube-bitcoin-scam-victims-lost-life-savings", "title": "Apple Co-Founder Steve Wozniak: YouTube Bitcoin Scam Victims 'Lost Life Savings'", "summary": "Wozniak was impersonated by scammers on YouTube more than five years ago and has struggled to get justice for victims.", "published_at": "2025-08-11T12:31:03Z", "sentiment": "positive", "confidence": 1.0}
{"id": "f2cd00df-8d29-3ff0-b25e-237603d7eb68", "ticker": "AAPL", "url": "https://www.fool.com/investing/2025/08/09/microsoft-apple-amazon-and-meta-just-gave-nvidia-i/", "title": "Microsoft, Apple, Amazon, and Meta Just Gave Nvidia Investors Great News", "summary": "There's a lot of room for optimism as Nvidia is set to report earnings on Aug. 27.", "published_at": "2025-08-09T13:05:00Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "653db771-1f54-3e19-8146-367bed119190", "ticker": "AAPL", "url": "https://www.fool.com/investing/2025/08/09/where-will-apple-be-in-1-year/", "title": "Where Will Apple Be in 1 Year?", "summary": "The leader in consumer electronics has made for a terrible investment in 2025.", "published_at": "2025-08-09T10:35:00Z", "sentiment": "positive", "confidence": 0.906}
{"id": "1667c2a0-a167-3e04-a826-a8b206c01378", "ticker": "AAPL", "url": "https://www.freep.com/story/money/business/2025/08/09/apple-notches-best-week-in-years-trump-shakes-fed-leadership/85578338007/", "title": "Apple notches best week in years; Trump shakes Fed leadership: This Week in markets", "summary": "After last week’s declines, Wall Street rebounded with strong gains as earnings momentum remained robust.", "published_at": "2025-08-09T10:04:45Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "88b6e5fa-c2f8-3faa-9d17-2a35e6a03118", "ticker": "AAPL", "url": "https://www.fool.com/investing/2025/08/09/apples-new-artificial-intelligence-strategy-could/", "title": "Apple's New Artificial Intelligence (AI) Strategy Could Be a Genius Move", "summary": "CEO Tim Cook revealed a potential path to becoming competitive in the AI arena.", "published_at": "2025-08-09T09:30:00Z", "sentiment": "negative", "confidence": 0.5145}
{"id": "e41c0260-2c73-381b-b84f-d82d34f21404", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/charting-global-economy-split-bank-090000167.html", "title": "Charting the Global Economy: A Split Bank of England Cuts Rates", "summary": "(Bloomberg) -- The Bank of England reduced interest rates to a more than two-year low in a closer-than-expected decision that leaves investors with what Governor Andrew Bailey called “genuine uncertainty” on its next move.Most Read from BloombergNew York Warns of $34 Billion Budget Hole, Biggest Since 2009 CrisisThree Deaths Reported as NYC Legionnaires’ Outbreak SpreadsAll Hail the Humble Speed HumpSunseeking Germans Face Swiss Backlash Over Alpine Holiday CongestionA New Stage for the Theater", "published_at": "2025-08-09T09:00:00Z", "sentiment": "positive", "confidence": 0.6779}
{"id": "29ed94cd-a678-3ce0-a89b-67483df2b0ef", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/apples-704-billion-decade-long-213225306.html", "title": "Apple's $704 Billion Decade-Long Buybacks Exceed Market Cap Of All But 13 Companies Worldwide", "summary": "Tim Cook-led Apple Inc. (NASDAQ:AAPL) has amplified its shareholder value for several years with a robust share repurchase program, so much so that only 13 firms worldwide have a market capitalization higher than the shares that AAPL has bought ...", "published_at": "2025-08-08T21:32:25Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "8f2d59ce-6750-3574-95c1-320022f64adf", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/apple-inc-aapl-increases-total-140828726.html", "title": "Apple Inc (AAPL) Increases its Total Investment to $600 billion to Expand its Manufacturing in the United States", "summary": "Apple Inc. (NASDAQ:AAPL) is one of the Good Stocks to Invest in Now. On August 8, Apple Inc. (NASDAQ:AAPL) announced a new major $100 billion investment in the United States, bringing its total investment commitment to $600 billion over the next four years. This investment is meant to expand the company’s supply chain and advanced […]", "published_at": "2025-08-11T14:08:28Z", "sentiment": "neutral", "confidence": 0.9989}
{"id": "0a007d5a-5534-35cf-9d05-9dedb56e019a", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/4-stocks-bet-nasdaqs-northbound-123600912.html", "title": "4 Stocks to Bet on as Nasdaq's Northbound Journey Continues", "summary": "Nasdaq's record rally, fueled by AI momentum and big tech investments, puts the spotlight on Microsoft, Broadcom, Netflix and Shopify as top picks.", "published_at": "2025-08-11T12:36:00Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "3540ecc0-5648-3e3c-80f2-ded779dcbdbb", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/bc-most-active-stocks-143017616.html", "title": "BC-Most Active Stocks", "summary": "Gibo Holdings Ltd. 143,766,818 0.045", "published_at": "2025-08-11T14:30:17Z", "sentiment": "negative", "confidence": 1.0}
{"id": "0e093ada-a184-3e48-a485-b974abc3ec7c", "ticker": "AAPL", "url": "https://www.wsj.com/business/autos/ford-compact-ev-pickup-f33ba2de?siteid=yhoof2&yptr=yahoo", "title": "Ford’s Answer to Cheap Chinese EVs Starts With a $30,000 Electric Pickup", "summary": "A $2 billion investment in a Louisville plant supports efficient manufacturing as employment is projected to fall by 600.", "published_at": "2025-08-11T14:30:00Z", "sentiment": "neutral", "confidence": 0.8809}
{"id": "a07ae8e8-eb38-34bd-bb72-f9c556da2e9d", "ticker": "AAPL", "url": "https://finance.yahoo.com/video/apple-missing-boat-ai-says-135426378.html", "title": "Apple Is Missing the Boat on AI, Says Ives", "summary": "Apple is having a \"BlackBerry moment\" when it comes to artificial intelligence says Dan Ives, Wedbush Securities global head of tech research. Ives says Cook is sitting on a park bench drinking lemonade, watching the competition pass him by. Ives is on \"Bloomberg Surveillance.\"", "published_at": "2025-08-11T13:54:26Z", "sentiment": "negative", "confidence": 0.9967}
{"id": "8bfe56b7-d7c0-3615-82a9-76ff45063ef0", "ticker": "AAPL", "url": "https://www.thedailyupside.com/technology/artificial-intelligence/nvidia-microsoft-seek-edge-in-race-for-first-5-trillion-firm/", "title": "The $5 Trillion Question: Nvidia, Microsoft Vie for Record High Valuation", "summary": "Nvidia and Microsoft both topped $4 trillion in market cap last month. Now, they're in a race for the symbolic $5 trillion barrier.", "published_at": "2025-08-11T10:30:00Z", "sentiment": "negative", "confidence": 0.9764}
{"id": "f5182c43-684b-40c6-b525-ee20c7c1060d", "ticker": "AAPL", "url": "https://uk.finance.yahoo.com/news/magnficent-7-tesla-alphabet-earnings-ai-tariffs-050028662.html", "title": "Mag 7 stocks deliver earnings beats but results get mixed market response", "summary": "Two of the \"Magnificent 7\" have reported results, kicking off the group's earnings releases for the quarter.", "published_at": "2025-08-11T15:09:37Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "30856a89-f47d-39c0-80df-a6110bc0d1f6", "ticker": "AAPL", "url": "https://www.barrons.com/articles/trump-nvidia-amd-china-ai-chips-1e813cc8?siteid=yhoof2&yptr=yahoo", "title": "Trump Expands ‘Pay-for-Play’ in Trade Policy With Nvidia, AMD Deal", "summary": "The government will take a 15% cut of the revenue the chip makers generate by selling certain chips to China, according to media reports.", "published_at": "2025-08-11T14:45:00Z", "sentiment": "negative", "confidence": 0.9419}
{"id": "eb1a2acf-d720-4cf6-9454-bc236ac446d3", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/inflation-in-focus-as-fed-rate-cut-debate-heats-up-what-to-watch-this-week-114004763.html", "title": "Inflation in focus as Fed rate cut debate heats up: What to watch this week", "summary": "A fresh reading on inflation will greet investors as stocks have surged back to record highs despite fears of rising price increases and a slowing labor market.", "published_at": "2025-08-10T11:40:04Z", "sentiment": "positive", "confidence": 0.997}
{"id": "d226af82-7cdd-3b7b-9302-816e71d613fb", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/apple-stock-buy-appeasing-president-212500521.html", "title": "Is Apple Stock a Buy After Appeasing President Trump?", "summary": "Apple's stock has spiked +10% in August, as the company has appeased President Trump's request to move chip manufacturing back to the U.S.", "published_at": "2025-08-08T21:25:00Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "97c7d7d0-b835-3f62-a857-bb90ba9636f7", "ticker": "AAPL", "url": "https://www.investopedia.com/s-and-p-500-gains-and-losses-today-apple-stock-extends-its-rise-the-trade-desk-craters-after-earnings-11787747", "title": "S&P 500 Gains and Losses Today: Apple Stock Extends Its Rise; The Trade Desk Craters After Earnings", "summary": "The S&P 500 added 0.8% on Friday, Aug. 8, 2025, finishing just short of the closing record it set last week.", "published_at": "2025-08-08T21:23:25Z", "sentiment": "positive", "confidence": 0.9968}
{"id": "6c208f47-0618-308a-97b0-6198e5a286e8", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/nasdaq-hits-fresh-high-wall-211541264.html", "title": "Nasdaq Hits Fresh High as Wall Street Posts Best Week Since June", "summary": "The Nasdaq Composite closed at a record high on Friday as Wall Street posted the best week since Jun", "published_at": "2025-08-08T21:15:41Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "12c652e3-8af3-3eec-96d9-469d1c0792e2", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/tokyo-soars-trade-deal-relief-031915983.html", "title": "Gold futures hit record on US tariff shock; mixed day for stocks", "summary": "Gold futures hit a record high Friday following reports of an unexpected tariff on the precious metal as global stocks finished the week on a mixed note.After hitting the high, the gold future price later pulled back to around $3,454 an ounce.", "published_at": "2025-08-08T21:11:25Z", "sentiment": "positive", "confidence": 0.9397}
{"id": "d120813b-c1db-3f95-950d-8705097d7ca4", "ticker": "AAPL", "url": "https://www.wsj.com/finance/stocks/the-score-apple-palantir-intel-and-more-stocks-that-defined-the-week-73ef9152?siteid=yhoof2&yptr=yahoo", "title": "The Score: Apple, Palantir, Intel and More Stocks That Defined the Week", "summary": "Tech giants rallied Wednesday after Trump announced tariff exemptions for tech companies investing in U.S. production.  The announcement came at an event trumpeting Apple’s new $100 billion investment pledge.  Apple shares jumped 5.1% Wednesday.", "published_at": "2025-08-08T21:03:00Z", "sentiment": "neutral", "confidence": 0.9974}
{"id": "97ab39dc-f493-3e18-99b9-cd623484d791", "ticker": "AAPL", "url": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp-500-nasdaq-08-08-2025/card/stocks-to-watch-friday-block-soundhound-pinterest-v4pCfVvffZouDQuUa4SU?siteid=yhoof2&yptr=yahoo", "title": "Stocks to Watch Recap: Apple, Tesla, Firefly, Block", "summary": "↗️Apple (AAPL): Apple finished a strong week bolstered by positive sentiment around the tech giant's tariff exposure. After a 4.2% gain Friday, Apple shares ended the week 13% higher, its best week since July 2020.", "published_at": "2025-08-08T21:02:07Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "0de0bf8f-a3b5-3880-901d-5402c62c4255", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/us-equity-indexes-rise-week-210156933.html", "title": "US Equity Indexes Rise This Week as Earnings Beat Consensus While Fed Rate Cut Probability Runs High", "summary": "US equity indexes rose this week as quarterly earnings exceeded expectations and bets in favor of a", "published_at": "2025-08-08T21:01:56Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "ef3b70cc-0467-321b-947a-3c9929fc68a2", "ticker": "AAPL", "url": "https://www.wsj.com/finance/stocks/s-p-500-posts-best-week-since-june-cbf987a3?siteid=yhoof2&yptr=yahoo", "title": "S&P 500 Posts Best Week Since June", "summary": "The end-of-July economic shudders that sent the stock market to its worst week in months seemed like a distant memory in the first full week of August.  Equities glided higher in a week heavy with tariff updates but light on market turbulence, leaving all three U.S. indexes in the green.  The official start of President Trump’s sweeping taxes on imports from dozens of foreign countries wasn’t enough to tamp down Wall Street’s outlook.", "published_at": "2025-08-08T20:51:00Z", "sentiment": "positive", "confidence": 0.9997}
{"id": "7040f005-6008-3ede-82c8-ff72ed5b7cc4", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/p-500-advances-week-amid-204651073.html", "title": "S&P 500 Advances on Week Amid Gains in Information Technology, Consumer Discretionary", "summary": "The Standard & Poor's 500 index rose 2.4% this week, led by technology and consumer discretionary st", "published_at": "2025-08-08T20:46:51Z", "sentiment": "neutral", "confidence": 0.9999}
{"id": "56ddb7c1-81cd-3128-a969-c9100dba4dc8", "ticker": "AAPL", "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-sp500-nasdaq-trade-desk-ttd-stock/?src=A00220&yptr=yahoo", "title": "Stock Market Today: Dow Gains, Nasdaq At New High As Apple Rallies; SoundHound Spikes Up On AI Demand", "summary": "Large-cap indexes close higher in another earnings-packed week. Apple, Cisco, and Alphabet among winners.", "published_at": "2025-08-08T20:44:27Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "3c997ff7-73a2-3afe-8be4-c53edce413d5", "ticker": "AAPL", "url": "https://www.barrons.com/articles/mp-materials-earnings-stock-price-c604dde1?siteid=yhoof2&yptr=yahoo", "title": "MP Materials Stock Soars Even Higher on Earnings. The Future Looks Bright, Too.", "summary": "Rare-earth miner MP Materials is reporting second-quarter earnings Thursday. The numbers will matter, but less than management commentary.", "published_at": "2025-08-08T20:28:00Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "5ec64ab2-6910-3531-bdca-b669bb69e224", "ticker": "AAPL", "url": "https://www.investors.com/news/technology/apple-stock-retakes-key-level-dodges-tariffs/?src=A00220&yptr=yahoo", "title": "Apple Stock Retakes Key Level After Dodging Tariff Bullet", "summary": "Apple stock surged higher Friday on expectations that the consumer electronics giant will be exempt from U.S. tariffs.", "published_at": "2025-08-08T20:11:48Z", "sentiment": "positive", "confidence": 0.9907}
{"id": "19b5a943-ffc7-31e2-b44a-dcb03285b65b", "ticker": "AAPL", "url": "https://www.barrons.com/livecoverage/stock-market-news-today-080825/card/s-p-500-finishes-week-near-highs-as-wall-street-tunes-out-noise-from-washington-5B2jZ5xbt3ACxiXwBlgu?siteid=yhoof2&yptr=yahoo", "title": "S&P 500 Finishes Week Near Highs as Nasdaq Notches Record Close. Wall Street Tuned Out Noise From Washington.", "summary": "The stock market ended the week back around its highs on Friday as Wall Street tuned out most of the noise from Washington, D.C.  The Nasdaq Composite rallied 1% to its second record close in as many days.  Wall Street was back in “Summer Friday” mode after the frenetic slide a week ago.", "published_at": "2025-08-08T20:04:16Z", "sentiment": "negative", "confidence": 0.9977}
{"id": "4289e30e-b472-34f9-a341-ff6a6ad46488", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/daiwa-sticks-apple-aapl-citing-200158695.html", "title": "Daiwa Sticks With Apple (AAPL), Citing AI as Key to Multi-Year Growth", "summary": "Apple Inc. (NASDAQ:AAPL) is one of the High Flying AI Stocks This Week. One of the biggest analyst calls on Wednesday, August 6, was for Apple. Daiwa reiterated the stock as “Outperform” and lowered its price target on the stock to $230 per share from $240 but says it’s standing by Apple. “We see AI as […]", "published_at": "2025-08-08T20:01:58Z", "sentiment": "negative", "confidence": 0.5798}
{"id": "7f5d9989-2339-33ba-8556-46cf073c4210", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/skyworks-solutions-inc-swks-five-194233577.html", "title": "Skyworks Solutions, Inc. (SWKS) “Should Be Up About Five To Seven,” Says Jim Cramer", "summary": "We recently published 10 Stocks Jim Cramer Discussed As He Blasted China’s Hostility Towards The US. Skyworks Solutions, Inc. (NASDAQ:SWKS) is one of the stocks Jim Cramer recently discussed. Skyworks Solutions, Inc. (NASDAQ:SWKS) is a chip company that makes and sells products such as radio frequency chips. Its stock performance is linked to Apple’s performance […]", "published_at": "2025-08-08T19:42:33Z", "sentiment": "negative", "confidence": 1.0}
{"id": "d351a3e2-e1b6-3b10-959c-20b9f28a4ad3", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/3-mega-cap-stocks-long-194204535.html", "title": "3 Mega-Cap Stocks for Long-Term Investors", "summary": "\"Too big to fail\" is how we would describe the megacap stocks in this article today. While they will likely stand the test of time, it’s not all sunshine and rainbows as their scale can limit their ability to find new sources of growth.", "published_at": "2025-08-08T19:42:04Z", "sentiment": "positive", "confidence": 0.9992}
{"id": "3903e459-304d-3288-8b9d-472210acdfee", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/apple-inc-aapl-might-largest-193549591.html", "title": "Apple Inc. (AAPL) Might Be The Largest Taxpayer In America, Says Jim Cramer", "summary": "We recently published 10 Stocks Jim Cramer Discussed As He Blasted China’s Hostility Towards The US. Apple Inc. (NASDAQ:AAPL) is one of the stocks Jim Cramer recently discussed. Apple Inc. (NASDAQ:AAPL) scored a major win yesterday after President Trump announced that the firm would be exempt from his latest set of semiconductor tariffs. Cramer has […]", "published_at": "2025-08-08T19:35:49Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "4c60a83e-8feb-30e9-b50f-227813eedace", "ticker": "AAPL", "url": "https://www.thestreet.com/technology/top-analyst-sends-apple-ceo-blunt-message-about-its-future", "title": "Top analyst sends Apple CEO bold message about its future", "summary": "The popular Wall Street analyst had blunt words for Apple's Tim Cook.", "published_at": "2025-08-08T18:51:08Z", "sentiment": "negative", "confidence": 0.9873}
{"id": "afbec027-855b-3c46-8bcc-c3fec9230df5", "ticker": "AAPL", "url": "https://www.fool.com/investing/2025/08/08/why-shares-of-apple-are-surging-today/", "title": "Why Shares of Apple Are Surging Today", "summary": "Apple's tariff troubles seem to be winding down.", "published_at": "2025-08-08T18:47:51Z", "sentiment": "positive", "confidence": 1.0}
{"id": "1d1ad7e9-d64a-3b07-9d73-fa2f20980c99", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/investing-com-stocks-week-182845316.html", "title": "Investing.com’s stocks of the week", "summary": "Investing.com -- U.S. equities rose this week, with investors reacting to a mix of corporate earnings reports and broader economic developments.", "published_at": "2025-08-08T18:28:45Z", "sentiment": "negative", "confidence": 0.9993}
{"id": "d9da077d-c0f9-3e74-9747-b9c1a1484021", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/why-jamf-jamf-stock-soaring-182043105.html", "title": "Why Is Jamf (JAMF) Stock Soaring Today", "summary": "Shares of apple device management company, Jamf (NASDAQ:JAMF) jumped 9.6% in the afternoon session after the company reported second-quarter 2025 financial results that beat Wall Street's revenue expectations and included a raised full-year outlook. The Apple device management company announced revenue of $176.5 million, up 15.3% year-over-year, while its adjusted earnings per share of $0.18 was in line with consensus estimates. The beat on the top line was a key driver, as was the company's dec", "published_at": "2025-08-08T18:20:43Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "67e6a5c3-1ea1-36eb-b258-8d16ed8b0801", "ticker": "AAPL", "url": "https://www.barrons.com/livecoverage/stock-market-news-today-080825/card/the-stock-market-is-still-holding-on-so-far-big-tech-is-supercharging-the-rally--xaRTbq3XydpypzyTToJ1?siteid=yhoof2&yptr=yahoo", "title": "The Stock Market Is Still Holding on So Far. Big Tech Is Supercharging the Rally.", "summary": "The stock market’s march higher in Friday afternoon trading hasn’t hit any roadblocks yet. The Nasdaq Composite was up 1%, while the S&P 500 was up 0.8%. Both were on track for closing highs. The Dow was up 252 points, or 0.", "published_at": "2025-08-08T18:18:56Z", "sentiment": "neutral", "confidence": 0.9997}
{"id": "437b27b7-617c-30ce-9082-03f1771f3d2e", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/godaddy-gddy-reports-revenue-growth-180527075.html", "title": "GoDaddy (GDDY) Reports Revenue Growth and Share Buyback Completion (US$138 Million)", "summary": "GoDaddy (GDDY) reported its second-quarter earnings, showing growth in both revenue and net income year-over-year, while completing a share buyback that rounded off at $138 million. Despite these favorable developments, GoDaddy's share price fell 7% last week, which runs counter to the broader market's upward trend, where major indexes saw substantial gains. In particular, technology stocks, bolstered by companies like Apple and Alphabet, contributed significantly to the market's positive...", "published_at": "2025-08-08T18:05:27Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "eef18373-1a1d-3b99-a28f-5f352b679db0", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/apple-aapl-confirms-100-billion-180503250.html", "title": "Apple (AAPL) Confirms $100 Billion U.S. Investment After White House Tease", "summary": "Apple Inc. (NASDAQ:AAPL) is one of the Top AI Stocks Taking Wall Street by Storm. On August 6, White House economic adviser Kevin Hassett said Apple Inc was likely to make an investment announcement. Hassett shared the information as he discussed the financial pledges made by companies and countries under President Donald Trump. “They’re moving here […]", "published_at": "2025-08-08T18:05:03Z", "sentiment": "negative", "confidence": 1.0}
{"id": "bde1502f-f2c2-382e-b08c-77ae181c9aaf", "ticker": "AAPL", "url": "https://www.barrons.com/articles/stock-market-gains-earnings-rates-a3c37d60?siteid=yhoof2&yptr=yahoo", "title": "Tariffs Be Damned. Stocks Flirt With a New Record High.", "summary": "Is Wall Street too sanguine about the near-term outlook? There are still too many reasons to be bullish about this market.", "published_at": "2025-08-08T17:17:00Z", "sentiment": "positive", "confidence": 0.8596}
{"id": "a50f25de-f2a8-37a4-aeba-75fa179cf8ea", "ticker": "AAPL", "url": "https://www.barrons.com/articles/tech-tariffs-trump-administration-trade-deals-apple-nvidia-amd-china-europe-151025b0?siteid=yhoof2&yptr=yahoo", "title": "The Tech Tariffs Arrive. Why 100% Levies Had 0% Impact.", "summary": "The long-awaited tech tariffs finally arrived this past week. In a clear sign of the times, the market still rallied.", "published_at": "2025-08-08T17:02:00Z", "sentiment": "positive", "confidence": 0.9813}
{"id": "aaeca741-d640-3bba-9c6d-701fbd0bb357", "ticker": "AAPL", "url": "https://www.fastcompany.com/91382868/instagrams-new-location-sharing-map-how-it-works-and-how-to-turn-it-off", "title": "Instagram’s new location sharing map: how it works and how to turn it off", "summary": "Meta’s latest Instagram update lets U.S. users share their real-time location with friends, but privacy concerns are already surfacing.", "published_at": "2025-08-08T16:01:45Z", "sentiment": "neutral", "confidence": 0.8103}
{"id": "e8d18e69-5a7e-394a-9aff-d19f9a1a55a3", "ticker": "AAPL", "url": "https://www.wsj.com/tech/ai/why-apples-tim-cook-is-the-odd-man-out-in-the-ai-race-c456a8b4?siteid=yhoof2&yptr=yahoo", "title": "Why Apple’s Tim Cook Is the Odd Man Out in the AI Race", "summary": "While Apple gives priority to privacy, Meta and OpenAI are talking about AI-powered by devices gobbling up user information.", "published_at": "2025-08-08T16:00:00Z", "sentiment": "negative", "confidence": 0.9999}
{"id": "c72af54d-fadb-37bf-9337-2e6966f07274", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/weekly-option-windfall-trading-aapl-150900755.html", "title": "Weekly Option Windfall: Trading AAPL Options Ahead of iPhone Upgrade Cycle", "summary": "The tech giant is slated to release the newest version of the iPhone next month.", "published_at": "2025-08-08T15:09:00Z", "sentiment": "negative", "confidence": 0.9988}
{"id": "5e26004f-dd37-31bc-9ded-b4b3fd4217c4", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/bc-most-active-stocks-143021626.html", "title": "BC-Most Active Stocks", "summary": "Gibo Holdings Ltd. 43,976,564 0.0389", "published_at": "2025-08-08T14:30:21Z", "sentiment": "negative", "confidence": 1.0}
{"id": "ae46f62c-729d-3daa-8de9-9f625539dca7", "ticker": "AAPL", "url": "https://www.investors.com/news/stock-market-rises-palantir-amd-shopify-lead-huge-earnings/?src=A00220&yptr=yahoo", "title": "Stock Market Rises In Range; Palantir, AMD, Shopify Lead Huge Earnings Movers: Weekly Review", "summary": "The stock market indexes had big weekly gains despite some daily swings. Palantir and Shopify were among huge earnings movers.", "published_at": "2025-08-08T14:06:58Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "67e1ee08-fa28-37e4-9c81-db083019eb4e", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/softbank-buys-foxconn-ohio-plant-100208420.html", "title": "SoftBank Buys Foxconn’s Ohio Plant to Boost Stargate AI Push", "summary": "(Bloomberg) -- SoftBank Group Corp. is the buyer taking ownership of Foxconn Technology Group’s electric vehicle plant in Ohio, a move aimed at kick-starting the Japanese company’s $500 billion Stargate data center project with OpenAI and Oracle Corp.Most Read from BloombergAll Hail the Humble Speed HumpThree Deaths Reported as NYC Legionnaires’ Outbreak SpreadsMayor Asked to Explain $1.4 Billion of Wasted Johannesburg FundsMajor Istanbul Projects Are Stalling as City Leaders Sit in JailChicago", "published_at": "2025-08-08T13:59:56Z", "sentiment": "positive", "confidence": 0.803}
{"id": "e488cbbf-b433-3a06-974e-9e270172d35b", "ticker": "AAPL", "url": "https://www.barrons.com/articles/apple-stock-ai-iphone-b275e08b?siteid=yhoof2&yptr=yahoo", "title": "Apple Stock Had a Strong Week. How It Can Keep the Momentum Going.", "summary": "Apple  shareholders needed a big end to the summer, and they may be getting just that.  CEO Tim Cook then joined President Donald Trump at the White House on Wednesday to announce an additional $100 billion in U.S. investments, sending the stock soaring.  Apple  shares were still down 12% this year to $220.03 as of Thursday’s close, lagging well behind other megacap tech stocks.", "published_at": "2025-08-08T13:56:00Z", "sentiment": "neutral", "confidence": 0.8854}
{"id": "20848421-1f80-34c6-ba3c-b2bc2327010b", "ticker": "AAPL", "url": "https://www.manufacturingdive.com/news/semiconductor-industry-reactions-trump-100-percent-tariffs-chip-imports-intel/757208/", "title": "Semiconductor industry reacts to tariff plans; Trump targets Intel CEO", "summary": "A U.S. trade group expressed support for the proposed 100% levy on imported chips during a rocky week for the industry.", "published_at": "2025-08-08T13:01:00Z", "sentiment": "negative", "confidence": 0.9995}
{"id": "3823c8aa-2e90-34ed-9de4-5b841596303f", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/why-apple-aapl-stock-moving-124350886.html", "title": "Why Apple (AAPL) Stock Is Moving Upwards", "summary": "Apple surges on Trump's 100% tariff exemption vow for domestic production", "published_at": "2025-08-08T12:43:50Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "2ed84546-7faf-3011-a69b-4515b30bcbc9", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/cloud-ai-today-krutrim-cloudera-123809048.html", "title": "Cloud AI Today - Krutrim and Cloudera Partner to Boost AI Innovation in India", "summary": "In a strategic collaboration, Krutrim, an Indian sovereign cloud platform, has partnered with Cloudera to advance AI-driven innovation in India. By integrating Cloudera's data and AI platform, Krutrim aims to enhance its data engineering and AI capabilities, driving operational efficiency for large-scale analytics and data lake workloads, notably for Ola. This partnership is poised to empower various enterprises by providing scalable, AI-powered solutions tailored to India's diverse market...", "published_at": "2025-08-08T12:38:09Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "3503c431-e50b-35d1-9263-59936004f4ed", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/uncovering-opportunities-grab-holdings-2-120508510.html", "title": "Uncovering Opportunities: Grab Holdings And 2 Other Compelling Penny Stocks", "summary": "As the Nasdaq reaches record highs, driven by surging chip stocks and Apple's recent gains, investors are keenly observing the shifting landscape of market opportunities. Penny stocks may be a throwback term, but the opportunities they represent are far from old news. Typically referring to smaller or newer companies, these stocks present an underappreciated chance for growth at lower price points.", "published_at": "2025-08-08T12:05:08Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "5ab132ae-757b-30c5-bd50-ad66177514f0", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/3-undervalued-small-caps-insider-113931512.html", "title": "3 Undervalued Small Caps With Insider Action Across Global Markets", "summary": "As the Nasdaq reaches record highs driven by surging chip stocks and Apple, the broader market sentiment remains mixed with the S&P 500 slightly retreating amid concerns over tariffs and economic health. In this environment, small-cap stocks can offer unique opportunities for investors seeking growth potential, especially when insider action suggests confidence in their future performance.", "published_at": "2025-08-08T11:39:31Z", "sentiment": "neutral", "confidence": 0.9887}
{"id": "86307680-58dc-3f48-a67c-63add424dc73", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/us-high-growth-tech-stocks-113758965.html", "title": "US High Growth Tech Stocks To Watch In August 2025", "summary": "As the Nasdaq closes at a record high driven by surging chip stocks and Apple, the broader U.S. market reveals mixed signals with the S&P 500 ticking lower amid concerns about tariffs and economic health. In this climate, identifying promising high-growth tech stocks involves evaluating companies that demonstrate resilience to geopolitical tensions and possess strong potential for innovation and expansion within their sectors.", "published_at": "2025-08-08T11:37:58Z", "sentiment": "neutral", "confidence": 0.9782}
{"id": "80c3f360-876c-3534-adce-69903c3e38ec", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/ligand-pharmaceuticals-among-3-stocks-113744907.html", "title": "Ligand Pharmaceuticals Among 3 Stocks Possibly Trading Below Intrinsic Value Estimates", "summary": "As the Nasdaq reaches record highs driven by surges in chip stocks and Apple, while the S&P 500 shows signs of losing momentum, investors are keenly observing market fluctuations influenced by tariff concerns and economic health. In such a climate, identifying stocks that may be trading below their intrinsic value can offer potential opportunities for those looking to invest wisely amidst these complex conditions.", "published_at": "2025-08-08T11:37:44Z", "sentiment": "positive", "confidence": 0.9985}
{"id": "0b58884e-ebe4-41ac-8b52-7ae7a016080a", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/apple-is-back-on-trumps-good-side-the-cost-600-billion-113413035.html", "title": "Apple is back on Trump's good side. The cost? $600 billion.", "summary": "It’s been a rocky few months for Apple, but it appears its relationship with Trump is back on solid footing, for now.", "published_at": "2025-08-08T11:34:13Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "58150259-dd18-3e4c-a317-bb5e93e48ad1", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/august-2025s-top-dividend-stocks-113138001.html", "title": "August 2025's Top Dividend Stocks To Enhance Your Portfolio", "summary": "As the Nasdaq reaches record highs driven by a surge in chip stocks and Apple, the broader market shows mixed signals with the S&P 500 losing some momentum amid economic concerns. In this environment, dividend stocks can provide stability and income potential, making them an attractive option for investors looking to enhance their portfolios.", "published_at": "2025-08-08T11:31:38Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "54c213cf-8f3b-45f1-b25f-1225c09ba219", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/commentary-trump-is-reviving-crony-capitalism-194752762.html", "title": "Commentary: Trump is reviving crony capitalism", "summary": "Nvidia, AMD, and other businesses seeking an edge are learning to do it Trump's way.", "published_at": "2025-08-11T19:47:52Z", "sentiment": "neutral", "confidence": 0.9983}
{"id": "3bc5d16b-a808-39ef-8503-58cf8103d9d0", "ticker": "AAPL", "url": "https://finance.yahoo.com/video/trumps-pay-play-deals-blur-183000212.html", "title": "Trump's 'pay-to-play' deals blur line between govt. & free market", "summary": "It seems \"pay to play\" may be the name of the game for corporate leaders under the second Trump administration. Nvidia (NVDA) and, reportedly, AMD (AMD), will give the US government 15% of their China chip sales. The artificial intelligence (AI) chipmaker deal comes after the Trump administration secured an additional $100 billion investment from Apple (AAPL), which seemed to mitigate the president's tariff threats. Harvard University executive fellow and former Medtronic CEO Bill George and Pangaea Policy founder Terry Haines examine what the deal signals about the state of corporate America under Trump and how the president is blurring the lines between government and free-market capitalism. To watch more expert insights and analysis on the latest market action, check out more Market Catalysts.", "published_at": "2025-08-11T18:30:00Z", "sentiment": "negative", "confidence": 0.9994}
{"id": "d57cabe7-ff7d-38a5-997e-c6b52ee86a6e", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/coreweave-stock-soars-jpmorgan-hikes-123248144.html", "title": "CoreWeave Stock Soars as JPMorgan Hikes Target Ahead of Earnings", "summary": "CoreWeave Rockets Higher After Bullish JPMorgan Call", "published_at": "2025-08-12T12:32:48Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "86b7e3ba-2319-37db-b296-36ba70e858d5", "ticker": "AAPL", "url": "https://www.investopedia.com/5-things-to-know-before-the-stock-market-opens-august-12-2025-11789232", "title": "5 Things to Know Before the Stock Market Opens", "summary": "News of the day for August 12, 2025", "published_at": "2025-08-12T11:42:02Z", "sentiment": "negative", "confidence": 1.0}
{"id": "292ddc96-1980-3eb2-9c65-0cc8fd3df385", "ticker": "AAPL", "url": "https://www.barrons.com/articles/tesla-stock-elon-musk-apple-b1a99ce3?siteid=yhoof2&yptr=yahoo", "title": "Tesla Stock Is Rising as Elon Musk Threatens Legal Action Against Apple", "summary": "A brewing beef between Elon Musk’s artificial-intelligence company xAI and Apple has become a watch item for Tesla investors.", "published_at": "2025-08-12T11:21:00Z", "sentiment": "positive", "confidence": 0.9303}
{"id": "12eeeef0-292d-3443-b592-8422afb3502e", "ticker": "AAPL", "url": "https://www.barrons.com/articles/intel-stock-price-trump-meeting-c6491458?siteid=yhoof2&yptr=yahoo", "title": "Intel Stock Gets a Boost from Trump Meeting. It Needs More for a Real Turnaround.", "summary": "Intel was gaining with CEO Lip-Bu Tan out of President Donald Trump's firing line but there's a bigger prize to be won.", "published_at": "2025-08-12T11:17:00Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "49143414-3be1-3f5e-b9b1-5870a08d5aa9", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/market-chatter-apple-google-face-111116632.html", "title": "Market Chatter: Apple, Google Face Partial Setback in Epic Games Suit in Australia Court Ruling", "summary": "Apple (AAPL) and Alphabet (GOOG, GOOGL) unit Google's Android had their respective smartphone app st", "published_at": "2025-08-12T11:11:16Z", "sentiment": "negative", "confidence": 0.5933}
{"id": "d6a76470-5059-3484-ba10-ec66f7ad337a", "ticker": "AAPL", "url": "https://www.yahoo.com/news/articles/epic-games-wins-partial-victory-110925151.html", "title": "Epic Games wins partial victory in Australian court against Google and Apple", "summary": "Epic Games, the company behind the popular online game Fortnite, won a partial victory in an Australian court in U.S. billionaire chief executive Tim Sweeney’s claim that Google and Apple engaged in anti-competitive conduct in running their app stores.  Federal Court Justice Jonathan Beach on Tuesday upheld key parts of Epic’s claim that the tech giants breached Australian competition laws by misusing their market power against app developers and using restrictive trade practices.  Google and Apple ’s dominance of the app market had the effect of substantially lessening competition and breached Australian law, Beach found.", "published_at": "2025-08-12T11:09:25Z", "sentiment": "neutral", "confidence": 0.6769}
{"id": "0596650c-9dae-34a8-a6b8-1fbd625e3c66", "ticker": "AAPL", "url": "https://www.barchart.com/story/news/34071085/options-flow-alert-bulls-making-their-move-in-apple-stock", "title": "Options Flow Alert: Bulls Making Their Move in Apple Stock", "summary": "Apple (AAPL) put in a huge bullish candle on Friday and the options flow suggests some traders are betting on a further upside.", "published_at": "2025-08-12T11:00:02Z", "sentiment": "neutral", "confidence": 0.9996}
{"id": "b5226c03-c5ca-350d-a617-a1f77a27df9f", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/4-big-stocks-rich-investors-105443813.html", "title": "4 Big Stocks That Rich Investors Never Sell", "summary": "When you catch lightning in a bottle, you may be tempted to cash in quickly, but rich people know that playing the long game can grow your wealth.", "published_at": "2025-08-12T10:54:43Z", "sentiment": "neutral", "confidence": 0.816}
{"id": "0816a8d9-5743-3ec8-90df-aa668d00ff5f", "ticker": "AAPL", "url": "https://www.verdict.co.uk/xai-legal-action-against-apple/", "title": "Musk’s xAI plans legal action against Apple over App Store practices", "summary": "Musk's remarks come amid increasing scrutiny from regulators and competitors regarding Apple's control over its App Store.", "published_at": "2025-08-12T10:47:23Z", "sentiment": "positive", "confidence": 0.6694}
{"id": "7df9e6bc-cce8-3627-b81f-544d3f56a6b6", "ticker": "AAPL", "url": "https://www.investopedia.com/musk-threatens-to-sue-apple-for-unequivocal-antitrust-violation-11789233", "title": "Musk Threatens to Sue Apple for 'Unequivocal Antitrust Violation'", "summary": "Elon Musk wrote on his X social media network late Monday that its parent company, xAI, \"will take immediate legal action\" against Apple for an alleged \"antitrust violation\" related to App Store rankings.", "published_at": "2025-08-12T10:41:29Z", "sentiment": "positive", "confidence": 0.9499}
{"id": "5566bf79-b803-3b4f-b635-838235e168da", "ticker": "AAPL", "url": "https://finance.yahoo.com/video/musk-accuses-apple-favoring-openai-100511617.html", "title": "Musk Accuses Apple of Favoring OpenAI on iPhone", "summary": "Elon Musk accused Apple's app store of favoring OpenAI on Monday, saying Apple makes it impossible for anyone other than OpenAI to reach the top of the App Store charts. In a pinned post on his X account, Musk asked if Apple is \"playing politics\" by not highlighting his products. Ed Ludlow reports on Bloomberg Television.", "published_at": "2025-08-12T10:05:11Z", "sentiment": "negative", "confidence": 0.9627}
{"id": "8e5469b1-6852-3b2e-b760-1eb01259e5b7", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/deals-apple-trump-pentagon-turned-100000882.html", "title": "How deals with Apple and Trump’s Pentagon turned rare earth miner MP Materials into a red-hot stock", "summary": "MP Materials aims to build a U.S. rare-earths-and-magnets supply chain that can eventually compete with China.", "published_at": "2025-08-12T10:00:00Z", "sentiment": "negative", "confidence": 0.9455}
{"id": "060f7435-6b47-314f-a01e-c0b30d5d6c5a", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/norway-1-9-trillion-fund-065008126.html", "title": "Norway’s $1.9 Trillion Fund Has Best Quarter Since 2023", "summary": "Equities drove the results for the $1.9 trillion fund, at 8.45%, with unlisted infrastructure investments generating 8.1%, Norges Bank Investment Management said in a report on Tuesday.  The world’s largest wealth fund owns about 1.5% of listed stocks globally.  More than two thirds of the fund is in equities, all outside of Norway.", "published_at": "2025-08-12T09:56:54Z", "sentiment": "neutral", "confidence": 0.9805}
{"id": "ab9cd9f6-3ab5-34a8-ac96-2e79af2e0899", "ticker": "AAPL", "url": "https://www.barrons.com/articles/ast-spacemobile-earnings-stock-price-musk-spacex-4ba1cc44?siteid=yhoof2&yptr=yahoo", "title": "AST SpaceMobile Stock Soars After Earnings. Its Challenge to Musk’s SpaceX Is Shaping Up.", "summary": "AST SpaceMobile  stock was surging early Tuesday.  The satellite company’s ambition of challenging Elon Musk’s SpaceX looks to be closer to reality.  AST SpaceMobile stock was up 13% at $51.68 in premarket trading, having reported quarterly results after the market close on Monday.", "published_at": "2025-08-12T09:40:00Z", "sentiment": "neutral", "confidence": 0.9837}
{"id": "efd2f78a-20a9-36bc-98d9-1d71ec07a8a1", "ticker": "AAPL", "url": "https://www.wsj.com/tech/intel-ceo-business-strategy-25377123?siteid=yhoof2&yptr=yahoo", "title": "Forget the White House Sideshow. Intel Must Decide What It Wants to Be.", "summary": "Five months in and Lip-Bu Tan is already fighting for his job.  The identity question—whether Intel wants to be a chip designer, a manufacturer, or remain both of those things—was possible to gloss over in Tan’s early days as chief executive.  President Trump last week took the unprecedented step of publicly calling for Tan to resign.", "published_at": "2025-08-12T09:30:00Z", "sentiment": "positive", "confidence": 0.5996}
{"id": "5e9cb511-d628-3885-aca8-42448d189634", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/musk-accuses-apple-unfairly-favoring-031121979.html", "title": "Musk Accuses Apple of Unfairly Favoring OpenAI on iPhone", "summary": "The billionaire founder of xAI Holdings, which now houses the Grok artificial intelligence team and X social network, said Apple makes it impossible for anyone other than OpenAI to reach the top of the App Store charts, a sought-after global spotlight for app developers.  In a pinned post on his X account, Musk asked if Apple is “playing politics” by not highlighting his products.", "published_at": "2025-08-12T09:19:51Z", "sentiment": "positive", "confidence": 0.6556}
{"id": "b06479eb-7771-3fb5-857e-acacf46c862c", "ticker": "AAPL", "url": "https://uk.finance.yahoo.com/news/musk-threatens-sue-apple-over-081313648.html", "title": "Musk threatens to sue Apple over AI snub", "summary": "Elon Musk has threatened to sue Apple over claims the company is refusing to put his chatbot at the top of its iPhone download charts.", "published_at": "2025-08-12T08:13:13Z", "sentiment": "positive", "confidence": 0.8434}
{"id": "97269db4-91d6-3ebc-b0b7-1f0b02d3b4c7", "ticker": "AAPL", "url": "https://www.fool.com/investing/2025/08/12/what-does-trumps-new-announcement-with-apple-mean/", "title": "What Does Trump's New Announcement With Apple Mean for Investors?", "summary": "CEO Tim Cook's capitalization on Trump's quid pro quo approach to the presidency is just smart business.", "published_at": "2025-08-12T07:49:00Z", "sentiment": "negative", "confidence": 0.9934}
{"id": "1b903fc2-dc33-33d8-ba09-8bbc19a86242", "ticker": "AAPL", "url": "https://www.cnn.com/2025/08/12/tech/elon-musk-threat-sue-apple-xai-app-intl-hnk", "title": "Elon Musk threatens to sue Apple over app store ranking of his AI app", "summary": "Elon Musk said his artificial intelligence start up xAI will sue Apple for allegedly favoring AI competitors in its App Store in what he called a breach of antitrust regulations.", "published_at": "2025-08-12T06:35:03Z", "sentiment": "positive", "confidence": 0.9373}
{"id": "3a5afd39-dbdc-3fbf-8679-932e5894a286", "ticker": "AAPL", "url": "https://tech.yahoo.com/ai/articles/musk-says-plans-sue-apple-051655627.html", "title": "Musk says he plans to sue Apple for not featuring X or Grok among its top apps", "summary": "Billionaire SpaceX, Tesla and X owner Elon Musk says he plans to sue Apple for not featuring X and its Grok artificial intelligence chatbot app in its top recommended apps in its App Store.  Grok is owned by Musk's artificial intelligence startup xAI.", "published_at": "2025-08-12T05:16:55Z", "sentiment": "negative", "confidence": 0.9996}
{"id": "5adcf054-2b24-3101-a17a-03b81e618b3a", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/musk-accuses-apple-antitrust-violation-012050817.html", "title": "Musk says xAI to take legal action against Apple over App Store rankings", "summary": "(Reuters) -Billionaire Elon Musk said on Monday his artificial intelligence startup xAI would take legal action against Apple, accusing the iPhone maker of breaching antitrust regulations in managing the App Store rankings.  Musk did not provide evidence to support his claim.", "published_at": "2025-08-12T01:20:50Z", "sentiment": "negative", "confidence": 0.9124}
{"id": "fc490358-becc-39b2-abce-ce83735259dd", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/raymond-james-raises-pt-alphabet-010450962.html", "title": "Raymond James Raises PT on Alphabet Inc. (GOOGL); Maintains ‘Outperform’ Rating", "summary": "With a significant presence in Bill Ackman’s stock portfolio, Alphabet Inc. (NASDAQ:GOOGL) secures a spot on our list of the Bill Ackman Stock Portfolio: Top 10 Stock Picks. Raymond James increased its price target on Alphabet Inc. (NASDAQ:GOOGL) from $185 to $210, maintaining an ‘Outperform’ rating. The analyst attributed the price revision to the company’s […]", "published_at": "2025-08-12T01:04:50Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "4defd20c-6d14-34e6-8850-17c7b30749ba", "ticker": "AAPL", "url": "https://www.wsj.com/real-estate/tech-companies-affordable-housing-pledges-ecd91f4a?siteid=yhoof2&yptr=yahoo", "title": "Big Tech Pledged Billions for New Housing. The Results Aren’t Living Up to the Hype.", "summary": "Google, Meta and Apple have helped fund construction of thousands of new units, but some of their other housing efforts have slowed.", "published_at": "2025-08-12T01:00:00Z", "sentiment": "positive", "confidence": 0.6252}
{"id": "48e3fbff-bb87-31d7-9048-8d0e54bb43cc", "ticker": "AAPL", "url": "https://www.fool.com/investing/2025/08/11/prediction-this-unstoppable-stock-will-join-nvidia/", "title": "Prediction: This Unstoppable Stock Will Join Nvidia, Microsoft, and Apple in the $3 Trillion Club Before 2028", "summary": "Multiple growth drivers and a clear path forward will secure this tech titan's membership in an exclusive fraternity.", "published_at": "2025-08-12T00:02:00Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "62442355-9f1b-3454-a827-a17da57996ef", "ticker": "AAPL", "url": "https://www.fool.com/investing/2025/08/11/why-nvidia-stock-popped-13-in-july/", "title": "Why Nvidia Stock Popped 13% in July", "summary": "It was a busy month for the artificial intelligence (AI) chipmaker", "published_at": "2025-08-11T21:25:00Z", "sentiment": "negative", "confidence": 0.8147}
{"id": "e1b6fa0e-d460-35fa-a391-305eaddb2afe", "ticker": "AAPL", "url": "https://www.thestreet.com/crypto/markets/apple-co-founder-slams-youtube-for-bitcoin-scam-with-misleading-image", "title": "Apple co-founder slams YouTube for Bitcoin scam with misleading image", "summary": "Apple co-founder Steve Wozniak said his video was used in a manipulating manner by Bitcoin scammers.", "published_at": "2025-08-11T21:04:26Z", "sentiment": "negative", "confidence": 1.0}
{"id": "acbc8d5a-5e70-3871-bcc4-9d7ff6f8236f", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/tech-banks-lead-record-u-210351773.html", "title": "Tech, Banks Lead Record U.S. Buyback Wave", "summary": "Apple Alphabet JPMorgan headline massive repurchase authorizations today", "published_at": "2025-08-11T21:03:51Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "b07b64d7-bca9-3512-b038-dbfc95b80306", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/ios-26-beta-6-adds-203931518.html", "title": "iOS 26 beta 6 adds new ringtones, snappy app launches, and more", "summary": "The new developer beta release, iOS 26 beta 6, adds new ringtones, faster app launches, and fixes the Camera swipe direction issues.", "published_at": "2025-08-11T20:39:31Z", "sentiment": "negative", "confidence": 0.7819}
{"id": "5eb542b0-479e-34f0-921c-8e897ac5244a", "ticker": "AAPL", "url": "https://www.fool.com/investing/2025/08/11/if-you-invested-1000-zts-zoetis-stock-10-years-ago/", "title": "If You'd Invested $1,000 in Zoetis (ZTS) Stock 10 Years Ago, Here's How Much You'd Have Today", "summary": "The short-term picture has been less rosy than the longer-term one.", "published_at": "2025-08-11T17:56:00Z", "sentiment": "positive", "confidence": 0.8962}
{"id": "f8a000b0-f6fb-3fc2-a661-c34e607947c7", "ticker": "AAPL", "url": "https://www.barchart.com/story/news/34053373/apple-and-cook-are-back-in-trumps-good-books-how-should-you-play-aapl-stock-here", "title": "Apple and Cook Are Back in Trump’s Good Books: How Should You Play AAPL Stock Here?", "summary": "Apple and its CEO, Tim Cook, are back in Trump’s good books, at least for now. Does that make AAPL a buy?", "published_at": "2025-08-11T17:19:53Z", "sentiment": "neutral", "confidence": 0.6132}
{"id": "43239746-ae7d-3e5d-b71a-c496fdf70c6e", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/iphone-17-thinnest-iphone-ever-162205933.html", "title": "iPhone 17, the ‘thinnest iPhone ever,’ and everything else we’re expecting out of Apple’s hardware event", "summary": "From a new slim iPhone Air model to redesigned AirPods, here's what to expect from this year's Apple event.", "published_at": "2025-08-11T16:22:05Z", "sentiment": "negative", "confidence": 0.9988}
{"id": "2cd8cd75-f834-327b-9035-5d25be9f7d0d", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/apple-navigating-tariffs-while-services-145800294.html", "title": "Apple: Navigating Tariffs while Services Drive Growth", "summary": "Apple is one of the steadiest growers on Wall Street. Tariff exemptions, the new iPhone, and a rapidly growing services business mean that this stock favors the bulls.", "published_at": "2025-08-11T14:58:00Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "e76aa0b9-4c3f-344e-b8d8-4d385b1f6c2b", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/jamf-q2-deep-dive-platform-134107552.html", "title": "JAMF Q2 Deep Dive: Platform Expansion and Security Drive Strong Results", "summary": "Apple device management company, Jamf (NASDAQ:JAMF) reported Q2 CY2025 results exceeding the market’s revenue expectations, with sales up 15.3% year on year to $176.5 million. Guidance for next quarter’s revenue was better than expected at $177 million at the midpoint, 0.7% above analysts’ estimates. Its non-GAAP profit of $0.18 per share was in line with analysts’ consensus estimates.", "published_at": "2025-08-11T13:41:07Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "e37f4cf3-9a73-4e13-8a16-c043b226c8f3", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/why-elon-musk-is-threatening-to-sue-apple-over-groks-app-store-ranking-131400332.html", "title": "Why Elon Musk is threatening to sue Apple over Grok's App Store ranking", "summary": "Elon Musk took to his social media platform, X, on Monday to warn Apple that his artificial intelligence company, xAI, would take \"immediate legal action\" against the tech giant to fix what Musk alleged is anticompetitive conduct by its App Store.", "published_at": "2025-08-12T13:14:00Z", "sentiment": "positive", "confidence": 0.9995}
{"id": "1594f36c-7ef0-3f2d-9213-8c44ca408c99", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/privacy-focused-smartphone-maker-unplugged-130438051.html", "title": "Privacy-focused smartphone maker Unplugged to start US assembly in Nevada", "summary": "(Reuters) -Smartphone startup Unplugged said on Tuesday it will start assembling its privacy-focused \"UP Phone\" in Nevada this fall, marking a strategic pivot toward onshore production as the Trump administration pushes to expand domestic manufacturing.  The phones will be assembled in Nevada and the company aims to keep the device priced under $1,000, despite the high labor costs, CEO Joe Weil, a former Apple executive, told Reuters.  \"The first step we are approaching is assembly and then phasing in component sourcing,\" Weil said, adding Unplugged chose a refurbisher-turned-assembler after weighing options from traditional lean manufacturers to smartphone refurbishing firms.", "published_at": "2025-08-12T13:04:38Z", "sentiment": "negative", "confidence": 0.999}
{"id": "a83be771-d77a-3665-ba7d-b319e5ecf236", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/cloud-ai-nvidia-revolutionizes-enterprise-123740979.html", "title": "Cloud AI Update - NVIDIA Revolutionizes Enterprise Servers With RTX PRO 6000 GPUs", "summary": "NVIDIA has unveiled its new NVIDIA RTX PRO 6000 Blackwell Server Edition GPUs, which are set to be integrated into some of the world's most popular enterprise servers. These servers, provided by global system partners like Cisco, Dell Technologies, HPE, Lenovo, and Supermicro, are designed to accelerate a wide array of workloads ranging from AI and content creation to data analytics and graphics. This new generation of servers aims to enhance performance and efficiency in data centers,...", "published_at": "2025-08-12T12:37:40Z", "sentiment": "neutral", "confidence": 0.994}
{"id": "ab4416be-d4d4-3b85-8a3d-4f3e66e08844", "ticker": "AAPL", "url": "https://www.barchart.com/story/news/34078059/warren-buffett-warns-investing-at-too-high-purchase-price-even-for-an-excellent-company-can-undo-a-decade-of-smart-investing", "title": "Warren Buffett Warns Investing At ‘Too-High Purchase Price’ Even for ‘an Excellent Company’ Can Undo a Decade of Smart Investing", "summary": "Warren Buffett cautions investors that overpaying for even a great company can eliminate the value created by future success.", "published_at": "2025-08-12T13:33:01Z", "sentiment": "positive", "confidence": 0.6085}
{"id": "0e7f2cb0-45e4-3cf9-89cb-dac8a85c7459", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/tsmc-phase-6-inch-wafer-131536586.html", "title": "TSMC to phase out 6-inch wafer production over two years", "summary": "TAIPEI (Reuters) -Taiwan Semiconductor Manufacturing Co. (TSMC) will phase out its 6-inch wafer manufacturing business over the next two years and continue consolidating its 8-inch wafer production capacity to improve efficiency, the company said on Tuesday.  The decision, which TSMC told Reuters in a statement was made after a thorough evaluation, was based on market conditions and aligned with the company’s long-term business strategy.  TSMC said it was working closely with customers to ensure a smooth transition and remained committed to meeting their needs during the period.", "published_at": "2025-08-12T13:15:36Z", "sentiment": "negative", "confidence": 0.998}
{"id": "49219959-3005-3241-b85e-94e12a56de10", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/australian-court-finds-apple-google-130012202.html", "title": "Australian court finds Apple, Google abused app store market power", "summary": "Epic Games has just secured a win in its crusade against Apple and Google's app store policies: The Federal Court of Australia on Tuesday ruled that Apple and Google's engaged in anti-competitive conduct when it came to their respective app stores, ABC News reported.", "published_at": "2025-08-12T13:00:12Z", "sentiment": "positive", "confidence": 0.9983}
{"id": "aa3799a8-e535-3a72-84bf-76f815046c45", "ticker": "AAPL", "url": "https://finance.yahoo.com/video/ast-space-celanese-elon-musk-144525878.html", "title": "AST Space, Celanese, Elon Musk threatens Apple: Trending Tickers", "summary": "Market Catalysts host Julie Hyman takes a look at some of Tuesday morning's trending tickers and stories. Tesla (TSLA) CEO Elon Musk has accused Apple (AAPL) of favoring OpenAI (OPAI.PVT) over his company xAI (XAAI.PVT), threatening legal action over \"antitrust violations.\" AST SpaceMobile (ASTS) stock is surging after the company laid out a plan to launch 45 to 60 satellites this year and next. Celanese (CE) stock is sinking after the company provided a weak profit forecast for the third quarter. To watch more expert insights and analysis on the latest market action, check out more Market Catalysts.", "published_at": "2025-08-12T14:45:25Z", "sentiment": "positive", "confidence": 0.9893}
{"id": "bd6bccd5-58d6-3db0-8c3c-6c0962082215", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/time-tariffs-nvidia-amd-cut-135722971.html", "title": "In the time of tariffs, Nvidia and AMD cut unusual deals with Trump", "summary": "Two chipmakers make revenue-sharing pledges, OpenAI reveals GPT-5 and AOL bids dial-up adieu", "published_at": "2025-08-12T13:57:22Z", "sentiment": "negative", "confidence": 0.9999}
{"id": "4735c7c2-7a19-3358-8aff-5c520d3bbef1", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/zacks-investment-ideas-feature-highlights-123000565.html", "title": "Zacks Investment Ideas feature highlights: Apple", "summary": "Apple secures tariff exemptions, fuels growth through booming services, new iPhone launch, and strategic AI investments.", "published_at": "2025-08-12T12:30:00Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "bb6cc824-e65c-42fc-b556-f1c531dbc1ce", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/big-tech-is-driving-the-stock-market-to-new-records-200917939.html", "title": "Big Tech is driving the stock market to new records", "summary": "An AI-infused rally is once again sending the S&P 500 to record highs.", "published_at": "2025-08-12T20:09:17Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "0dde8130-a638-3773-83e3-f27fcae50a70", "ticker": "AAPL", "url": "https://www.fool.com/investing/2025/08/13/meet-the-monster-stock-that-continues-to-crush-the/", "title": "Meet the Monster Stock That Continues to Crush the Market", "summary": "The market is rebounding, but Dutch Bros is rebounding higher.", "published_at": "2025-08-13T08:30:00Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "c8695952-73a8-3e1e-8f8f-44520af44d46", "ticker": "AAPL", "url": "https://www.barrons.com/articles/kodak-bankruptcy-camera-film-ef6fbcb6?siteid=yhoof2&yptr=yahoo", "title": "Kodak’s Demise Holds a Lesson for the AI Age", "summary": "When digital cameras started to take off, camera and electronic companies were much better suited for this market. Camera phones sealed the deal.", "published_at": "2025-08-13T07:54:00Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "6baecd8f-5896-3a9d-bf24-554d3f51ec53", "ticker": "AAPL", "url": "https://www.barrons.com/articles/warren-buffett-berkshire-stock-buy-53fe63f5?siteid=yhoof2&yptr=yahoo", "title": "Don’t Fret About Warren Buffett. Berkshire Stock Is Still a Buy.", "summary": "It is understandable that many investors are struggling to imagine the financial world without Buffett. But it is silly to think he has failed to prepare his company for what comes next.", "published_at": "2025-08-13T05:30:00Z", "sentiment": "positive", "confidence": 0.9957}
{"id": "bb9d771a-b2e7-3151-8c3c-51e32253ecc5", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/wedbush-reaffirms-outperform-rating-apple-041343402.html", "title": "Wedbush Reaffirms ‘Outperform’ Rating on Apple Inc. (AAPL) with $270 PT", "summary": "Apple Inc. (NASDAQ:AAPL) is included in our list of the 14 Best Warren Buffett Stocks to Invest in. On August 7, 2025, Apple Inc. (NASDAQ:AAPL) announced an additional $100 billion investment, raising its total domestic commitment to $600 billion over the next four years. This move follows the company’s February pledge of $500 billion and […]", "published_at": "2025-08-13T04:13:43Z", "sentiment": "neutral", "confidence": 0.9995}
{"id": "1159019f-b691-347b-a75e-46fdafecf34a", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/australian-court-rules-apple-google-004912814.html", "title": "Australian Court Rules Apple, Google Broke Competition Rules", "summary": "Epic Games hails win as class actions move forward", "published_at": "2025-08-13T00:49:12Z", "sentiment": "negative", "confidence": 0.9959}
{"id": "fa61055c-ef38-3b2a-bb67-b324bf14e1a5", "ticker": "AAPL", "url": "https://www.wsj.com/tech/musk-takes-fight-with-openai-to-apple-over-its-app-store-a4bf5f24?siteid=yhoof2&yptr=yahoo", "title": "Musk Takes Fight With OpenAI to Apple Over Its App Store", "summary": "Elon Musk  said  Apple  is behaving anticompetitively by promoting OpenAI’s ChatGPT while suppressing his Grok AI chatbot in the App Store, renewing his criticism of the iPhone maker’s partnership with OpenAI.  Musk called Apple’s App Store rankings an “unequivocal antitrust violation” in a post on his social-media platform X on Monday night and threatened “immediate legal action.”  “Apple is behaving in a manner that makes it impossible for any AI company besides OpenAI to reach #1 in the App Store,” he said in the post.", "published_at": "2025-08-12T22:01:00Z", "sentiment": "positive", "confidence": 0.9742}
{"id": "42fecd92-3e8c-3781-87e9-feea81bccc30", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/3-companies-shattered-quarterly-records-204000429.html", "title": "These 3 Companies Shattered Quarterly Records", "summary": "In the Q2 cycle, several companies, including Apple, Eaton, and DoorDash, posted quarterly records in one way or another. Can the momentum sustain?", "published_at": "2025-08-12T20:40:00Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "2fb4581d-7690-367c-ade3-c3de192ac9d6", "ticker": "AAPL", "url": "https://www.investors.com/news/technology/life360-stock-surges-after-q2-outperformance/?src=A00220&yptr=yahoo", "title": "Family Safety Stock Life360 Surges As Parents Seek Peace Of Mind", "summary": "Life360 stock jumped Tuesday after the family-tracking service reported better-than-expected second-quarter results late Monday.", "published_at": "2025-08-12T20:10:26Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "73f526a4-543f-3805-9625-2afc2614b3cd", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/top-stock-picks-week-august-190900121.html", "title": "Top Stock Picks for Week of August 11, 2025", "summary": "A Tech Juggernaut That's a Steady Grower on Wall Street and a Gold Producer Benefitting From Rallying Gold Prices.", "published_at": "2025-08-12T19:09:00Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "4583a149-f494-38a9-82d6-7b8b9ca5f7c2", "ticker": "AAPL", "url": "https://finance.yahoo.com/video/apple-tesla-investor-reacts-musks-183432832.html", "title": "Apple, Tesla Investor Reacts to Musk's App Store Claims", "summary": "Laffer Tengler Investments CEO and CIO Nancy Tengler says she doesn't think Elon Musk's accusations that Apple is favoring OpenAI will \"end\" the App Store. She talks about her outlook on Apple, Tesla and chip stocks with Caroline Hyde and Ed Ludlow on \"Bloomberg Tech.\"", "published_at": "2025-08-12T18:34:32Z", "sentiment": "negative", "confidence": 1.0}
{"id": "5b3ca3c4-c88f-381f-b59b-fedf63263b48", "ticker": "AAPL", "url": "https://finance.yahoo.com/video/musk-says-apple-favoring-openai-182602830.html", "title": "Musk Says Apple Favoring OpenAI on iPhone", "summary": "Elon Musk, the founder of xAI, has accused Apple of favoring OpenAI on its App Store, and threatened legal action. Bloomberg's Kurt Wagner discusses this with Caroline Hyde and Ed Ludlow on \"Bloomberg Tech.\"", "published_at": "2025-08-12T18:26:02Z", "sentiment": "negative", "confidence": 0.9949}
{"id": "50fe3298-caa2-3a4b-9978-cc9824c2e434", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/microsoft-3-9-trillion-empire-182433615.html", "title": "Microsoft’s $3.9 Trillion Empire: 3 Products You Use Without Realizing It", "summary": "Here's a look at some of the ways you might be contributing to Microsoft's sprawling empire without even knowing it.", "published_at": "2025-08-12T18:24:33Z", "sentiment": "negative", "confidence": 1.0}
{"id": "cd04d108-fa48-37d4-851a-efff9715c22d", "ticker": "AAPL", "url": "https://decrypt.co/334795/elon-musk-takes-aim-at-apple-over-app-store-are-you-playing-politics", "title": "Elon Musk Takes Aim at Apple Over App Store: 'Are You Playing Politics?'", "summary": "The billionaire says Apple’s curated lists sideline Grok and X despite their top rankings in the App Store.", "published_at": "2025-08-12T17:00:12Z", "sentiment": "negative", "confidence": 0.9999}
{"id": "1b84d29c-e378-38c1-be93-a5ada1bf8634", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/pixel-10-ai-capabilities-everything-163320046.html", "title": "Pixel 10, AI capabilities, and everything else we expect out of the Made by Google 2025 event", "summary": "Dive into what we can expect from the Made by Google 2025 event, where the tech giant will debut its Pixel 10 lineup.", "published_at": "2025-08-12T16:33:20Z", "sentiment": "negative", "confidence": 1.0}
{"id": "ff58b32a-4304-396f-9c53-51cd3a609493", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/3-mutual-funds-buy-ongoing-162200565.html", "title": "3 Mutual Funds to Buy on the Ongoing Nasdaq Rally", "summary": "Nasdaq's record highs and AI-fueled tech boom spotlight three top mutual funds delivering strong multi-year returns.", "published_at": "2025-08-12T16:22:00Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "9c9cde8b-889b-31a0-8ca8-fb3d81b07f26", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/apple-rises-9-month-buy-162100847.html", "title": "Apple Rises 9% in a Month: Buy, Sell or Hold the AAPL Stock?", "summary": "AAPL's fiscal Q3 surge, fueled by Apple Intelligence growth and a $600B U.S. investment plan, offsets tariff headwinds.", "published_at": "2025-08-12T16:21:00Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "c39b1440-60f7-3766-8b8b-7cf836a912d0", "ticker": "AAPL", "url": "https://www.socialmediatoday.com/news/elon-accuses-apple-of-bias-in-app-store-rankings-legal-action/757501/", "title": "Elon Musk Threatens Legal Action Over Apple’s App Store Rankings", "summary": "Elon says that APple is deliberately restricting promotion of both X and xAI.", "published_at": "2025-08-12T16:01:24Z", "sentiment": "positive", "confidence": 0.987}
{"id": "330922a9-2471-3ad8-a7cf-43a27deb25c2", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/world-vibe-coding-startups-uno-160000608.html", "title": "In a world of vibe coding startups, Uno Platform is targeting enterprise developers", "summary": "And it's finding customers and investors, including $2.54 million in seed funding.", "published_at": "2025-08-12T16:00:00Z", "sentiment": "negative", "confidence": 1.0}
{"id": "f0c7328b-d2c0-37ca-99e2-6a6b718401b7", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/top-midday-stories-consumer-prices-153009021.html", "title": "Top Midday Stories: Consumer Prices Rise 2.7% YoY in July; Chinese Officials Urge Local Companies to Avoid Using Nvidia's H20 Chips", "summary": "All three major US stock indexes were up in late-morning trading Tuesday after a key inflation repor", "published_at": "2025-08-12T15:30:09Z", "sentiment": "neutral", "confidence": 0.8847}
{"id": "67059fb4-294b-3b30-bc40-d9654eab665e", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/spot-skyrockets-106-play-stock-151900736.html", "title": "SPOT Skyrockets 106% in a Year: How Should You Play the Stock?", "summary": "Spotify grapples with ad execution issues, fierce Apple and Amazon rivalry, high valuation, and a weak earnings outlook.", "published_at": "2025-08-12T15:19:00Z", "sentiment": "positive", "confidence": 1.0}
{"id": "ff00938e-6490-3e96-9ddb-aad41faf0067", "ticker": "AAPL", "url": "https://www.barrons.com/articles/trump-markets-stocks-gold-bitcoin-oil-46bccc8e?siteid=yhoof2&yptr=yahoo", "title": "Trump Drives Markets These Days. Economic Data Take a Back Seat.", "summary": "U.S. markets remained focused on Tuesday’s July inflation data, as investors track growing price pressures from tariffs into next month’s crucial Federal Reserve rate decision in Washington.  The same could be said for the domestic auto sector, which has found itself holding the short end of the global tariff stick following trade agreements with the U.K., Europe and Japan that effectively make it cheaper to build cars outside of North America and sell them in the U.S.", "published_at": "2025-08-12T14:23:00Z", "sentiment": "negative", "confidence": 0.9985}
{"id": "992dcd00-b44c-3c51-9ed0-0c0657766c87", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/apple-ai-problem-time-elon-140529635.html", "title": "Apple has a new AI problem—this time from Elon Musk, who’s threatening ‘legal action’ if it doesn’t knock ChatGPT off the top of its App Store", "summary": "Musk is threatening “legal action” if Apple doesn’t knock ChatGPT off the top of its App Store.", "published_at": "2025-08-12T14:05:29Z", "sentiment": "positive", "confidence": 0.9994}
{"id": "fd5af6c8-5762-3a73-a533-dddf3c3bc780", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/health-fitness-stocks-positioned-strong-133500083.html", "title": "Health & Fitness Stocks Positioned for Strong 2025 Growth", "summary": "PTON, SFM, STKL, and BODI are tapping into an $11T wellness market, boosted by tech, nutrition, and holistic health trends.", "published_at": "2025-08-12T13:35:00Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "f9e59fd1-09dd-3f54-8e42-aecdf72f8ade", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/nascar-legend-dale-earnhardts-widow-223113472.html", "title": "NASCAR Legend Dale Earnhardt's Widow Battles His Son Over $30 Billion Data Center Plan on His Former N.C. Land — 'Dad Would Be Livid'", "summary": "When Dale Earnhardt, the NASCAR champion known as \"The Intimidator,\" died in a crash during the 2001 Daytona 500, the sport lost more than a driver—it lost a symbol of grit, rural pride, and Southern determination. Away from the track, Earnhardt's ...", "published_at": "2025-08-11T22:31:13Z", "sentiment": "positive", "confidence": 0.9985}
{"id": "706d6910-7594-346f-90fe-5e98a5f1b1ae", "ticker": "AAPL", "url": "https://www.fool.com/investing/2025/08/08/heres-why-mp-materials-stock-surged-again-this-wee/", "title": "Here's Why MP Materials Stock Surged Again This Week", "summary": "Despite some near-term headwinds, the company's recently announced partnerships make it an exciting stock for long-term investors.", "published_at": "2025-08-08T11:28:24Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "39caaa6d-3d83-3467-b76f-4dee8b00a67b", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/analysis-trump-call-oust-intel-112322562.html", "title": "Analysis-Trump call to oust Intel CEO Tan could sidetrack chipmaker's turnaround", "summary": "(Reuters) -Intel CEO Lip-Bu Tan is already facing an uphill battle in turning around the ailing chipmaker.  Now, U.S. President Donald Trump's demand that Tan resign over his ties to Chinese firms will only distract him from that task, two investors and a former senior employee said.  Trump said on Thursday that Tan was \"highly conflicted\" due to his Chinese connections.", "published_at": "2025-08-08T11:23:22Z", "sentiment": "positive", "confidence": 0.9751}
{"id": "1152f182-0d1b-3666-9319-1b0ab2ef7559", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/softbank-buys-foxconns-ohio-plant-103055094.html", "title": "SoftBank buys Foxconn's Ohio plant to advance Stargate AI push, Bloomberg News reports", "summary": "U.S. President Donald Trump in January announced Stargate, a private sector investment of up to $500 billion for AI  infrastructure, funded by SoftBank, OpenAI and Oracle.  SoftBank, which has struggled to create a financial plan for Stargate, approached Foxconn to get the Apple supplier on board with its plan to build data centers and related infrastructure throughout the U.S., which led to the sale of the plant, the report said, citing people familiar with the matter.", "published_at": "2025-08-08T10:30:55Z", "sentiment": "negative", "confidence": 0.9997}
{"id": "3e1c604f-1853-38b9-a61e-23a912b1813e", "ticker": "AAPL", "url": "https://www.thedailyupside.com/technology/semiconductors/intels-ceo-lands-in-a-political-hot-seat-over-connections-with-china/", "title": "Intel’s CEO Lands in a Political Hot Seat Over Connections With China", "summary": "Chip industry veteran Lip-Bu Tan was supposed to fix the company’s problems. Now, Tan has become the company’s problem.", "published_at": "2025-08-08T10:30:00Z", "sentiment": "positive", "confidence": 0.9992}
{"id": "8ef7ab2f-9800-3b7f-8937-e44cc3650111", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/mp-materials-surges-smaller-loss-100436370.html", "title": "MP Materials hits record high after smaller loss, Pentagon and Apple boost", "summary": "Las Vegas-based MP operates the only U.S. rare earths mine and has seen its stock more than quadruple this year as Washington moves to secure domestic supplies and cut dependence on China.  Production of neodymium and praseodymium (NdPr), the most in-demand rare earths, jumped nearly 120% in the second quarter to a record 597 metric tons.  In the current quarter, NdPr oxide production is expected to rise 10% to 20% sequentially, Founder and Chief Operating Officer Michael Rosenthal said on a post-earnings call.", "published_at": "2025-08-08T10:04:36Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "ede59797-3dc1-341d-9d0a-d7bc951e4c4c", "ticker": "AAPL", "url": "https://sg.finance.yahoo.com/news/factbox-indian-textiles-jewellery-risk-095842601.html", "title": "Factbox-Indian textiles, jewellery at risk of 50% Trump tariffs; pharma, phones exempt", "summary": "NEW DELHI (Reuters) -U.S. President Donald Trump imposed an additional 25% tariff on goods imported from India this week, citing New Delhi's continued purchase of Russian oil.  The new import tax, effective 21 days after August 7, will raise duties on some Indian goods to as high as 50% - among the highest levied on any U.S. trading partner.  While some sectors like smartphones, pharmaceuticals and energy are currently exempt from any reciprocal tariffs, other items like gems and jewellery, textiles and some auto components, which make up a large part of Indian exports to the U.S., will take a hit.", "published_at": "2025-08-08T09:58:42Z", "sentiment": "negative", "confidence": 0.955}
{"id": "c5cced0b-1d9d-3487-b1ab-46a34cce775a", "ticker": "AAPL", "url": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp-500-nasdaq-08-08-2025/card/listen-behind-apple-s-decision-to-make-iphones-in-india-Ry9sQNv25Cj074E6tktw?siteid=yhoof2&yptr=yahoo", "title": "Listen: Behind Apple’s Decision to Make iPhones in India", "summary": "Apple Chief Executive Tim Cook kicked off a plan to manufacture iPhones in India years ago. It was one of a series of savvy moves, along with a newly announced $100 billion U.S. investment, that have helped the company avoid President Trump’s recent tariff threats.", "published_at": "2025-08-08T08:48:17Z", "sentiment": "neutral", "confidence": 0.9922}
{"id": "a054b0b2-cc45-3444-abb5-0002c00ee01f", "ticker": "AAPL", "url": "https://finance.yahoo.com/video/week-numbers-chips-drugs-donald-083556172.html", "title": "The Week in Numbers: chips, drugs and Donald Trump", "summary": "STORY: From a Trump tariff with a big get-out clause, to Apple’s bid to win favor in the White House, this is the Week in Numbers.GRAPHIC 100%100% is set to be the U.S. tariff on imported computer chips.But President Donald Trump included a big caveat in the move - it won’t apply to firms manufacturing in the U.S., or with firm plans to do so.“If you're building, there will be no charge. So I just want everyone to know that.”That appears to exempt companies like Taiwan giant TSMC.Trump also flagged coming duties on drugs, saying they could ultimately hit 250%.&nbsp;GRAPHIC $100 billion$100 billion is the extra U.S. investment pledged by Apple.The move could help the firm sidestep tariffs on imported iPhones.But analysts noted that Apple boss Tim Cook didn’t make any firm promise to shift production of the handsets:“The whole thing is just the final assembly that you're focused on and that will be elsewhere for a while.”GRAPHIC 16%16% was the cut to a profit outlook at Toyota.The world’s largest automaker says it expects the hit from tariffs to be near $10 billion.But the impact isn’t so worrying for all of Japan’s big exporters.Sony raised its profit outlook, saying the new duties weren’t as bad as feared.GRAPHIC 0.25%A quarter of a percentage point was the rate cut announced by Bank of England Governor Andrew Bailey:“Domestic price and wage pressures have generally continued to abate in recent months.”But policymakers had a hard time deciding, with two votes required for the first time ever.Hawks fear it’s no time for a cut, with inflation sticking stubbornly above the bank’s 2% target.GRAPHIC 55%And over 55% was the surge in shares for U.S. space startup Firefly Aerospace when it debuted on the Nasdaq.Traders snapped up shares in the first private firm to do a successful lunar landing.Analysts say it’s another sign of investor enthusiasm for companies aiding the expansion of U.S. space and defense programs.&nbsp;", "published_at": "2025-08-08T08:35:56Z", "sentiment": "negative", "confidence": 0.9996}
{"id": "79fdebc5-672b-3630-a64e-e4a765b6c947", "ticker": "AAPL", "url": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp-500-nasdaq-08-08-2025/card/heard-on-the-street-thursday-recap-apple-keeps-the-tariffs-away-BaRNbtp3vUynJVtgxQcx?siteid=yhoof2&yptr=yahoo", "title": "Heard on the Street Thursday Recap: Apple Keeps the Tariffs Away", "summary": "Apple stock rallied for a second day after President Trump said the iPhone maker and other companies that are investing in U.S. manufacturing could avoid 100% chip tariffs.  Apple's shares rose 3.2% on Thursday, adding more than $100 billion in market capitalization.  Trump's announcement raises many questions.", "published_at": "2025-08-08T07:38:00Z", "sentiment": "positive", "confidence": 0.9653}
{"id": "0abd4995-0f1d-3c27-b9e8-1784090b0ea6", "ticker": "AAPL", "url": "https://finance.yahoo.com/video/apple-ceo-gifts-trump-engraved-073016523.html", "title": "Apple CEO gifts Trump an engraved glass plaque mounted on 24-karat gold", "summary": "Apple CEO Tim Cook on Wednesday gifted President Trump with a plaque made of glass and 24-karat gold after the company announced another $100 billion investment in the U.S.", "published_at": "2025-08-08T07:30:16Z", "sentiment": "negative", "confidence": 1.0}
{"id": "b25c573a-c334-33a8-b695-86253bc265d2", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/tsmc-july-sales-grow-26-053741509.html", "title": "TSMC’s July Sales Grow 26% on Sustained Demand for AI Chips", "summary": "(Bloomberg) -- Taiwan Semiconductor Manufacturing Co. reported a 26% growth spurt in July, adding to evidence of accelerating spending on artificial intelligence.Most Read from BloombergAll Hail the Humble Speed HumpThree Deaths Reported as NYC Legionnaires’ Outbreak SpreadsMayor Asked to Explain $1.4 Billion of Wasted Johannesburg FundsMajor Istanbul Projects Are Stalling as City Leaders Sit in JailWhat England’s New National Cycling Network Needs to Get RollingThe go-to chipmaker for AI hardwa", "published_at": "2025-08-08T05:37:41Z", "sentiment": "positive", "confidence": 0.9931}
{"id": "3704385a-d539-3e73-a62b-311616064445", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/tim-cook-gifts-trump-24-023106575.html", "title": "Tim Cook Gifts Trump 24-Karat Gold-Based Plaque After Winning Exemption From 100% Chip Tariff", "summary": "Apple CEO Tim Cook on Wednesday presented President Donald Trump with a one-of-a-kind, U.S.-made glass plaque and walked away with an assurance that Apple's expanding \"American Manufacturing Program\" will spare the company from a looming 100% tariff on imported semiconductors and chips. What Happened: Cook handed Trump a circular slab of Corning Gorilla Glass etched with the presidential seal and Cook's signature, mounted on a 24-karat-gold base fabricated in Utah. \"It is a unique unit of one,\"", "published_at": "2025-08-08T02:31:06Z", "sentiment": "neutral", "confidence": 0.7227}
{"id": "2c7065e9-062c-319a-bf92-2a35945e2530", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/tsmc-secrets-leak-puts-japan-012345343.html", "title": "TSMC Secrets Leak Puts Japan’s Tokyo Electron on Hot Seat", "summary": "(Bloomberg) -- A Taiwanese investigation into the possible theft of chip technology at Taiwan Semiconductor Manufacturing Co. is putting a low-profile, lesser-known tech linchpin in Japan under unusual scrutiny. Most Read from BloombergAll Hail the Humble Speed HumpThree Deaths Reported as NYC Legionnaires’ Outbreak SpreadsMayor Asked to Explain $1.4 Billion of Wasted Johannesburg FundsMajor Istanbul Projects Are Stalling as City Leaders Sit in JailWhat England’s New National Cycling Network Nee", "published_at": "2025-08-08T01:23:45Z", "sentiment": "positive", "confidence": 0.9999}
{"id": "f463169b-7e15-3124-b3a3-1554b2b8abf3", "ticker": "AAPL", "url": "https://www.wsj.com/tech/apple-iphones-india-trump-tariffs-789c7209?siteid=yhoof2&yptr=yahoo", "title": "Apple Got the Jump on Tariffs, Deciding Years Ago to Make iPhones in India", "summary": "CEO Tim Cook sought new factory locales outside China, a prescient move that along with a new $100 billion U.S. investment will shield the company—for now.", "published_at": "2025-08-08T01:00:00Z", "sentiment": "positive", "confidence": 0.7894}
{"id": "0dab5146-0152-33be-8877-73d44a9651f3", "ticker": "AAPL", "url": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp500-nasdaq-tariff-deadline-08-07-2025/card/podcast-nasdaq-hits-another-high-SfhEIfxotxtxFAYiaNpD?siteid=yhoof2&yptr=yahoo", "title": "Podcast: Nasdaq Hits Another High", "summary": "The Nasdaq composite hit a record high for the 17th time this year, ending up around 0.4%. Other U.S. stock indexes finished mixed as new tariffs took effect. Shares of Apple gained after the company announced an extra $100 billion investment in U.", "published_at": "2025-08-07T23:06:04Z", "sentiment": "neutral", "confidence": 0.9919}
{"id": "308b91c4-efac-324b-b308-2a0873a532f3", "ticker": "AAPL", "url": "https://www.thestreet.com/technology/veteran-analyst-drops-6-word-verdict-on-apples-100-billion-investment", "title": "Veteran analyst drops 6-word verdict on Apple’s $100 billion investment", "summary": "Wedbush’s Dan Ives weighs in on Apple’s massive U.S. play, hinting that its timing may not be accidental.", "published_at": "2025-08-07T23:00:00Z", "sentiment": "negative", "confidence": 0.9043}
{"id": "97b258b6-0fc8-34d8-9e2f-0e99428eecf7", "ticker": "AAPL", "url": "https://www.businessinsider.com/experts-think-big-techs-spending-offset-impact-tariffs-amzn-msft-2025-8", "title": "Big Tech's colossal capex spending could be offsetting the impact of tariffs", "summary": "While President Donald Trump's tariffs continue to spark economic uncertainty, some exerts think big tech's spending could help ease the impact.", "published_at": "2025-08-07T22:34:50Z", "sentiment": "positive", "confidence": 0.7572}
{"id": "21b64f66-dc78-310f-a57b-6ec18d1f0d4d", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/apples-100-billion-us-spend-221922908.html", "title": "Apple's $100 Billion US Spend Targets Tariff Exemption", "summary": "Expanded U.S. investment could undercut 100% chip tariffs", "published_at": "2025-08-07T22:19:22Z", "sentiment": "negative", "confidence": 0.9591}
{"id": "b6182d58-849b-38bc-9bee-c44c3e12a7ec", "ticker": "AAPL", "url": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp500-nasdaq-tariff-deadline-08-07-2025/card/heard-on-the-street-recap-apple-keeps-the-tariffs-away-olgUK6jBAUXekIwamPxr?siteid=yhoof2&yptr=yahoo", "title": "Heard on the Street Recap: Apple Keeps the Tariffs Away", "summary": "President Trump said there would be a 100% tariff on imported semiconductors, with exceptions.  Companies such as Apple that are investing in U.S. manufacturing would be exempt from the levies, he said at a White House event with Apple CEO Tim Cook.  Apple's stock rose 3.2%—adding more than $100 billion in market cap.", "published_at": "2025-08-07T22:00:02Z", "sentiment": "neutral", "confidence": 0.9856}
{"id": "7e5082a7-644a-3efb-91db-7c76102c7330", "ticker": "AAPL", "url": "https://finance.yahoo.com/video/tech-rally-apple-breakout-crypto-220000144.html", "title": "Tech rally, Apple breakout, crypto & 401(k)s: Market takeaways", "summary": "Yahoo Finance Markets and Data Editor Jared Blikre goes over the top takeaways from the trading day: the tech sector rally, Apple's (AAPL) key technical breakout, and what a potential Trump executive order could mean for crypto and private equity access in 401(k)s. To watch more expert insights and analysis on the latest market action, check out more&nbsp;Asking for a Trend.", "published_at": "2025-08-07T22:00:00Z", "sentiment": "negative", "confidence": 0.9931}
{"id": "56cbf7d3-b968-3f3c-b283-1972143a1e15", "ticker": "AAPL", "url": "https://www.investors.com/news/technology/chip-stocks-intel-stock-trump-tariff-comments/?src=A00220&yptr=yahoo", "title": "President Trump Rocks Chip Stocks With Tariff Talk, Intel Comments", "summary": "Chip stocks jumped on Thursday after President Donald Trump eased his rhetoric on semiconductor tariffs. But Intel stock fell.", "published_at": "2025-08-07T21:48:05Z", "sentiment": "negative", "confidence": 0.9063}
{"id": "f7e3c04a-69bf-3bdc-8587-18595b89d2bf", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/jamf-nasdaq-jamf-q2-sales-213854563.html", "title": "Jamf’s (NASDAQ:JAMF) Q2 Sales Beat Estimates, Stock Soars", "summary": "Apple device management company, Jamf (NASDAQ:JAMF) reported revenue ahead of Wall Street’s expectations in Q2 CY2025, with sales up 15.3% year on year to $176.5 million. Guidance for next quarter’s revenue was better than expected at $177 million at the midpoint, 0.7% above analysts’ estimates. Its non-GAAP profit of $0.18 per share was in line with analysts’ consensus estimates.", "published_at": "2025-08-07T21:38:54Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "5ce018e6-751a-36ce-b35f-a7e65da691cf", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/markets-rise-trump-chip-exemptions-025739234.html", "title": "Mixed day for global stocks as latest Trump levies take effect", "summary": "Global stocks had a mixed session Thursday as US President Donald Trump's new tariffs on dozens of countries took effect, with investors eyeing exemptions from his threatened 100-percent levy on semiconductors.Taiwanese chip-making giant TSMC climbed five percent as Taipei said it would be exempt from Trump's threatened levies on the sector.", "published_at": "2025-08-07T21:29:38Z", "sentiment": "negative", "confidence": 0.9895}
{"id": "5914365a-3676-39c9-b464-288dad7f59f8", "ticker": "AAPL", "url": "https://ca.finance.yahoo.com/news/lawsuit-accuses-apple-stealing-trade-212644936.html", "title": "Lawsuit accuses Apple of stealing trade secrets to create Apple Pay", "summary": "(Reuters) -Apple has been sued by a Texas company that accused the iPhone maker of stealing its technology to create its lucrative mobile wallet Apple Pay.  In a complaint made public on Thursday, Fintiv said Apple Pay's key features were based on technology developed by CorFire, which Fintiv bought in 2014, and now used in hundreds of millions of iPhones, iPads, Apple Watches and MacBooks.  Apple did not immediately respond to requests for comment.", "published_at": "2025-08-07T21:26:44Z", "sentiment": "positive", "confidence": 0.9686}
{"id": "ab1351dd-4160-3554-bbfb-e4878516d448", "ticker": "AAPL", "url": "https://www.investopedia.com/s-and-p-500-gains-and-losses-today-apple-stock-climbs-eli-lilly-slumps-after-disappointing-trial-results-11787193", "title": "S&P 500 Gains and Losses Today: Apple Stock Climbs; Eli Lilly Slumps After Disappointing Trial Results", "summary": "The S&P 500 slid 0.1% on Thursday, Aug. 7, 2025, as new tariffs took effect, raising import duties on goods from numerous U.S. trading partners.", "published_at": "2025-08-07T21:23:09Z", "sentiment": "positive", "confidence": 0.9993}
{"id": "89f698dd-3cd7-3a8e-9f69-f33bf5f0be8a", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/wall-street-wavers-tariffs-effect-210656504.html", "title": "Wall Street Wavers as Tariffs Take Effect, Earnings Cycle Continues", "summary": "Equities closed mixed Thursday as President Donald Trump's new tariffs took effect, while traders pa", "published_at": "2025-08-07T21:06:56Z", "sentiment": "negative", "confidence": 0.9902}
{"id": "2e56c471-11be-384b-ba8d-465ea04e44b9", "ticker": "AAPL", "url": "https://www.foxbusiness.com/markets/trumps-tariff-threat-puts-semiconductors-display", "title": "Trump’s tariff threat puts semiconductors on display", "summary": "Chip stocks, including Nvidia and AMD, were among the most actively traded actively as Nasdaq flirts with 17th record close of 2025 as Trump eyes chip tariffs.", "published_at": "2025-08-07T21:04:51Z", "sentiment": "negative", "confidence": 0.9237}
{"id": "bf274584-b3f5-3be3-b370-a8aae817f8d6", "ticker": "AAPL", "url": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp500-nasdaq-tariff-deadline-08-07-2025/card/apple-is-still-haunted-by-tariff-uncertainty-heard-on-the-street-7zUYtWcTvYPGR140I2wy?siteid=yhoof2&yptr=yahoo", "title": "Apple Is Still Haunted by Tariff Uncertainty—Heard on the Street", "summary": "Apple seems to have bought its way out of trouble with President Trump.  Apple’s stock price has jumped more than 8% over the last two days, a period that included the company winning a major exemption on the 100% chip tariffs that Trump announced on Wednesday.  Apple’s stock is now at its highest level since Trump first announced his ambitious “Liberation Day” tariff plans in early April.", "published_at": "2025-08-07T20:53:45Z", "sentiment": "neutral", "confidence": 0.9935}
{"id": "98af3690-5c76-3c2e-8678-50fb476904a3", "ticker": "AAPL", "url": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp500-nasdaq-tariff-deadline-08-07-2025/card/stocks-to-watch-thursday-apple-corning-duolingo-8LtWkIgyFBZ8Jj2No45V?siteid=yhoof2&yptr=yahoo", "title": "Stocks to Watch Recap: Eli Lilly, Firefly, DoorDash, TSMC", "summary": "↗️ Apple (AAPL): The iPhone maker's shares rallied for a second day. Trump said companies could avoid 100% chip tariffs by investing in U.S. manufacturing. Apple unveiled an extra $100 billion commitment.", "published_at": "2025-08-07T20:40:30Z", "sentiment": "neutral", "confidence": 0.9059}
{"id": "3c8f0a87-8466-381e-9293-934464544f79", "ticker": "AAPL", "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-sp500-nasdaq-trump-tariff-news-eli-lilly-stock/?src=A00220&yptr=yahoo", "title": "Stock Market Today: Dow Swings To Drop 224 Points; Nasdaq Ekes A Out A Gain", "summary": "The Dow Jones Industrial Average and other major indexes closed mixed Thursday following a strong start for the session.  Investors appeared unimpressed by President Donald Trump's chip tariff plan while broader U.S. import levies went into effect.  The Dow Jones average fared the worst of the major indexes with its 0.5% drop, or loss of 224 points, despite a 3.2% gain for Apple.", "published_at": "2025-08-07T20:39:40Z", "sentiment": "positive", "confidence": 0.9993}
{"id": "d6955bb7-be7a-3302-b320-99bfcbfc0d59", "ticker": "AAPL", "url": "https://www.wsj.com/finance/stocks/dow-falters-after-new-tariffs-kick-in-ed86f150?siteid=yhoof2&yptr=yahoo", "title": "Dow Falters After New Tariffs Kick In", "summary": "The Dow Jones Industrial Average slipped Thursday after President Trump’s sweeping levies kicked in on imports from dozens of countries just after midnight.  The Dow industrials decline came as U.S. trading partners around the world were lobbying the White House for exemptions to the new tariffs.  Negotiators are still hoping to secure carve-outs for key exports, as well as lower overall tariff rates.", "published_at": "2025-08-07T20:35:00Z", "sentiment": "positive", "confidence": 0.9999}
{"id": "a5edc3d9-68fb-3bcf-a100-12c00e1539c5", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/next-trillion-dollar-stocks-world-205909881.html", "title": "The next trillion-dollar stocks: What are the world’s next largest companies?", "summary": "Here are some of the best candidates to become a trillion-dollar stock.", "published_at": "2025-08-07T20:29:57Z", "sentiment": "neutral", "confidence": 0.9626}
{"id": "4412814c-fd61-3431-8127-673442ffee1e", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/apple-dismisses-elon-musk-claims-131346429.html", "title": "Apple dismisses Elon Musk’s claims that App Store favors OpenAI over other AI apps", "summary": "The response comes after Musk threatened to sue Apple via xAI, claiming the iPhone maker was “behaving in a manner that makes it impossible for any AI company besides OpenAI to reach #1 in the App Store.”", "published_at": "2025-08-13T13:13:46Z", "sentiment": "positive", "confidence": 0.5403}
{"id": "816515a8-cb2d-3767-815c-37620381ba24", "ticker": "AAPL", "url": "https://www.fool.com/investing/2025/08/13/nvidia-and-microsoft-stocks-have-reached-a-4-trill/", "title": "Nvidia and Microsoft Stocks Have Reached a $4 Trillion Valuation. Is Apple Next?", "summary": "Is Apple Falling behind, or will it come from behind?", "published_at": "2025-08-13T12:30:00Z", "sentiment": "negative", "confidence": 0.9899}
{"id": "dfe0da1b-3032-32f7-a9bd-8770f557425b", "ticker": "AAPL", "url": "https://www.investors.com/news/technology/google-stock-wall-street-awaits-judges-ruling-on-remedies-in-search-antitrust-case/?src=A00220&yptr=yahoo", "title": "Google Stock: Wall Street Awaits Judge's Ruling On Remedies In Search Antitrust Case", "summary": "A federal judge's expected ruling in the Alphabet internet search antitrust case has been an overhang on Google stock.", "published_at": "2025-08-13T12:00:45Z", "sentiment": "positive", "confidence": 1.0}
{"id": "d6fcff3c-95fe-3f3b-9ec5-6f6cd51072ae", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/why-finally-left-spotify-120000026.html", "title": "Why I finally left Spotify", "summary": "Spotify's dependence on algorithmic recommendations has gotten too suffocating.", "published_at": "2025-08-13T12:00:00Z", "sentiment": "positive", "confidence": 0.899}
{"id": "52fcdaae-e9ae-39fc-83f5-ead5fb228227", "ticker": "AAPL", "url": "https://ca.finance.yahoo.com/news/ge-appliances-invest-over-3-110435095.html", "title": "GE Appliances to invest over $3 billion in US manufacturing push", "summary": "Global firms have been increasing their investments and presence in the United States after President Donald Trump pushed companies across sectors, including Apple and Ford, to produce goods within the country and generate jobs.  The GE Appliances investment will create 1,000 jobs in five states and is aimed at expanding the company's air conditioning and water heating portfolio, increasing production output and modernizing its 11 U.S. manufacturing plants with new automation and capital equipment, the home appliances maker said.  Earlier this year, peer Carrier Global also said it planned to invest $1 billion over five years in the U.S.", "published_at": "2025-08-13T11:04:35Z", "sentiment": "neutral", "confidence": 0.9834}
{"id": "ede8a4c8-8f3e-3723-98c3-e3edfc23eb64", "ticker": "AAPL", "url": "https://finance.yahoo.com/video/ai-weekly-nvidias-future-china-104918573.html", "title": "AI Weekly: Nvidia's future in China and $1 AI offers", "summary": "STORY: From what next for Nvidia sales in China to $1 AI offers, this is AI Weekly.&nbsp;U.S. President Donald Trump on Monday suggested he might allow sales of Nvidia’s next-gen AI chips in China.&nbsp;That’s despite deep-seated fears that China could harness U.S. AI capabilities for its military.&nbsp;Trump said the chips, if sold, would be a scaled-down version.Staying with Washington, firm Anthropic has offered AI chatbot Claude to the U.S. government for $1.&nbsp;The Amazon-backed company joins a growing list of startups proposing lucrative deals to win federal contracts.&nbsp;ChatGPT-owner OpenAI made a similar offer last week of $1 per federal agency for the next year.Elon Musk announced on Monday his AI startup xAI would take legal action against Apple.&nbsp;He accused the iPhone maker of breaching antitrust regulations in managing App Store rankings…Claiming the tech giant has made it impossible for any AI company besides OpenAI to reach #1 in the App Store.Perplexity AI made a $34.5 billion all-cash offer for Alphabet's Chrome browser on Tuesday.The bid, which was unsolicited, is far above its own valuation.The startup is reaching for the browser's billions of users pivotal to the AI search race.And Getty Images has filed a landmark lawsuit against Stability AI in London.&nbsp;Getty’s accused the AI company of using its images without permission to “train” its system Stable Diffusion.&nbsp;Stability denies infringing Getty’s rights. &nbsp;Lawyers say this case will have a major impact on AI copyright law.", "published_at": "2025-08-13T10:49:18Z", "sentiment": "negative", "confidence": 0.9998}
{"id": "6ff19867-84ac-367f-bed9-07ddcb1e19db", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/aapl-q2-deep-dive-ai-024546679.html", "title": "AAPL Q2 Deep Dive: AI Investments, Tariff Pressures, and Product Upgrade Records", "summary": "iPhone and iPad maker Apple (NASDAQ:AAPL) beat Wall Street’s revenue expectations in Q2 CY2025, with sales up 9.6% year on year to $94.04 billion. Its non-GAAP profit of $1.57 per share was 10.1% above analysts’ consensus estimates.", "published_at": "2025-08-13T02:45:46Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "f0bd9360-9167-3515-8010-48dc13ff7525", "ticker": "AAPL", "url": "https://finance.yahoo.com/news/5-revealing-analyst-questions-apple-024545686.html", "title": "5 Revealing Analyst Questions From Apple’s Q2 Earnings Call", "summary": "Apple’s second quarter results exceeded Wall Street’s expectations for both revenue and non-GAAP profit, yet the market reacted negatively. Management attributed the quarter’s performance to strong global demand for iPhone 16, Mac upgrades, and double-digit Services growth. CEO Tim Cook emphasized that “growth accelerated in the vast majority of markets we track,” driven by robust upgraders in key products. However, management cited higher tariff-related costs and noted that a portion of demand", "published_at": "2025-08-13T02:45:45Z", "sentiment": "neutral", "confidence": 1.0}
