{"id": "07862483-c982-36ee-a2b3-06bdbd51baab", "ticker": "JPM", "url": "https://finance.yahoo.com/news/us-consumers-bear-brunt-tariff-073627510.html", "title": "US Consumers to Bear Brunt of Tariff Hit, Goldman Economists Say", "summary": "(Bloomberg) -- The impact of President Donald Trump’s tariffs on consumer prices is just getting started, according to research by Goldman Sachs Group Inc., adding more uncertainty to a Treasury market that has been gripped by shifting bets on the pace of interest rate cuts.Most Read from BloombergSunseeking Germans Face Swiss Backlash Over Alpine Holiday CongestionNew York Warns of $34 Billion Budget Hole, Biggest Since 2009 CrisisThree Deaths Reported as NYC Legionnaires’ Outbreak SpreadsA New", "published_at": "2025-08-11T07:36:27Z", "sentiment": "positive", "confidence": 0.9889}
{"id": "809faaff-fd05-378e-b136-4fc31e3d49dd", "ticker": "JPM", "url": "https://finance.yahoo.com/news/unprecedented-shift-unemployment-suggests-ai-203654500.html", "title": "This unprecedented shift in unemployment suggests AI could strand white-collar knowledge workers in a jobless recovery after the next recession", "summary": "\"A much larger unemployment risk and anemic recovery prospects for these workers might cause the next labor market downturn to look pretty dismal.\"", "published_at": "2025-08-10T20:36:54Z", "sentiment": "positive", "confidence": 1.0}
{"id": "2a8df05d-01b6-37e6-88f9-f0bc4fd2befa", "ticker": "JPM", "url": "https://finance.yahoo.com/news/life-balance-hardcore-culture-experts-153118365.html", "title": "Work-Life Balance Is Out, Hardcore Culture Is In: How Experts Suggest You Adjust To The New Era Of Work", "summary": "For many, the era of work-life balance is coming to a close. “The spillover from home life to work life is not of concern to bosses these days,” Yale management professor Jeffrey Sonnenfeld told Business Insider recently. \"It’s not the time to talk about what makes your creature comforts so different from everybody else’s, that somehow the company has to accommodate your needs.” Within the last year, major companies like Amazon (NASDAQ:AMZN) and JPMorgan Chase (NYSE:JPM) enacted return-to-office", "published_at": "2025-08-10T15:31:18Z", "sentiment": "negative", "confidence": 0.9954}
{"id": "a4afa6d3-086d-338f-8f15-78ca04737ab4", "ticker": "JPM", "url": "https://finance.yahoo.com/news/jamie-dimon-now-says-hes-123103096.html", "title": "Jamie Dimon Now Says He's A 'Believer in Stablecoin'—And JPMorgan Chase's New Partnership Could Change Everything", "summary": "The man who once called Bitcoin a “fraud” just became crypto’s unlikely ally. JPMorgan Chase (NYSE:JPM) CEO Jamie Dimon, Wall Street’s most vocal crypto skeptic for nearly a decade, delivered a stunning reversal that’s sending shockwaves through both ...", "published_at": "2025-08-10T12:31:03Z", "sentiment": "neutral", "confidence": 0.867}
{"id": "9a01d2c0-2aed-3c1c-b2f0-267604511d26", "ticker": "JPM", "url": "https://finance.yahoo.com/news/carry-traders-ramp-bets-emerging-123000212.html", "title": "Carry Traders Ramp Up Bets in Emerging Markets as Fed Cuts Loom", "summary": "(Bloomberg) -- The carry trade is making a comeback among emerging market investors amid bets the Federal Reserve will kick off interest-rate cuts next month, weakening the dollar and fueling appetite for high-yielding currencies.Most Read from BloombergSunseeking Germans Face Swiss Backlash Over Alpine Holiday CongestionNew York Warns of $34 Billion Budget Hole, Biggest Since 2009 CrisisThree Deaths Reported as NYC Legionnaires’ Outbreak SpreadsA New Stage for the Theater That Gave America Shak", "published_at": "2025-08-10T12:30:00Z", "sentiment": "positive", "confidence": 0.9845}
{"id": "bebaf14a-f0f2-37fa-96ad-f69c2d7e1a99", "ticker": "JPM", "url": "https://finance.yahoo.com/news/everything-expensive-nowhere-hide-credit-174322190.html", "title": "Everything’s Expensive. There’s Nowhere to Hide: Credit Weekly", "summary": "(Bloomberg) -- Credit market bargain shoppers are having the hardest time finding deals in at least a generation.Most Read from BloombergNew York Warns of $34 Billion Budget Hole, Biggest Since 2009 CrisisSunseeking Germans Face Swiss Backlash Over Alpine Holiday CongestionThree Deaths Reported as NYC Legionnaires’ Outbreak SpreadsA New Stage for the Theater That Gave America Shakespeare in the ParkChicago Schools’ Bond Penalty Widens as $734 Million Gap LoomsA relentless rally has left valuatio", "published_at": "2025-08-09T17:43:22Z", "sentiment": "positive", "confidence": 0.8796}
{"id": "79294afa-183e-3516-a4c2-16d8fb4ac641", "ticker": "JPM", "url": "https://finance.yahoo.com/news/global-market-based-gold-bars-133000889.html", "title": "A Global Market Based on Gold Bars Shudders on Tariff Threat", "summary": "(Bloomberg) -- The global gold market relies on a network of banks, refineries and couriers that can fly bullion between key trading hubs at a moment’s notice in pursuit of the highest prices. On Friday, a shock US ruling suggesting that the metal would be subject to tariffs plunged that system into chaos.Most Read from BloombergNew York Warns of $34 Billion Budget Hole, Biggest Since 2009 CrisisSunseeking Germans Face Swiss Backlash Over Alpine Holiday CongestionThree Deaths Reported as NYC Leg", "published_at": "2025-08-09T13:30:00Z", "sentiment": "negative", "confidence": 0.6874}
{"id": "2774cbd1-61c0-3fc2-b51b-7b3bf675f1be", "ticker": "JPM", "url": "https://finance.yahoo.com/news/top-stock-reports-jpmorgan-chase-203800176.html", "title": "Top Stock Reports for JPMorgan Chase, Chevron & Shopify", "summary": "JPMorgan Chase posts 43.9% annual gain, fueled by loan demand and high rates, but faces expense growth and asset quality concerns.", "published_at": "2025-08-08T20:38:00Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "b90198dc-4f6b-35db-8d31-1d08b8c8109a", "ticker": "JPM", "url": "https://finance.yahoo.com/news/us-adds-surprise-gold-bar-045737320.html", "title": "Gold Hit By Surprise US Tariffs, Unleashing New Turmoil", "summary": "(Bloomberg) -- A Trump administration ruling that gold bars will be subject to tariffs stunned traders who had assumed they would be exempted, throwing bullion markets into turmoil.Most Read from BloombergAll Hail the Humble Speed HumpThree Deaths Reported as NYC Legionnaires’ Outbreak SpreadsMayor Asked to Explain $1.4 Billion of Wasted Johannesburg FundsNew York Warns of $34 Billion Budget Hole, Biggest Since 2009 CrisisChicago Schools’ Bond Penalty Widens as $734 Million Gap LoomsFutures in N", "published_at": "2025-08-08T18:18:43Z", "sentiment": "positive", "confidence": 0.96}
{"id": "f16b7dfe-72d1-4f73-a65a-dd25f10dc9f9", "ticker": "JPM", "url": "https://finance.yahoo.com/news/trump-administration-says-fannie-and-freddie-will-go-public-by-end-of-year-and-raise-30-billion-172847162.html", "title": "Trump administration says Fannie and Freddie will go public by end of year and raise $30 billion", "summary": "The Trump administration is looking to sell its stakes in mortgage giants Fannie Mae and Freddie Mac in a public offering that it believes could raise $30 billion and begin later this year.", "published_at": "2025-08-08T17:28:47Z", "sentiment": "negative", "confidence": 1.0}
{"id": "b8c843c5-293c-3082-9a1b-57520ac262d7", "ticker": "JPM", "url": "https://finance.yahoo.com/news/bank-americas-slow-start-2025-130900227.html", "title": "Is Bank of America's Slow Start in 2025 an Opportunity for Investors?", "summary": "BAC's slow 2025 start contrasts with peers. Will branch expansion, tech upgrades and a $40B buyback boost long-term appeal? Let's find out.", "published_at": "2025-08-08T13:09:00Z", "sentiment": "neutral", "confidence": 0.9999}
{"id": "900a3e9d-2027-3217-995b-57c2b109b76a", "ticker": "JPM", "url": "https://www.barchart.com/story/news/33998927/is-wall-street-bullish-or-bearish-on-constellation-energy-stock", "title": "Is Wall Street Bullish or Bearish on Constellation Energy Stock?", "summary": "Constellation Energy has outperformed the broader market over the past year, and analysts are moderately optimistic about the stock’s prospects.", "published_at": "2025-08-08T12:49:47Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "c5569ad4-32b0-3be6-abd9-1b1d22530f37", "ticker": "JPM", "url": "https://www.wsj.com/finance/banking/jpmorgan-bus-tour-jamie-dimon-a7887112?siteid=yhoof2&yptr=yahoo", "title": "Jamie Dimon Took a Bus Tour Down South. We Rode Along.", "summary": "Top executives at JPMorgan Chase traveled through states including Mississippi and Alabama, where the bank is expanding its reach.", "published_at": "2025-08-08T09:30:00Z", "sentiment": "negative", "confidence": 0.9999}
{"id": "fd0f6196-459c-3d1d-8916-0fb1d102fd56", "ticker": "JPM", "url": "https://finance.yahoo.com/news/jpmorgan-chase-jpm-coinbase-announce-034821887.html", "title": "JPMorgan Chase (JPM) and Coinbase Announce a Strategic Partnership", "summary": "JPMorgan Chase & Co. (NYSE:JPM) is one of the Most Undervalued Long Term Stocks to Buy According to Hedge Funds. On July 30, JPMorgan Chase & Co. (NYSE:JPM) and Coinbase announced a strategic partnership, setting a new standard for customer choice as well as security in the innovation economy. Through JPMorgan’s secure API, Chase customers can […]", "published_at": "2025-08-08T03:48:21Z", "sentiment": "neutral", "confidence": 0.9998}
{"id": "db61744e-e3dc-4dd2-a107-5a190d97aebe", "ticker": "JPM", "url": "https://finance.yahoo.com/news/trump-signs-executive-order-putting-pressure-on-big-banks-over-politicized-debanking-190116030.html", "title": "Trump signs executive order putting pressure on big banks over 'politicized debanking'", "summary": "President Trump signed an executive order that ups his administration’s scrutiny over whether big banks denied services to consumers and businesses based on their political affiliations.", "published_at": "2025-08-07T19:01:16Z", "sentiment": "positive", "confidence": 0.9219}
{"id": "fb706563-2008-3344-9d7b-b3b26ff49151", "ticker": "JPM", "url": "https://ca.finance.yahoo.com/news/exclusive-jpmorgan-denied-closed-account-164842451.html", "title": "Exclusive-JPMorgan denied it closed account linked to former Kansas governor on religious grounds, letter shows", "summary": "NEW YORK (Reuters) -JPMorgan Chase denied it closed an account linked to former Kansas Governor Sam Brownback on religious grounds, and did not receive information it requested from him before shutting the account, according to a letter seen by Reuters.  Brownback, a Republican who chairs the National Committee for Religious Freedom, claims the bank canceled the group's new account on religious grounds in 2022.  President Donald Trump has accused the nation's biggest lenders of discriminating against him and his conservative supporters by denying them banking services, a practice known as \"debanking.\"", "published_at": "2025-08-07T16:48:42Z", "sentiment": "negative", "confidence": 0.5587}
{"id": "a256134d-6f18-333d-a5ad-c4ea8617036a", "ticker": "JPM", "url": "https://www.barchart.com/story/news/33964646/mastercard-stock-analyst-estimates-ratings", "title": "Mastercard Stock: Analyst Estimates & Ratings", "summary": "Mastercard has outperformed the broader market over the past year, and analysts are highly optimistic about the stock’s prospects.", "published_at": "2025-08-07T14:23:25Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "af382010-a760-3bee-9a30-a967a1350380", "ticker": "JPM", "url": "https://www.coindesk.com/markets/2025/08/07/decentralized-finance-and-tokenization-growth-still-disappoints-jpmorgan", "title": "Decentralized Finance and Tokenization Growth Still Disappoints: JPMorgan", "summary": "Total value locked (TVL) in DeFi remains below 2021 highs, the report noted.", "published_at": "2025-08-07T12:46:11Z", "sentiment": "positive", "confidence": 1.0}
{"id": "a26f9211-9e21-340a-a1ae-617edc682fe4", "ticker": "JPM", "url": "https://finance.yahoo.com/news/exclusive-angola-gets-back-200-104209414.html", "title": "Exclusive-Angola gets back $200 million collateral from JPMorgan after bond rebound", "summary": "LUANDA (Reuters) -Angola got back $200 million of collateral in May that it had to post to JPMorgan earlier in the year, the finance ministry said, after the price of its bond rebounded, easing pressure on its finances.  JPMorgan and Angola agreed in December a $1 billion, one-year derivative contract known as a total return swap backed by $1.9 billion in its government dollar bonds.  In early April, JPMorgan demanded extra security from the Southern African crude oil exporter after a sharp oil price decline in the wake of tariff turmoil hit the value of Angolan bonds provided as collateral.", "published_at": "2025-08-07T10:42:09Z", "sentiment": "positive", "confidence": 0.5675}
{"id": "83357bf6-fe23-33e6-a227-4d835a734504", "ticker": "JPM", "url": "https://finance.yahoo.com/news/jpmorgan-coinbase-tie-bring-crypto-124100816.html", "title": "Will JPMorgan-Coinbase Tie-Up Bring Crypto Closer to Mainstream?", "summary": "JPM partners with COIN to enable direct crypto access, stablecoin rewards and tokenized banking. This marks a major step toward mainstream adoption of crypto.", "published_at": "2025-08-06T12:41:00Z", "sentiment": "neutral", "confidence": 0.8855}
{"id": "a4cf4c45-5106-3276-962f-2731d8234650", "ticker": "JPM", "url": "https://finance.yahoo.com/news/jpmorgan-carters-highlighted-zacks-bull-123100515.html", "title": "JPMorgan and Carter's have been highlighted as Zacks Bull and Bear of the Day", "summary": "JPM earns Bull of the Day with solid earnings and NII strength, while CRI faces steep declines from weak demand and tariff pressures.", "published_at": "2025-08-06T12:31:00Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "99a1ba8b-ed0b-34ea-9399-cee54c38eeaf", "ticker": "JPM", "url": "https://www.coindesk.com/business/2025/08/06/marex-becomes-first-clearing-firm-to-adopt-jpmorgan-s-kinexys-with-brevan-howard-digital", "title": "Marex Becomes First Clearing Firm to Adopt JPMorgan’s Kinexys With Brevan Howard Digital", "summary": "The initiative is aimed at modernizing payment infrastructure and reducing settlement risk, Marex said.", "published_at": "2025-08-06T12:00:00Z", "sentiment": "negative", "confidence": 0.996}
{"id": "16df0330-5d74-32e7-9e2c-dd131caab334", "ticker": "JPM", "url": "https://finance.yahoo.com/news/bets-fed-rate-cuts-sweeping-203020777.html", "title": "Bets on Fed Rate Cuts Are Sweeping Through US Bond Market", "summary": "(Bloomberg) -- Bond traders are ramping up bets on the Federal Reserve cutting interest rates this year, as signs of a weakening US economy bolster the case for the central bank to reduce borrowing costs as demanded by President Donald Trump.Most Read from BloombergMayor Asked to Explain $1.4 Billion of Wasted Johannesburg FundsAll Hail the Humble Speed HumpPATH Train Service Resumes After Fire at Jersey City StationMajor Istanbul Projects Are Stalling as City Leaders Sit in JailWhat England’s N", "published_at": "2025-08-06T09:28:36Z", "sentiment": "positive", "confidence": 0.9997}
{"id": "40a097fb-b81a-3e21-88e5-8353fb49b4ac", "ticker": "JPM", "url": "https://finance.yahoo.com/video/jpms-crawford-still-sees-value-091220611.html", "title": "JPM's Crawford Still Sees Value in Owning Bonds in US", "summary": "Kim Crawford, global rates portfolio manager at JPMorgan Asset Management, explains why she's looking to the belly of the US yield curve and where she sees \"good opportunities\" in the global bond market.", "published_at": "2025-08-06T09:12:20Z", "sentiment": "neutral", "confidence": 0.988}
{"id": "34c719d6-90ae-3bd4-bb21-3a900ef49627", "ticker": "JPM", "url": "https://finance.yahoo.com/news/bull-day-jpmorgan-jpm-080000886.html", "title": "Bull of the Day: JPMorgan (JPM)", "summary": "JP Morgan's reasonable valuation, its consistent earnings, and its ability to capitalize on favorable interest rate environments set the stock up for continued out performance.", "published_at": "2025-08-06T08:00:00Z", "sentiment": "neutral", "confidence": 1.0}
{"id": "065358a4-cbd4-3b32-a17b-4255c099a4c0", "ticker": "JPM", "url": "https://finance.yahoo.com/news/stagflation-playbook-p-500-gets-093000984.html", "title": "Stagflation Playbook for S&P 500 Gets Fresh Look Before CPI Data", "summary": "(Bloomberg) -- As the specter of stagflation ripples through equity markets, investors are zeroing in on the upcoming consumer inflation report to see how close the dire economic scenario is to becoming a reality.Most Read from BloombergSunseeking Germans Face Swiss Backlash Over Alpine Holiday CongestionNew York Warns of $34 Billion Budget Hole, Biggest Since 2009 CrisisThree Deaths Reported as NYC Legionnaires’ Outbreak SpreadsA New Stage for the Theater That Gave America Shakespeare in the Pa", "published_at": "2025-08-11T09:30:00Z", "sentiment": "negative", "confidence": 0.9701}
